Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgr_trsp.po
Languages: es

source: **Unsupported versions:** `2.6 <https://docs.pgrouting.org/2.6/en/pgr_trsp.html>`__ `2.5 <https://docs.pgrouting.org/2.5/en/pgr_trsp.html>`__ `2.4 <https://docs.pgrouting.org/2.4/en/pgr_trsp.html>`__ `2.3 <https://docs.pgrouting.org/2.3/en/src/trsp/doc/pgr_trsp.html>`__ `2.2 <https://docs.pgrouting.org/2.2/en/src/trsp/doc/pgr_trsp.html>`__ `2.1 <https://docs.pgrouting.org/2.1/en/src/trsp/doc/index.html>`__ `2.0 <https://docs.pgrouting.org/2.0/en/src/trsp/doc/index.html>`__
es: **Versiones no soportadas:** `2.6 <https://docs.pgrouting.org/2.6/en/pgr_trsp.html>`__ `2.5 <https://docs.pgrouting.org/2.5/en/pgr_trsp.html>`__ `2.4 <https://docs.pgrouting.org/2.4/en/pgr_trsp.html>`__ `2.3 <https://docs.pgrouting.org/2.3/en/src/trsp/doc/pgr_trsp.html>`__ `2.2 <https://docs.pgrouting.org/2.2/en/src/trsp/doc/pgr_trsp.html>`__ `2.1 <https://docs.pgrouting.org/2.1/en/src/trsp/doc/index.html>`__ `2.0 <https://docs.pgrouting.org/2.0/en/src/trsp/doc/index.html>`__

source: pgr_trsp - Turn Restriction Shortest Path (TRSP)
es: pgr_trsp - Camino más corto con giros restringidos (TRSP)

source: ``pgr_trsp`` — Returns the shortest path with support for turn restrictions.
es: ``pgr_trsp`` — Devuelve el camino más corto con soporte para restricciones de giros

source: Availability
es: Disponibilidad

source: Version 2.1.0
es: Versión 2.1.0

source: New *Via* **prototypes**
es: Nuevo *Via* **prototypes**

source: Version 2.0.0
es: Versión 2.0.0

source: **Official** function
es: Función **oficial**

source: Description
es: Descripción

source: The turn restricted shorthest path (TRSP) is a shortest path algorithm that can optionally take into account complicated turn restrictions like those found in real world navigable road networks. Performamnce wise it is nearly as fast as the A* search but has many additional features like it works with edges rather than the nodes of the network. Returns a set of (seq, id1, id2, cost) or (seq, id1, id2, id3, cost) rows, that make up a path.
es: La ruta más corta restringida por giro (TRSP) es un algoritmo de ruta más corta que opcionalmente puede tener en cuenta restricciones de giro complicadas como las que se encuentran en las redes de carreteras del mundo real. En cuanto al rendimiento, es casi tan rápido como la búsqueda A* pero tiene muchas características adicionales, como funcionar con bordes en lugar de los nodos de la red. Devuelve un conjunto de filas (seq, id1, id2, cost) o (seq, id1, id2, id3, cost) que forman una ruta.

source: **The main characteristics are:**
es: **Las características principales son:**

source: The Turn Restricted Shortest Path algorithm (TRSP) is similar to the shooting star in that you can specify turn restrictions.
es: El algoritmo de la ruta más corta restringida por giro (TRSP) es similar a la estrella fugaz en que puede especificar restricciones de giro.

source: The TRSP setup is mostly the same as :doc:`Dijkstra shortest path <pgr_dijkstra>` with the addition of an optional turn restriction table. This provides an easy way of adding turn restrictions to a road network by placing them in a separate table.
es: La configuración de TRSP es en su mayoría la misma que :doc:`Dijkstra shortest path <pgr_dijkstra>` con la adición de una tabla de restricción de giro opcional. Esto proporciona una manera fácil de agregar restricciones de giro a una red de carreteras colocándolas en una tabla separada.

source: a SQL query, which should return a set of rows with the following columns:
es: una consulta SQL que debe proporcionar un conjunto de registros con los siguientes campos:

source: ``int4`` identifier of the edge
es: ``int4`` Identificador del borde

source: ``int4`` identifier of the source vertex
es: ``int4`` Identificador del vértice inicial del borde

source: ``int4`` identifier of the target vertex
es: ``int4`` Identificador del vértice final del borde

source: cost
es: Costo

source: ``float8`` value, of the edge traversal cost. A negative cost will prevent the edge from being inserted in the graph.
es: ``float8`` Costo del recorrido sobre el borde. Un costo negativo evitará que el borde sea insertado en el gráfico.

source: (optional) the cost for the reverse traversal of the edge. This is only used when the ``directed`` and ``has_rcost`` parameters are ``true`` (see the above remark about negative costs).
es: (opcional) El costo para el recorrido inverso del borde. Esto sólo se utiliza cuando los parámetros ``directed`` y ``has_rcost`` son ``True`` (ver el comentario anterior sobre los costos negativos).

source: ``int4`` **NODE id** of the start point
es: ``int4`` **identificador** del nodo de partida

source: ``int4`` **NODE id** of the end point
es: ``int4`` **identificador** del nodo de llegada

source: directed
es: dirigido

source: ``true`` if the graph is directed
es: ``true`` Si la gráfica es direccionada

source: if ``true``, the ``reverse_cost`` column of the SQL generated set of rows will be used for the cost of the traversal of the edge in the opposite direction.
es: Si es ``True``, el campo ``reverse_cost`` del conjunto de registros generados se utilizan para el calcular el costo de la travesía del borde en la dirección opuesta.

source: (optional) a SQL query, which should return a set of rows with the following columns:
es: (opcional) una consulta SQL, que debe proporcionar un conjunto de registros con los siguientes campos:

source: ``float8`` turn restriction cost
es: ``float8`` restricción del costo de giro

source: ``int4`` target id
es: ``int4`` identificador del borde donde se aplica la restricción

source: ``text`` comma separated list of edges in the reverse order of ``rule``
es: Lista de aristas ``text`` separadas por comas en el orden inverso de ``rule``

source: Another variant of TRSP allows to specify **EDGE id** of source and target together with a fraction to interpolate the position:
es: Otra variante de TRSP que permite especificar el **Identificador del borde** de partida y de llegada junto con una fracción para interpolar la posición:

source: ``int4`` **EDGE id** of the start edge
es: ``int4`` **identificador del borde** de partida

source: ``float8`` fraction of 1 defines the position on the start edge
es: ``float8`` fracción de 1 que define la posición del sobre el borde de partida.

source: ``int4`` **EDGE id** of the end edge
es: ``int4`` **Identificador del borde** de llegada

source: ``float8`` fraction of 1 defines the position on the end edge
es: ``float8`` fracción de 1 que define la posición del sobre el borde de llegada.

source: Returns set of:
es: Devuelve el conjunto de:

source: row sequence
es: Secuencia de registros

source: node ID
es: Identificador del nodo visitado

source: edge ID (``-1`` for the last row)
es: Identificador del borde (``-1`` para el ultimo registro)

source: cost to traverse from ``id1`` using ``id2``
es: costo para atravesar desde el nodo ``id1`` usando el borde``id2`` hasta su otro extremo

source: Support for Vias
es: Soporte para Vias

source: The Support for Vias functions are prototypes. Not all corner cases are being considered.
es: Las funciones de Soporte para Vias son prototipos. No se están considerando todos los casos de esquina.

source: We also have support for vias where you can say generate a from A to B to C, etc. We support both methods above only you pass an array of vertices or and array of edges and percentage position along the edge in two arrays.
es: También tenemos soporte para vias donde puedes generar una ruta de A a B a C, etc. Admitimos ambos métodos por encima de solo pasar un arreglo de vértices y/o un arreglo de aristas y la posición porcentual a lo largo de la arista en dos arreglos.

source: ``int4[]`` An ordered array of **NODE id** the path will go through from start to end.
es: ``int4[]`` Un arreglo ordenado de **NODE id** la ruta irá de principio a fin.

source: ``text`` commar separated list of edges in the reverse order of ``rule``
es: Lista de aristas `` text`` separadas por comas en el orden inverso de ``rule``

source: Another variant of TRSP allows to specify **EDGE id** together with a fraction to interpolate the position:
es: Otra variante de TRSP permite especificar **EDGE id** junto con una fracción para interpolar la posición:

source: ``int4`` An ordered array of **EDGE id** that the path has to traverse
es: ``int4`` Un arreglo ordenado de **EDGE id** que la ruta tiene que atravesar

source: pcts
es: Pct

source: ``float8`` An array of fractional positions along the respective edges in ``eids``, where 0.0 is the start of the edge and 1.0 is the end of the eadge.
es: `` float8`` Un arreglo de posiciones fraccionarias a lo largo de las respectivas aristasen ``eids``, donde 0.0 es el comienzo de la arista y 1.0 es el final.

source: route ID
es: Identificador de la ruta

source: cost to traverse from ``id2`` using ``id3``
es: costo para atravesar desde el nodo ``id2`` usando el borde ``id3`` hasta su otro extremo

source: Additional Examples
es: Ejemplos Adicionales

source: Example
es: Ejemplo

source: Without turn restrictions
es: Sin restricción de giros

source: With turn restrictions
es: Con restricción de giros

source: Then a query with turn restrictions is created as:
es: Entonces una consulta con restricciones de giro es creada de la siguiente forma:

source: An example query using vertex ids and via points:
es: Una consulta de ejemplo mediante identificadores de vértices y puntos de vía:

source: An example query using edge ids and vias:
es: Una consulta de ejemplo mediante identificadores de borde y vias:

source: The queries use the :doc:`sampledata` network.
es: Las consultas utilizan la red :doc:`sampledata` .

source: Known Issues
es: Problemas conocidos

source: Introduction
es: Introducción

source: pgr_trsp code has issues that are not being fixed yet, but as time passes and new functionality is added to pgRouting with wrappers to **hide** the issues, not to fix them.
es: el código pgr_trsp tiene problemas que aún no se están solucionando, pero a medida que pasa el tiempo y se agrega nueva funcionalidad a pgRouting, hay contenedores para **ocultar** los problemas, no para solucionarlos.

source: For clarity on the queries:
es: Para mayor claridad en las consultas:

source: _pgr_trsp (internal_function) is the original code
es: _pgr_trsp (internal_function) es el código original

source: pgr_trsp (lower case) represents the wrapper calling the original code
es: pgr_trsp (minúscula) representa el contenedor que convoca al código original

source: pgr_TRSP (upper case) represents the wrapper calling the replacement function, depending on the function, it can be:
es: pgr_TRSP (mayúsculas) representa el contenedor que convoca a la función de reemplazo. Dependiendo de esa función, puede ser:

source: _pgr_withPointsVia (internal function)
es: _pgr_withPointsVia (función interna)

source: The restrictions
es: Las restricciones

source: The restriction used in the examples does not have to do anything with the graph:
es: La restricción utilizada en los ejemplos no tiene que ver nada con el grafo:

source: No vertex has id: 25, 32 or 33
es: Ningún vértice tiene id: 25, 32 o 33

source: No edge has id: 25, 32 or 33
es: Ninguna arista tiene id: 25, 32 o 33

source: A restriction is assigned as:
es: Se asigna una restricción como:

source: The back end code has that same restriction as follows
es: El código back-end tiene la misma restricción que la siguiente

source: therefore the shortest path expected are as if there was no restriction involved
es: por lo tanto, la ruta más corta esperado es como si no hubiera ninguna restricción involucrada

source: The "Vertices" signature version
es: La versión de la firma "Vértices"

source: Different ways to represent 'no path found`
es: Diferentes formas de representar 'ninguna ruta encontrada'

source: Sometimes represents with EMPTY SET a no path found
es: A veces se representa con EMPTY SET ninguna ruta encontrada

source: Sometimes represents with Error a no path found
es: A veces representa con ERROR ninguna ruta encontrada

source: Returning EMPTY SET to represent no path found
es: Se devuelve EMPTY SET para representar ninguna ruta encontrada

source: pgr_trsp calls :doc:`pgr_dijkstra` when there are no restrictions which returns `EMPTY SET` when a path is not found
es: pgr_trsp invoca :doc:`pgr_dijkstra` cuando no hay restricciones que devuelvan `EMPTY SET` cuando no se encuentra una ruta

source: Throwing EXCEPTION to represent no path found
es: Se producirá una EXCEPCIÓN para representar ninguna ruta encontrada

source: pgr_trsp use the original code when there are restrictions, even if they have nothing to do with the graph, which will throw an EXCEPTION to represent no path found.
es: pgr_trsp utiliza el código original cuando hay restricciones, incluso si no tienen nada que ver con el grafo, lo que producirá una EXCEPCIÓN para representar ninguna ruta encontrada.

source: Routing from/to same location
es: Ruteo desde/hacia la misma ubicación

source: When routing from location :math:`1` to the same location :math:`1`, no path is needed to reach the destination, its already there. Therefore is expected to return an `EMPTY SET` or an `EXCEPTION` depending on the parameters
es: Al enrutar desde la ubicación :math:`1` a la misma ubicación :math:`1`, no se necesita ninguna ruta para llegar al destino, pues ya está allí. Por lo tanto, se espera que devuelva un `EMPTY SET` o un `EXCEPTION` dependiendo de los parámetros

source: Sometimes represents with EMPTY SET no path found (expected)
es: A veces se representa con EMPTY SET ninguna ruta encontrada (esperada)

source: Sometimes represents with EXCEPTION no path found (expected)
es: A veces se representa con EXCEPCIÓNninguna ruta encontrada (esperada)

source: Sometimes finds a path (not expected)
es: A veces se encuentra una ruta (no esperada)

source: Returning expected EMPTY SET to represent no path found
es: Se devuelve el SET EMPTY esperado para representar ninguna ruta encontrada

source: ``pgr_trsp`` calls :doc:`pgr_dijkstra` when there are no restrictions which returns the expected to return `EMPTY SET` to represent no path found.
es: ``pgr_trsp`` convoca a :doc:`pgr_dijkstra` cuando no hay resctricciones que devuelvan el `EMPTY SET` esperado para representar ninguna ruta encontrada.

source: Returning expected EXCEPTION to represent no path found
es: Devolver EXCEPTION esperada para representar ninguna ruta encontrada

source: In this case ``pgr_trsp`` calls the original code when there are restrictions, even if they have nothing to do with the graph, in this case that code throws the expected EXCEPTION
es: En este caso ``pgr_trsp`` llama al código original cuando hay restricciones, incluso si no tienen nada que ver con el grafo, en este caso ese código lanza la EXCEPCIÓN esperada

source: Returning unexpected path
es: Devolver una ruta inesperado

source: In this case ``pgr_trsp`` calls the original code when there are restrictions, even if they have nothing to do with the graph, in this case that code finds an unexpected path.
es: En este caso ``pgr_trsp`` llama al código original cuando hay restricciones, incluso si no tienen nada que ver con el grafo, en este caso ese código encuentra una ruta inesperada.

source: User contradictions
es: Contradicciones de usuarios

source: ``pgr_trsp`` unlike other pgRouting functions does not autodectect the existence of ``reverse_cost`` column. Therefor it has ``has_rcost`` parameter to check the existence of ``reverse_cost`` column. Contradictions happen:
es: ``pgr_trsp`` a diferencia de otras funciones de pgRouting no detecta automáticamente la existencia de la columna ``reverse_cost``. Por lo tanto, tiene el parámetro ``has_rcost`` para verificar la existencia de la columna ``reverse_cost``. Las contradicciones suceden:

source: When the reverse_cost is missing, and the flag `has_rcost` is set to true
es: Cuando falta reverse_cost, y la marca `has_rcost` se establece como verdadera

source: When the reverse_cost exists, and the flag `has_rcost` is set to false
es: Cuando el reverse_cost existe, y el indicador `has_rcost` se establece en false

source: When the reverse_cost is missing, and the flag `has_rcost` is set to true.
es: Cuando falta reverse_cost y el indicador `has_rcost` se configura como verdadero.

source: An EXCEPTION is thrown.
es: Se produce una EXCEPCIÓN.

source: The ``reverse_cost`` column will be effectively removed and will cost execution time
es: La columna de ``reverse_cost`` será eliminada efectivamente y costará tiempo de ejecución

source: The "Edges" signature version
es: La versión de firma "Edges"

source: Sometimes represents with EXCEPTION a no path found
es: A veces se representa con EXCEPCIÓN ninguna ruta encontrada

source: pgr_trsp calls :doc:`pgr_withPoints` when there are no restrictions which returns `EMPTY SET` when a path is not found
es: pgr_trsp invoca :doc:`pgr_withPoints` cuando no hay restricciones que devuelvan `EMPTY SET` cuando no se encuentra una ruta

source: Paths with equal number of vertices and edges
es: Rutas con igual número de vértices y aristas

source: A path is made of `N` vertices and `N - 1` edges.
es: Una ruta se conforma por `N` vértices y `N - 1` aristas.

source: Sometimes returns `N` vertices and `N - 1` edges.
es: A veces devuelve `N` vértices y `N - 1` aristas.

source: Sometimes returns `N - 1` vertices and `N - 1` edges.
es: A veces se devuelven `N - 1` vértices y `N - 1` aristas.

source: Returning `N` vertices and `N - 1` edges.
es: Retorno de `N` vértices y `N - 1` aristas.

source: pgr_trsp calls :doc:`pgr_withPoints` when there are no restrictions which returns the correct number of rows that will include all the vertices. The last row will have a ``-1`` on the edge column to indicate the edge number is invalidu for that row.
es: pgr_trsp convoca a :doc:`pgr_withPoints` cuando no hay restricciones que devuelvan el número correcto de filas que incluirán todos los vértices. La última fila tendrá un ``-1`` en la columna de aristas para indicar que el número de arista es inválido para esa fila.

source: Returning `N - 1` vertices and `N - 1` edges.
es: Retorno de `N - 1` vrtices'y `N - 1` aristas.

source: pgr_trsp use the original code when there are restrictions, even if they have nothing to do with the graph, and will not return the last vertex of the path.
es: pgr_trsp utiliza el código original cuando hay restricciones, incluso si no tienen nada que ver con el grafo, y no devolverán el último vértice de la ruta.

source: When routing from the same edge and position to the same edge and position, no path is needed to reach the destination, its already there. Therefore is expected to return an `EMPTY SET` or an `EXCEPTION` depending on the parameters, non of which is happening.
es: Al enrutar desde la misma arista y posición a la misma arista y posición, no se necesita ninguna ruta para llegar al destino, pues ya está allí. Por lo tanto, se espera que devuelva un `EMPTY SET` o una `EXCEPTION` dependiendo de los parámetros, ninguno de los cuales está sucediendo.

source: A path with 2 vertices and edge cost 0
es: Una ruta con 2 vértices y coste de arista 0

source: pgr_trsp calls :doc:`pgr_withPoints` setting the first :math:`(edge, position)` with a differenct point id from the second :math:`(edge, position)` making them different points. But the cost using the edge, is :math:`0`.
es: pgr_trsp convoca a :doc:`pgr_withPoints` configurando la primera :math:`(arista, posición)` con un diferente id de punto de la segunda :math:`(arista, posición)` haciendo de ellas diferentes puntos. Pero el costo usando la arista es de :math:`0`.

source: A path with 1 vertices and edge cost 0
es: Una ruta con 1 vértice y coste de arista 0

source: pgr_trsp use the original code when there are restrictions, even if they have nothing to do with the graph, and will not have the row for the vertex :math:`-2`.
es: pgr_trsp utiliza el código original cuando hay restricciones, incluso si no tienen nada que ver con el grafo, y no tendrán la fila para el vértice :math:`-2`.

source: Using a points of interest table
es: Uso de una tabla de puntos de interés

source: Given a set of points of interest:
es: Dado un conjunto de puntos de interés:

source: Using pgr_trsp
es: Uso de pgr_trsp

source: On *pgr_trsp*, to be able to use the table information:
es: En *pgr_trsp*, para poder utilizar la información de la tabla:

source: Each parameter has to be extracted explicitly from the table
es: Cada parámetro debe extraerse explícitamente de la tabla

source: Regardles of the point pid original value
es: Independientemente del punto pid valor original

source: will always be -1 for the first point
es: siempre será -1 para el primer punto

source: will always be -2 for the second point
es: siempre será -2 para el segundo punto

source: the row reaching point -2 will not be shown
es: la fila que alcanza el punto -2 no se mostrará

source: Using :doc:`pgr_withPoints`
es: Uso de :doc:`pgr_withPoints`

source: Suggestion: use :doc:`pgr_withPoints` when there are no turn restrictions:
es: Sugerencia: use :doc:`pgr_withPoints` cuando no hay restricciones de giro:

source: Results are more complete
es: Los resultados son más completos

source: Column names are meaningful
es: Los nombres de columna son significativos

source: Routing from a vertex to a point
es: Ruteo desde un vértice a un punto

source: Solving a shortest path from vertex :math:`6` to pid 1 using a points of interest table
es: Resolver una ruta más corta desde el vértice :math:`6` a pid 1 usando una tabla de puntos de interés

source: Vertex 6 is on edge 8 at 1 fraction
es: El vértice 6 está en el borde 8 en 1 fracción

source: Vertex 6 is also edge 11 at 0 fraction
es: El vértice 6 es también borde 11 en 0 fracción

source: No need to choose where the vertex is located.
es: No es necesario elegir dónde se encuentra el vértice.

source: prototypes
es: Prototipos

source: ``pgr_trspViaVertices`` and ``pgr_trspViaEdges`` were added to pgRouting as prototypes
es: ``pgr_trspViaVertices`` y ``pgr_trspViaEdges`` fueron añadidas como prototipos

source: These functions use the pgr_trsp functions inheriting all the problems mentioned above. When there are no restrictions and have a routing "via" problem with vertices:
es: Estas funciones utilizan las funciones pgr_trsp heredando todos los problemas mencionados anteriormente. Cuando no hay restricciones y tienen un problema de ruteo "vía" con vértices:

source: See Also
es: Ver también

source: Indices and tables
es: Índices y tablas
