Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: ``seq`` changed type to ``BIGINT``
sv: ``seq`` har ändrat typ till ``BIGINT``
zh_hans: ``seq`` 将类型更改为``BIGINT``

source: The biconnected components of an undirected graph are the maximal subsets of vertices such that the removal of a vertex from particular component will not disconnect the component. Unlike connected components, vertices may belong to multiple biconnected components. Vertices can be present in multiple biconnected components, but each edge can only be contained in a single biconnected component.
sv: De biconnected komponenterna i en odelad graf är de maximala delmängderna av hörnpunkter så att borttagandet av en hörnpunkt från en viss komponent inte kommer att koppla bort komponenten. Till skillnad från anslutna komponenter kan toppar tillhöra flera biconnected components. Toppar kan förekomma i flera biconnected components, men varje kant kan bara ingå i en enda biconnected component.
zh_hans: 无向图的双连通分量是顶点的最大子集，因此从特定分量中删除顶点不会断开该分量。 与连接组件不同，顶点可以属于多个双连接组件。 顶点可以存在于多个双连通分量中，但每条边只能包含在单个双连通分量中。

source: Components are described by edges.
sv: Komponenterna beskrivs med kanter.
zh_hans: 组件由边描述。

source: ``component`` ascending.
sv: ``komponent`` stigande.
zh_hans: ``component`` 升序。

source: ``edge`` ascending.
sv: ``kant`` stigande.
zh_hans: ``edge``升序。

source: Returns set of |result-component-E|
sv: Returnerar uppsättning av |resultat-komponent-E|

source: The biconnected components of the graph
sv: De biconnected komponenterna i grafen
zh_hans: 图的双连通分量

source: ``component``
sv: ``komponent``

source: Component identifier.
sv: Komponentens identifierare.
zh_hans: 分量标识符。

source: Has the value of the minimum edge identifier in the component.
sv: Har värdet för den minsta kantidentifieraren i komponenten.
zh_hans: 具有组件中最小边标识符的值。

source: Identifier of the edge that belongs to the ``component``.
sv: Identifierare av den kant som tillhör ``komponenten``.
zh_hans: 属于该``分量``的边的标识符。

source: ``pgr_binaryBreadthFirstSearch`` - Experimental
sv: ``pgr_binaryBreadthFirstSearch`` - Experimentell
zh_hans: ``pgr_binaryBreadthFirstSearch`` - 实验

source: ``pgr_binaryBreadthFirstSearch`` — Returns the shortest path in a binary graph.
sv: ``pgr_binaryBreadthFirstSearch`` - Returnerar den kortaste vägen i en binär graf.

source: Any graph whose edge-weights belongs to the set {0,X}, where 'X' is any non-negative integer, is termed as a 'binary graph'.
sv: En graf vars kantvikter tillhör uppsättningen {0,X}, där "X" är ett icke-negativt heltal, kallas för en "binär graf".
zh_hans: 任何边权属于集合 {0,X} 的图（其中“X”是任何非负整数）都被称为“二元图”。

source: It is well-known that the shortest paths between a single source and all other vertices can be found using Breadth First Search in :math:`O(|E|)` in an unweighted graph, i.e. the distance is the minimal number of edges that you need to traverse from the source to another vertex. We can interpret such a graph also as a weighted graph, where every edge has the weight :math:`1`. If not all edges in graph have the same weight, that we need a more general algorithm, like Dijkstra's Algorithm which runs in :math:`O(|E|log|V|)` time.
sv: Det är välkänt att de kortaste vägarna mellan en enda källa och alla andra toppar kan hittas med hjälp av Breadth First Search på :math:`O(|E|)` i en oviktad graf, dvs. avståndet är det minsta antalet kanter som du behöver korsa från källan till en annan topp. Vi kan också tolka en sådan graf som en viktad graf, där varje kant har vikten :math:`1`. Om inte alla kanter i grafen har samma vikt behöver vi en mer allmän algoritm, som Dijkstras algoritm, som går på :math:`O(|E|log|V|)` tid.

source: However if the weights are more constrained, we can use a faster algorithm. This algorithm, termed as 'Binary Breadth First Search' as well as '0-1 BFS', is a variation of the standard Breadth First Search problem to solve the SSSP (single-source shortest path) problem in :math:`O(|E|)`, if the weights of each edge belongs to the set {0,X}, where 'X' is any non-negative real integer.
sv: Men om vikterna är mer begränsade kan vi använda en snabbare algoritm. Den här algoritmen, som kallas "Binary Breadth First Search" eller "0-1 BFS", är en variant av standardproblemet Breadth First Search för att lösa SSSP-problemet (kortaste vägen med en källa) på :math:`O(|E|)`, om vikterna för varje kant tillhör uppsättningen {0,X}, där "X" är ett icke-negativt heltal.
zh_hans: 然而，如果权重受到更多限制，我们可以使用一种更快的算法。这个算法被称为'二进制广度优先搜索'，也称为'0-1 BFS'，它是标准广度优先搜索问题的一种变体，用于解决单源最短路径（SSSP）问题，当每条边的权重属于集合{0，X}，其中'X'是任意非负实数时，其时间复杂度为 :math:`O(|E|)`。

source: Process is done only on 'binary graphs'. ('Binary Graph': Any graph whose edge-weights belongs to the set {0,X}, where 'X' is any non-negative real integer.)
sv: Processen görs endast på "binära grafer". ('Binär graf': En graf vars kantvikter tillhör uppsättningen {0,X}, där "X" är ett icke-negativt reellt heltal)
zh_hans: 过程仅在“二元图”上完成。 （“二元图”：边权重属于集合 {0,X} 的任何图，其中“X”是任何非负实整数。）

source: Running time: :math:`O(| start\_vids | * |E|)`
sv: Speltid: :math:`O(| start\_vids | * |E|)``
zh_hans: 运行时间： :math:`O(| start\_vids | * |E|)`

source: **Note:** Using the :doc:`sampledata` Network as all weights are same (i.e :math:`1``)
sv: **Anmärkning:** Använda :doc:`sampledata` Network eftersom alla vikter är desamma (dvs :math:`1``)
zh_hans: **注意:** 使用 :doc:`示例数据`网络，因为所有权重都相同（即为 :math:`1``）

source: `Boost: Breadth First Search <https://www.boost.org/libs/graph/doc/breadth_first_search.html>`__
sv: `Boost: Bredd först Sök <https://www.boost.org/libs/graph/doc/breadth_first_search.html>`__

source: https://en.wikipedia.org/wiki/Dijkstra%27s_algorithm#Specialized_variants
sv: https://en.wikipedia.org/wiki/Dijkstra%27s_algoritm#Specialiserade_varianter

source: ``pgr_bipartite`` - Experimental
sv: ``pgr_bipartite`` - Experimentell

source: ``pgr_bipartite`` — Disjoint sets of vertices such that no two vertices within the same set are adjacent.
sv: ``pgr_bipartite`` - Disjunkta uppsättningar av hörnpunkter så att inga två hörnpunkter inom samma uppsättning är angränsande.
zh_hans: `pgr_bipartite` - 不相邻的顶点集合，同一集合中没有两个顶点相邻。

source: A bipartite graph is a graph with two sets of vertices which are connected to each other, but not within themselves. A bipartite graph is possible if the graph coloring is possible using two colors such that vertices in a set are colored with the same color.
sv: En bipartitisk graf är en graf med två uppsättningar av hörn som är kopplade till varandra, men inte inom sig själva. En bipartitisk graf är möjlig om grafen kan färgläggas med två färger så att topparna i en uppsättning färgas med samma färg.
zh_hans: 二方图是指有两组顶点的图，这两组顶点相互连接，但内部没有连接。如果可以使用两种颜色对图形着色，从而使一个集合中的顶点着色为相同的颜色，那么就可能是一个二方图。

source: The algorithm works in undirected graph only.
sv: Algoritmen fungerar endast i ostyrda grafer.
zh_hans: 该算法只适用于无向图。

source: The returned values are not ordered.
sv: De returnerade värdena är inte ordnade.
zh_hans: 返回值没有排序。

source: The algorithm checks graph is bipartite or not. If it is bipartite then it returns the node along with two colors `0` and `1` which represents two different sets.
sv: Algoritmen kontrollerar om grafen är tvådelad eller inte. Om den är bipartite returnerar den noden tillsammans med två färger `0` och `1` som representerar två olika uppsättningar.
zh_hans: 该算法检查图是否是二分图。 如果它是二分的，那么它返回节点以及代表两个不同集合的两种颜色 `0` 和`1`。

source: If graph is not bipartite then algorithm returns empty set.
sv: Om grafen inte är bipartitisk returnerar algoritmen en tom uppsättning.
zh_hans: 如果图不是两部分的，那么算法会返回空集。

source: When the graph is bipartite
sv: När grafen är tvådelad
zh_hans: 当图形为两方时

source: Additional Example
sv: Ytterligare exempel
zh_hans: 附加示例

source: The odd length cyclic graph can not be bipartite.
sv: Den cykliska grafen med udda längd kan inte vara bipartit.
zh_hans: 奇长循环图不可能是两部分的。

source: The edge :math:`5 \rightarrow 1` will make subgraph with vertices :math:`\{1, 3, 7, 6, 5\}` an odd length cyclic graph, as the cycle has 5 vertices.
sv: Kanten :math:`5 \rightarrow 1` kommer att göra undergrafen med hörn :math:`\{1, 3, 7, 6, 5\}` till en cyklisk graf med udda längd, eftersom cykeln har 5 hörn.
zh_hans: 边 :math:`5 \rightarrow 1` 将使顶点为 :math:`\{1, 3, 7, 6, 5\}` 的子图成为奇数长度的循环图，因为循环有 5 个顶点。

source: Edges in blue represent odd length cycle subgraph.
sv: Kanter i blått representerar cykelundergraf med udda längd.
zh_hans: 蓝色边代表奇数长度循环子图。

source: `Wikipedia: bipartite graph <https://en.wikipedia.org/wiki/Bipartite_graph>`__
sv: `Wikipedia: bipartitgraf <https://en.wikipedia.org/wiki/Bipartite_graph>`__
zh_hans: `维基百科：二分图 <https://en.wikipedia.org/wiki/Bipartite_graph>`__

source: ``pgr_boykovKolmogorov`` — Calculates the flow on the graph edges that maximizes the flow from the sources to the targets using Boykov Kolmogorov algorithm.
sv: ``pgr_boykovKolmogorov`` - Beräknar flödet på grafens kanter som maximerar flödet från källorna till målen med hjälp av Boykov Kolmogorov-algoritmen.
zh_hans: `pgr_boykovKolmogorov`` - 使用 Boykov Kolmogorov 算法计算图边的流量，使从源到目标的流量最大。

source: Renamed from ``pgr_maxFlowBoykovKolmogorov``
sv: Borttagen från ``pgr_maxFlowBoykovKolmogorov``
zh_hans: 由 ``pgr_maxFlowBoykovKolmogorov`` 重命名

source: Function promoted to proposed.
sv: Funktion befordrad till föreslagen.

source: Running time: Polynomial
sv: Drifttid: Polynom
zh_hans: 运行时间：多项式时间

source: Returns set of |result-flow|
sv: Returnerar uppsättning av |result-flow|

source: From vertex :math:`11` to vertex :math:`12`
sv: Från toppunkten :math:`11` till toppunkten :math:`12`
zh_hans: 从顶点:math:`11`到顶点 :math:`12`

source: From vertex :math:`11` to vertices :math:`\{5, 10, 12\}`
sv: Från toppunkten :math:`11` till toppunkterna :math:`{\5, 10, 12\}`
zh_hans: 从顶点:math:`11`到顶点 :math:`\{5, 10, 12\}`

source: From vertices :math:`\{11, 3, 17\}` to vertex :math:`12`
sv: Från topparna :math:`\{11, 3, 17\}` till topp :math:`12`
zh_hans: 从顶点:math:`\{11, 3, 17\}`到顶点:math:`12`

source: From vertices :math:`\{11, 3, 17\}` to vertices :math:`\{5, 10, 12\}`
sv: Från topparna :math:`{11, 3, 17\}` till topparna :math:`{5, 10, 12\}`
zh_hans: 从顶点:math:`\{11, 3, 17\}`到顶点:math:`\{5, 10, 12\}`

source: Using a combinations table, equivalent to calculating result from vertices :math:`\{5, 6\}` to vertices :math:`\{10, 15, 14\}`.
sv: Att använda en kombinationstabell motsvarar att beräkna resultatet från topparna :math:`\{5, 6\}` till topparna :math:`\{10, 15, 14\}`.
zh_hans: 使用组合表，相当于计算从顶点:math:`{5, 6\}` 到顶点:math:`{10, 15, 14\}` 的结果。

source: `Boost: Boykov Kolmogorov max flow <https://www.boost.org/libs/graph/doc/boykov_kolmogorov_max_flow.html>`__
sv: `Boost: Boykov Kolmogorov maxflöde <https://www.boost.org/libs/graph/doc/boykov_kolmogorov_max_flow.html>`__

source: ``pgr_breadthFirstSearch`` - Experimental
sv: ``pgr_breadthFirstSearch`` - Experimentell
zh_hans: ``pgr_breadthFirstSearch`` - 实验

source: ``pgr_breadthFirstSearch`` — Returns the traversal order(s) using Breadth First Search algorithm.
sv: ``pgr_breadthFirstSearch`` - Returnerar traverseringsordning(ar) med algoritmen Breadth First Search.
zh_hans: ``pgr_breadthFirstSearch`` —使用广度优先搜索算法返回遍历顺序。

source: Provides the Breadth First Search traversal order from a root vertex to a particular depth.
sv: Ger genomgångsordningen Breadth First Search från en rotvertex till ett visst djup.
zh_hans: 提供从根顶点到特定深度的广度优先搜索遍历顺序。

source: The implementation will work on any type of graph.
sv: Implementeringen kommer att fungera på alla typer av grafer.
zh_hans: 该实现适用于任何类型的图。

source: Provides the Breadth First Search traversal order from a source node to a target depth level.
sv: Ger traverseringsordningen Breadth First Search från en källnod till en måldjupnivå.
zh_hans: 提供从源节点到目标深度级别的广度优先搜索遍历顺序。

source: Running time: :math:`O(E + V)`
sv: Speltid: :math:`O(E + V)`
zh_hans: 运行时间：:math:`O(E + V)`

source: From root vertex :math:`6` on a **directed** graph with edges in ascending order of ``id``
sv: Från rotpunkten :math:`6` på en **riktad** graf med kanter i stigande ordning efter ``id``
zh_hans: 从根顶点:math:`6` 开始，该顶点位于一个**有向**图中，其边按 ``id``升序排列

source: From root vertices :math:`\{12, 6\}` on an **undirected** graph with **depth** :math:`<= 2` and edges in ascending order of ``id``
sv: Från rotkärnor :math:`{12, 6\}` på en **omdirigerad** graf med **djup** :math:`<= 2` och kanter i stigande ordning efter `id``
zh_hans: 从根顶点 :math:`\{12, 6\}` 开始，在一个**无向**图中，**深度**限制为 :math:`<= 2`，并且边按 ``id`` 升序排列

source: DFS optional parameters
sv: DFS valfria parametrar
zh_hans: DFS可选参数

source: Same as `Single vertex`_ with edges in ascending order of ``id``.
sv: Samma som `Single vertex`_ med kanter i stigande ordning efter ``id``.
zh_hans: 与 `单个顶点`_ 相同，边按 ``id`` 升序排列。

source: Same as `Single vertex`_ with edges in descending order of ``id``.
sv: Samma som `Single vertex`_ med kanter i fallande ordning efter ``id``.
zh_hans: 与 `单个顶点`_ 相同，边按 ``id`` 降序排列。

source: The resulting traversal is different.
sv: Den resulterande traversalen är annorlunda.
zh_hans: 由此产生的遍历是不同的。

source: The left image shows the result with ascending order of ids and the right image shows with descending order of the edge identifiers.
sv: Den vänstra bilden visar resultatet med stigande ordning av id:n och den högra bilden visar med fallande ordning av kantidentifierarna.
zh_hans: 左侧图像显示了按id升序排列的结果，右侧图像显示了按边标识降序排列的结果。

source: ascending
sv: stigande
zh_hans: 升序

source: descending
sv: fallande
zh_hans: 降序

source: `Wikipedia: Breadth First Search algorithm <https://en.wikipedia.org/wiki/Breadth-first_search>`__
sv: `Wikipedia: Algoritmen för bred första sökning <https://en.wikipedia.org/wiki/Breadth-first_search>`__
zh_hans: `维基百科: 广度优先搜索算法<https://en.wikipedia.org/wiki/Breadth-first_search>`__

source: ``pgr_bridges``
sv: ``pgr_bryggor``

source: ``pgr_bridges`` - Return the bridges of an undirected graph.
sv: ``pgr_bridges`` - Returnerar broarna i en odränerad graf.
zh_hans: ``pgr_bridges`` - 返回无向图的桥。

source: A bridge is an edge of an undirected graph whose deletion increases its number of connected components. This implementation can only be used with an undirected graph.
sv: En bro är en kant i en odelad graf vars borttagning ökar dess antal anslutna komponenter. Denna implementation kan endast användas med en odelad graf.
zh_hans: 桥是指一个无向图中的边，如果删除它会增加该图的连通分量数量。此实现仅适用于无向图。

source: ``edge`` ascending
sv: ``kant`` stigande
zh_hans: ``edge``升序

source: Running time: :math:`O(E * (V + E))`
sv: Speltid: :math:`O(E * (V + E))`
zh_hans: 运行时间：:math:`O(E * (V + E))`

source: Returns set of |result-edge|
sv: Returnerar uppsättning av |result-edge|

source: The bridges of the graph
sv: Bryggorna i grafen
zh_hans: 图的桥

source: Identifier of the edge that is a bridge.
sv: Identifierar den kant som är en bro.
zh_hans: 作为桥的边的标识符。

source: `Boost: Connected components <https://www.boost.org/libs/graph/doc/connected_components.html>`__
sv: `Boost: Anslutna komponenter <https://www.boost.org/libs/graph/doc/connected_components.html>`__

source: ``pgr_chinesePostman`` - Experimental
sv: ``pgr_chinesePostman`` - Experimentell
zh_hans: ``pgr_chinesePostman`` - 实验

source: ``pgr_chinesePostman`` — Calculates the shortest circuit path which contains every edge in a directed graph and starts and ends on the same vertex.
sv: ``pgr_chinesePostman`` - Beräknar den kortaste kretsvägen som innehåller varje kant i en riktad graf och som börjar och slutar på samma toppunkt.
zh_hans: `pgr_chinesePostman` — 计算包含有向图中的每条边并从同一顶点开始和结束的最短回路路径。

source: Returns ``EMPTY SET`` on a disconnected graph
sv: Returnerar ``EMPTY SET`` på en frånkopplad graf
zh_hans: 在一个不连通的图上返回 ``EMPTY SET``

source: Returns set of |result-1-1-no-seq|
sv: Returnerar uppsättning av |resultat-1-1-no-seq|
zh_hans: 返回|result-1-1-no-seq|的集合

source: Returns set of ``(seq, node, edge, cost, agg_cost)``
sv: Returnerar uppsättning av ``(seq, nod, kant, kostnad, agg_cost)``

source: Sequential value starting from ``1``
sv: Sekventiellt värde med början från ``1``
zh_hans: 从 ``1``开始的顺序值

source: Identifier of the edge used to go from ``node`` to the next node in the path sequence. ``-1`` for the last node of the path.
sv: Identifierar den kant som används för att gå från ``node`` till nästa nod i bansekvensen. ``-1`` för den sista noden i sökvägen.
zh_hans: 用于从路径序列中的``节点``到下一个节点的边的标识符。``-1`` 表示路径的最后一个节点。

source: Aggregate cost from ``start_v`` to ``node``.
sv: Sammanlagd kostnad från ``start_v`` till ``node``.
zh_hans: 从``start_v``到``node``的总成本。

source: ``pgr_chinesePostmanCost`` - Experimental
sv: ``pgr_chinesePostmanCost`` - Experimentell
zh_hans: ``pgr_chinesePostmanCost`` - 实验

source: ``pgr_chinesePostmanCost`` — Calculates the minimum costs of a circuit path which contains every edge in a directed graph and starts and ends on the same vertex.
sv: ``pgr_chinesePostmanCost`` - Beräknar minimikostnaderna för en kretsbana som innehåller varje kant i en riktad graf och som börjar och slutar på samma vertex.
zh_hans: ``pgr_chinesePostmanCost`` — 计算一个包含有向图中的每条边、以同一顶点为起点和终点的最短成本的回路路径。

source: Return value when the graph if disconnected
sv: Returvärde när grafen är frånkopplad
zh_hans: 当图是不连通的时候返回的数值

source: RETURNS ``FLOAT``
sv: RETURNERAR ``FLÖDE``

source: Minimum costs of a circuit path.
sv: Minimikostnader för en kretsbana.
zh_hans: 一个回路路径的最小成本。

source: ``pgr_connectedComponents``
sv: ``pgr_anslutnaKomponenter``

source: ``pgr_connectedComponents`` — Connected components of an undirected graph using a DFS-based approach.
sv: ``pgr_connectedComponents`` - Anslutna komponenter i en odelad graf med hjälp av en DFS-baserad metod.
zh_hans: ``pgr_connectedComponents`` — 使用基于深度优先搜索（DFS）的方法计算无向图的连通分量。

source: A connected component of an undirected graph is a set of vertices that are all reachable from each other.
sv: En kopplad komponent i en odelad graf är en uppsättning hörn som alla är nåbara från varandra.
zh_hans: 无向图的一个连通分量是一组顶点，它们之间都可以相互到达。

source: Components are described by vertices
sv: Komponenterna beskrivs av hörn
zh_hans: 连通分量由顶点描述

source: ``component`` ascending
sv: ``komponent`` stigande
zh_hans: ``component`` 升序

source: Returns set of |result-component-V|
sv: Returnerar uppsättning av |resultat-komponent-V|

source: The connected components of the graph
sv: De anslutna komponenterna i grafen
zh_hans: 图的连通分量

source: Has the value of the minimum node identifier in the component.
sv: Har värdet för den minsta nodidentifieraren i komponenten.
zh_hans: 具有组件中的最小节点标识符值。

source: Identifier of the vertex that belongs to the ``component``.
sv: Identifierare av den toppunkt som tillhör ``komponenten``.
zh_hans: 属于该 ``组件``的顶点的标识符。

source: Connecting disconnected components
sv: Anslutning av frånkopplade komponenter
zh_hans: 连接不连通的组件

source: wikipedia: `Connected component <https://en.wikipedia.org/wiki/Connected_component_(graph_theory)>`__
sv: wikipedia: sammanhängande komponent <https://en.wikipedia.org/wiki/Connected_component_(grafteori)>`__
zh_hans: 维基百科: `连通分量 <https://en.wikipedia.org/wiki/Connected_component_(graph_theory)>`__

source: ``pgr_contraction``
sv: ``pgr_kontraktion``

source: ``pgr_contraction`` — Performs graph contraction and returns the contracted vertices and edges.
sv: ``pgr_contraction`` - Utför grafkontraktion och returnerar de kontraherade topparna och kanterna.
zh_hans: ``pgr_contraction`` — 执行图收缩操作并返回收缩后的顶点和边。

source: New signature:
sv: Ny signatur:

source: Previously compulsory parameter **Contraction order** is now optional with name ``methods``.
sv: Den tidigare obligatoriska parametern **Contraction order** är nu valfri med namnet ``methods``.

source: New name and order of optional parameters.
sv: Nytt namn och ordning på valfria parametrar.

source: Deprecated signature pgr_contraction(text,bigint[],integer,bigint[],boolean)
sv: Föråldrad signatur pgr_contraction(text,bigint[],integer,bigint[],boolean)

source: Name change from ``pgr_contractGraph``
sv: Namnändring från ``pgr_contractGraph``
zh_hans: ``pgr_contractGraph`` 的名称更改

source: Bug fixes
sv: Buggfixar
zh_hans: Bug修复

source: Contraction reduces the size of the graph by removing some of the vertices and edges and, for example, might add edges that represent a sequence of original edges decreasing the total time and space used in graph algorithms.
sv: Kontraktion minskar storleken på grafen genom att ta bort några av topparna och kanterna och till exempel lägga till kanter som representerar en sekvens av ursprungliga kanter, vilket minskar den totala tid och det utrymme som används i grafalgoritmer.
zh_hans: 收缩通过移除一些顶点和边来减小图的规模，例如，可能添加表示原始边序列的边，从而减少了在图算法中使用的总时间和空间。

source: Does not return the full contracted graph.
sv: Returnerar inte hela den kontraherade grafen.

source: Only changes on the graph are returned.
sv: Endast ändringar i diagrammet returneras.

source: The returned values include:
sv: De returnerade värdena inkluderar:

source: The new edges generated by linear contraction.
sv: De nya kanterna som genereras av linjär sammandragning.

source: The modified vertices generated by dead end contraction.
sv: De modifierade topparna som genereras av sammandragning av återvändsgränder.

source: The returned values are ordered as follows:
sv: De returnerade värdena är ordnade enligt följande:
zh_hans: 返回值的排序如下：

source: column ``id`` ascending when its a modified vertex.
sv: kolumn ``id`` stigande när det är en modifierad vertex.

source: column ``id`` with negative numbers descending when its a new edge.
sv: kolumn ``id`` med negativa tal fallande när det är en ny kant.

source: Currently there are two types of contraction methods included in this function:
sv: För närvarande finns det två typer av sammandragningsmetoder som ingår i denna funktion:

source: Dead End Contraction. See :doc:`pgr_contractionDeadEnd`.
sv: Kontraktion för återvändsgränd. Se :doc:`pgr_contractionDeadEnd`.

source: Linear Contraction. See :doc:`pgr_contractionLinear`.
sv: Linjär sammandragning. Se :doc:`pgr_contractionLinear`.

source: Returns set of |result-contract|
sv: Returnerar uppsättning av |resultat-kontrakt|
zh_hans: Returns set of |result-toposort|

source: Dead end and linear contraction in that order on an undirected graph.
sv: Dead end och linjär sammandragning i den ordningen på en odelad graf.

source: Contraction optional parameters
sv: Sammandragning valfria parametrar
zh_hans: 可选收缩参数

source: ``methods``
sv: ``metoder``

source: Ordered contraction operations.
sv: Beställde sammandragningsoperationer.
zh_hans: 有序收缩操作。

source: 1 = Dead end contraction
sv: 1 = Kontraktion i återvändsgränd
zh_hans: 1=死端收缩

source: 2 = Linear contraction
sv: 2 = Linjär sammandragning
zh_hans: 2=线性收缩

source: ``cycles``
sv: ``cykler``

source: Number of times the contraction methods will be performed.
sv: Antal gånger som sammandragningsmetoderna ska utföras.

source: ``forbidden``
sv: ``förbjudet``

source: Identifiers of vertices forbidden for contraction.
sv: Identifierare av hörn som är förbjudna för sammandragning.
zh_hans: 禁止收缩的顶点标识符。

source: The function returns a single row. The columns of the row are:
sv: Funktionen returnerar en enda rad. Kolumnerna i raden är:
zh_hans: 该函数返回一行数据。该行的列包括：

source: ``type``
sv: ``typ``

source: Type of the row.
sv: Typ av rad.

source: ``v`` when the row is a vertex.
sv: ``v`` när raden är en vertex.
zh_hans: 当该行表示一个顶点时，列为``v``。

source: Column ``id`` has a positive value.
sv: Kolumnen ``id`` har ett positivt värde.

source: ``e`` when the row is an edge.
sv: ``e`` när raden är en kant.
zh_hans: ``e`` 当该行是一条边时。

source: Column ``id`` has a negative value.
sv: Kolumnen ``id`` har ett negativt värde.

source: All numbers on this column are ``DISTINCT``
sv: Alla siffror i denna kolumn är ``DISTINCT``
zh_hans: 此列中的所有数字都是``DISTINCT``

source: When ``type`` = **'v'**.
sv: När ``typ`` = **'v'**.
zh_hans: 当``type`` = **'v'**时。

source: Identifier of the modified vertex.
sv: Identifierare för det modifierade toppunktet.
zh_hans: 修改顶点的标识符。
