Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Wikipedia: https://en.wikipedia.org/wiki/Dijkstra%27s_algorithm
sv: Wikipedia: https://en.wikipedia.org/wiki/Dijkstra%27s_algoritm
zh_hans: 维基百科：https://en.wikipedia.org/wiki/Dijkstra%27s_algorithm

source: ``pgr_dijkstraNearCost`` - Proposed
sv: ``pgr_dijkstraNearCost`` - Förslag
zh_hans: ``pgr_dijkstraNearCost`` - 拟议

source: ``pgr_dijkstraNearCost`` — Using dijkstra algorithm, finds the route that leads to the nearest vertex.
sv: ``pgr_dijkstraNearCost`` - Med hjälp av dijkstra-algoritmen hittar du den rutt som leder till närmaste toppunkt.
zh_hans: `pgr_dijkstraNearCost`` - 使用 dijkstra 算法，找到通往最近顶点的路径。

source: Departing on a car from a subway station find the nearest **two** stations to vertex :math:`6`
sv: Avgår med en bil från en tunnelbanestation hitta de närmaste **två** stationerna till toppunkten :math:`6``
zh_hans: 从地铁站开车出发找到距离顶点:math:`6`最近的**两个**车站

source: The best one is :math:`(11 \rightarrow 16)` with a cost of :math:`1` (lines: `1`)
sv: Den bästa är :math:`(11 \rightarrow 16)` med en kostnad av :math:`1` (rader: `1`)
zh_hans: 最好的方法是 :math:`(11/rightarrow 16)`，成本是 :math:`1` (lines: `1`)

source: Both are equally good as they have the same cost. (lines: `12` and `13`)
sv: Båda är lika bra eftersom de har samma kostnad. (rader: `12` och `13`)

source: ``pgr_dijkstraVia`` - Proposed
sv: ``pgr_dijkstraVia`` - Förslag
zh_hans: ``pgr_dijkstraVia`` -拟议

source: ``pgr_dijkstraVia`` — Route that goes through a list of vertices.
sv: ``pgr_dijkstraVia`` - Rutt som går genom en lista med toppar.
zh_hans: `pgr_dijkstraVia` - 经过顶点列表的路径。

source: Given a list of vertices and a graph, this function is equivalent to finding the shortest path between :math:`vertex_i` and :math:`vertex_{i+1}` for all :math:`i < size\_of(via\;vertices)`.
sv: Med en lista över hörnpunkter och en graf är denna funktion likvärdig med att hitta den kortaste vägen mellan :math:`vertex_i` och :math:`vertex_{i+1}` för alla :math:`i < size\_of(via\;hörnpunkter)`.
zh_hans: 给定一个顶点列表和一个图，该函数等价于为所有 :math:`i < size\of(via\;vertices)` 的 :math:`vertex_i` 和 :math:`vertex_{i+1}` 之间找到最短路径。

source: Route
sv: Rutt
zh_hans: 路线

source: is a sequence of paths.
sv: är en sekvens av banor.
zh_hans: 是一个路径序列。

source: Path
sv: Sökväg
zh_hans: 路径

source: is a section of the route.
sv: är en del av rutten.
zh_hans: 是路线的一段。

source: One Via
sv: En Via
zh_hans: 一次通过

source: Returns set of |via-result|
sv: Returnerar uppsättning av |via-resultat|
zh_hans: 返回 |via-result| 的集合

source: Find the route that visits the vertices :math:`\{5, 1, 8\}` in that order on an directed graph.
sv: Hitta den rutt som besöker topparna :math:`\{5, 1, 8\}` i den ordningen i en riktad graf.

source: Via optional parameters
sv: Via valfria parametrar
zh_hans: Via可选参数

source: When ``true`` departing from a visited vertex will not try to avoid
sv: När ``true`` avgår från en besökt vertex kommer inte att försöka undvika
zh_hans: 为 `true` 时，从访问过的顶点出发时不会试图避开

source: Identifier of a path. Has value **1** for the first path.
sv: Identifierare för ett led. Har värdet **1** för det första tågläget.
zh_hans: 路径的标识符。 第一条路径的值为 **1**。

source: Identifier of the edge used to go from ``node`` to the next node in the path sequence.
sv: Identifierar den kant som används för att gå från ``node`` till nästa nod i bansekvensen.
zh_hans: 用于从路径序列中的 ``node``到下一个节点的边的标识符。

source: -1 for the last node of the path.
sv: -1 för den sista noden på vägen.
zh_hans: -1，表示路径的最后一个节点。

source: -2 for the last node of the route.
sv: -2 för den sista noden i rutten.
zh_hans: 路由的最后一个节点为 -2。

source: Total cost from ``start_vid`` of ``seq = 1`` to ``end_vid`` of the current ``seq``.
sv: Total kostnad från ``start_vid`` av ``seq = 1`` till ``slut_vid`` av den aktuella ``seq``.
zh_hans: 从 `seq = 1` 的 ``start_vid`` 到当前 `seq` 的 ``end_vid` 的总费用。

source: All this examples are about the route that visits the vertices :math:`\{5, 7, 1, 8, 15\}` in that order on a **directed** graph.
sv: Alla dessa exempel handlar om den rutt som besöker topparna :math:`\{5, 7, 1, 8, 15\}` i den ordningen på en **riktad** graf.
zh_hans: 所有这些示例都是关于在**有向**图上按顺序访问顶点 :math:`\{5, 7, 1, 8, 15\}` 的路径。

source: The main query
sv: Den huvudsakliga frågeställningen
zh_hans: 主查询

source: Aggregate cost of the third path.
sv: Sammanlagd kostnad för det tredje tågläget.
zh_hans: 第三条路径的总成本。

source: Route's aggregate cost of the route at the end of the third path.
sv: Ruttens sammanlagda kostnad för rutten vid slutet av den tredje vägen.
zh_hans: 第三条路径末端的路径总成本。

source: Nodes visited in the route.
sv: Noder som besökts i rutten.
zh_hans: 路由中访问的节点。

source: The aggregate costs of the route when the visited vertices are reached.
sv: De sammanlagda kostnaderna för rutten när de besökta topparna nås.
zh_hans: 到达所访问顶点时的路线总成本。

source: Status of "passes in front" or "visits" of the nodes.
sv: Status för "passeringar framför" eller "besök" av noderna.
zh_hans: 节点的 "前方通过 "或 "访问 "状态。

source: ``pgr_drivingDistance`` - Returns the driving distance from a start node.
sv: ``pgr_drivingDistance`` - Returnerar köravståndet från en startnod.
zh_hans: ``pgr_drivingDistance`` - 返回起始节点的行驶距离。

source: Added ``depth`` and ``start_vid`` result columns.
sv: Lagt till resultatkolumnerna ``depth`` och ``start_vid``.
zh_hans: 添加了 ``depth`` 和 ``start_vid`` 结果列。

source: Result column name change: ``from_v`` to ``start_vid``.
sv: Namnbyte på resultatkolumnen: ``from_v`` till ``start_vid``.
zh_hans: 结果列名称更改：``from_v``改为 ``start_vid``。

source: Added ``depth`` and ``pred`` result columns.
sv: Lagt till resultatkolumnerna ``depth`` och ``pred``.
zh_hans: 添加了 ``depth``和``pred``结果列。

source: Signature change:
sv: Ändring av signatur:

source: New official signature:
sv: Ny officiell signatur:

source: Using the Dijkstra algorithm, extracts all the nodes that have costs less than or equal to the value ``distance``. The edges extracted will conform to the corresponding spanning tree.
sv: Med hjälp av Dijkstra-algoritmen extraheras alla noder som har kostnader som är mindre än eller lika med värdet ``distance``. De kanter som extraheras kommer att överensstämma med motsvarande spännträd.

source: Single Vertex
sv: Enstaka toppunkt
zh_hans: 单顶点

source: From vertex :math:`11` for a distance of :math:`3.0`
sv: Från toppunkten :math:`11` för ett avstånd av :math:`3.0`
zh_hans: 从顶点:math:`11`到:math:`3.0`的距离

source: Multiple Vertices
sv: Flera vertikaler
zh_hans: 多顶点

source: From vertices :math:`\{11, 16\}` for a distance of :math:`3.0` with equi-cost on a directed graph
sv: Från topparna :math:`\{11, 16\}` för ett avstånd av :math:`3.0` med equi-cost på en riktad graf
zh_hans: 从顶点 :math:`{11, 16\}` 出发，距离为 :math:`3.0` 且有向图上的成本相等

source: Driving distance optional parameters
sv: Valfria parametrar för körsträcka
zh_hans: 行驶距离可选参数

source: ``equicost``
sv: ``ekvivalent kostnad``

source: When ``true`` the node will only appear in the closest ``start_vid`` list. Tie brakes are arbitrary.
sv: När ``true`` kommer noden endast att visas i den närmaste ``start_vid``-listan. Bindningsbromsar är godtyckliga.
zh_hans: ``true``时，节点只会出现在最近的 ``start_vid``列表中。绑定制动是任意的。

source: When ``false`` which resembles several calls using the single vertex signature.
sv: När ``false`` vilket liknar flera anrop som använder signaturen med en enda vertex.
zh_hans: ``false``时，类似于使用单顶点签名的多次调用。

source: end-before
sv: slut-innan

source: From vertices :math:`\{11, 16\}` for a distance of :math:`3.0` on an undirected graph
sv: Från hörnen :math:`\{11, 16\}` för ett avstånd av :math:`3.0` på en odelad graf
zh_hans: 在无向图上，从顶点:math:`{11, 16\}` 开始的距离为:math:`3.0`

source: ``pgr_edgeColoring`` - Experimental
sv: ``pgr_edgeColoring`` - Experimentell

source: ``pgr_edgeColoring`` — Returns the edge coloring of undirected and loop-free graphs
sv: ``pgr_edgeColoring`` - Returnerar kantfärgning av oledade och loopfria grafer
zh_hans: ``pgr_edgeColoring`` - 返回无向图和无环图的边着色

source: Edge Coloring is an algorithm used for coloring of the edges for the vertices in the graph. It is an assignment of colors to the edges of the graph so that no two adjacent edges have the same color.
sv: Edge Coloring är en algoritm som används för att färglägga kanterna för topparna i grafen. Det är en tilldelning av färger till kanterna i grafen så att inga två intilliggande kanter har samma färg.
zh_hans: 边着色是一种用于为图形中顶点的边着色的算法。它为图中的边分配颜色，使相邻的两条边没有相同的颜色。

source: The implementation is for **undirected** and **loop-free** graphs
sv: Implementeringen är för **undirected** och **loop-free** grafer
zh_hans: 针对**无向**和**无环**图实施

source: loop free
sv: slinga fri
zh_hans: 无环

source: no self-loops and no parallel edges.
sv: inga självslingor och inga parallella kanter.
zh_hans: 无自循环，无平行边。

source: Provides the color to be assigned to all the edges present in the graph.
sv: Ger den färg som ska tilldelas alla kanter som finns i grafen.
zh_hans: 指定要分配给图中所有边的颜色。

source: At most :math:`\Delta + 1` colors are used, where :math:`\Delta` is the degree of the graph.
sv: Högst :math:`\Delta + 1` färger används, där :math:`\Delta` är grafens grad.
zh_hans: 最多使用 :math:`\Delta + 1` 种颜色，其中 :math:`\Delta` 是图的度数。

source: This is optimal for some graphs, and by Vizing's theorem it uses at most one color more than the optimal for all others.
sv: Detta är optimalt för vissa grafer och enligt Vizings teorem används högst en färg mer än vad som är optimalt för alla andra.
zh_hans: 这对于某些图是最优的，根据Vizing定理，对于所有其他图，它使用的颜色最多比最优解多一种。

source: the chromatic number :math:`x'(G)` (minimum number of colors needed for proper edge coloring of graph) is equal to the degree :math:`\Delta + 1` of the graph, (:math:`x'(G) = \Delta`)
sv: det kromatiska talet :math:`x'(G)` (minsta antal färger som behövs för korrekt kantfärgning av grafen) är lika med graden :math:`\Delta + 1` av grafen, (:math:`x'(G) = \Delta`)
zh_hans: 色数（chromatic number）:math:`x'(G)`（用于图的适当边着色所需的最小颜色数）等于图的度:math:`\Delta + 1`（:math:`x'(G) = \Delta`）

source: The algorithm tries to assign the least possible color to every edge.
sv: Algoritmen försöker tilldela varje kant minsta möjliga färg.
zh_hans: 该算法尝试为每条边分配尽可能少的颜色。

source: Does not always produce optimal coloring.
sv: Ger inte alltid optimal färgsättning.
zh_hans: 并不总是产生最佳的着色。

source: The returned rows are ordered in ascending order of the edge identifier.
sv: De returnerade raderna är ordnade i stigande ordning efter kantidentifieraren.
zh_hans: 返回的行按边标识符的升序排列。

source: Efficient graph coloring is an NP-Hard problem, and therefore:
sv: Effektiv färgläggning av grafer är ett NP-hårt problem och därför:
zh_hans: 高效图形着色是一个 NP-Hard问题，因此：

source: In this implelentation the running time: :math:`O(|E|*|V|)`
sv: I den här implementeringen är körtiden: :math:`O(|E|*|V|)`
zh_hans: 在此实现中，运行时间为： :math:`O(|E|*|V||)`

source: where :math:`|E|` is the number of edges in the graph,
sv: där :math:`|E|` är antalet kanter i grafen,
zh_hans: 其中 :math:`|E|` 是图中的边数、

source: Graph coloring of pgRouting :doc:`sampledata`
sv: Grafisk färgläggning av pgRouting :doc:`sampledata`
zh_hans: pgRouting :doc:`示例数据`的图着色

source: `Boost: Edge Coloring <https://www.boost.org/libs/graph/doc/edge_coloring.html>`__
sv: `Boost: Färgläggning av kanter <https://www.boost.org/libs/graph/doc/edge_coloring.html>`__

source: `Wikipedia: Graph coloring <https://en.wikipedia.org/wiki/Graph_coloring>`__
sv: `Wikipedia: Färgläggning av grafer <https://en.wikipedia.org/wiki/Graph_coloring>`__
zh_hans: `维基百科：图着色<https://en.wikipedia.org/wiki/Graph_coloring>`__

source: ``pgr_edgeDisjointPaths`` — Calculates edge disjoint paths between two groups of vertices.
sv: ``pgr_edgeDisjointPaths`` - Beräknar kantdisjunkta vägar mellan två grupper av toppar.
zh_hans: ``pgr_edgeDisjointPaths`` - 计算两组顶点之间的边不相交路径。

source: Calculates the edge disjoint paths between two groups of vertices. Utilizes underlying maximum flow algorithms to calculate the paths.
sv: Beräknar de kantdisjunkta vägarna mellan två grupper av hörnpunkter. Använder underliggande algoritmer för maximalt flöde för att beräkna vägarna.
zh_hans: 计算两组顶点之间的边不相交路径。 利用底层最大流量算法来计算路径。

source: The main characterics are:
sv: De viktigaste egenskaperna är:
zh_hans: 主要特点是：

source: Calculates the edge disjoint paths between any two groups of vertices.
sv: Beräknar de kantskiljande vägarna mellan två valfria grupper av hörnpunkter.
zh_hans: 计算任意两组顶点之间的边相交路径。

source: Returns EMPTY SET when source and destination are the same, or cannot be reached.
sv: Returnerar EMPTY SET när källan och destinationen är desamma eller inte kan nås.
zh_hans: 当源和目标相同或无法到达时，返回 EMPTY SET。

source: The graph can be directed or undirected.
sv: Grafen kan vara riktad eller oriktad.
zh_hans: 图可以是有向或无向的。

source: Uses :doc:`pgr_boykovKolmogorov` to calculate the paths.
sv: Använder :doc:`pgr_boykovKolmogorov` för att beräkna banorna.
zh_hans: 使用 :doc:`pgr_boykovKolmogorov` 计算路径。

source: Using a combinations table, equivalent to calculating result from vertices :math:`\{5, 6\}` to vertices :math:`\{10, 15, 14\}` on an undirected graph.
sv: Att använda en kombinationstabell motsvarar att beräkna resultatet från topparna :math:`\{5, 6\}` till topparna :math:`\{10, 15, 14\}` i en ostyrd graf.
zh_hans: 使用组合表，相当于计算无向图上从顶点 :math:`\{5, 6\}`到顶点 :math:`\{10, 15, 14\}`的结果。

source: Manually assigned vertex combinations on an undirected graph.
sv: Manuellt tilldelade toppunktskombinationer på en odelad graf.
zh_hans: 在无向图上手动分配顶点组合。

source: ``pgr_edmondsKarp`` — Calculates the flow on the graph edges that maximizes the flow from the sources to the targets using Edmonds Karp Algorithm.
sv: ``pgr_edmondsKarp`` - Beräknar flödet på grafens kanter som maximerar flödet från källorna till målen med hjälp av Edmonds Karps algoritm.
zh_hans: ``pgr_edmondsKarp`` —使用 Edmonds Karp 算法计算图边上的流量，以最大化从源到目标的流量。

source: Renamed from ``pgr_maxFlowEdmondsKarp``
sv: Borttagen från ``pgr_maxFlowEdmondsKarp``
zh_hans: 由 ``pgr_maxFlowEdmondsKarp`` 重命名

source: Running time: :math:`O( V * E ^ 2)`
sv: Speltid: :math:`O( V * E ^ 2)`
zh_hans: 运行时间：:math:`O( V * E ^ 2)`

source: `Boost: Edmonds Karp max flow <https://www.boost.org/libs/graph/doc/edmonds_karp_max_flow.html>`__
sv: `Boost: Edmonds Karp maxflöde <https://www.boost.org/libs/graph/doc/edmonds_karp_max_flow.html>`__

source: https://en.wikipedia.org/wiki/Edmonds%E2%80%93Karp_algorithm
sv: https://en.wikipedia.org/wiki/Edmonds%E2%80%93Karp_algoritm

source: ``pgr_edwardMoore`` - Experimental
sv: ``pgr_edwardMoore`` - Experimentell

source: ``pgr_edwardMoore`` — Returns the shortest path using Edward-Moore algorithm.
sv: ``pgr_edwardMoore`` - Returnerar den kortaste vägen med Edward-Moore-algoritmen.
zh_hans: `pgr_edwardMoore`` - 使用 Edward-Moore 算法返回最短路径。

source: Edward Moore’s Algorithm is an improvement of the Bellman-Ford Algorithm. It can compute the shortest paths from a single source vertex to all other vertices in a weighted directed graph. The main difference between Edward Moore's Algorithm and Bellman Ford's Algorithm lies in the run time.
sv: Edward Moores algoritm är en förbättring av Bellman-Ford-algoritmen. Den kan beräkna de kortaste vägarna från ett enda källvertex till alla andra vertex i en viktad riktad graf. Den största skillnaden mellan Edward Moores algoritm och Bellman Fords algoritm ligger i körtiden.
zh_hans: Edward Moore算法是Bellman-Ford算法的改进。 它可以计算加权有向图中从单个源顶点到所有其他顶点的最短路径。 Edward Moore算法和Bellman-Ford算法之间的主要区别在于运行时间。

source: The worst-case running time of the algorithm is :math:`O(| V | * | E |)` similar to the time complexity of Bellman-Ford algorithm. However, experiments suggest that this algorithm has an average running time complexity of :math:`O( | E | )` for random graphs. This is significantly faster in terms of computation speed.
sv: I värsta fall är algoritmens körtid :math:`O(| V | * | E |)`, vilket liknar tidskomplexiteten för Bellman-Ford-algoritmen. Experiment tyder dock på att denna algoritm har en genomsnittlig komplexitet på :math:`O( | E | )` för slumpmässiga grafer. Detta är betydligt snabbare när det gäller beräkningshastighet.
zh_hans: 该算法的最坏运行时间为:math:`O(| V | * | E |)` ，类似于Bellman-Ford算法的时间复杂度。然而，实验表明，对于随机图，该算法的平均运行时间复杂度为 :math:`O( | E | )`。这在计算速度上明显更快。

source: Thus, the algorithm is at-best, significantly faster than Bellman-Ford algorithm and is at-worst,as good as Bellman-Ford algorithm
sv: Algoritmen är alltså i bästa fall betydligt snabbare än Bellman-Ford-algoritmen och i sämsta fall lika bra som Bellman-Ford-algoritmen
zh_hans: 因此，该算法在最好的情况下，明显快于 Bellman-Ford 算法，在最差的情况下，与 Bellman-Ford 算法一样好

source: The `agg_cost` the non included values `(v, v)` is :math:`0`
sv: `agg_cost` de icke inkluderade värdena `(v, v)` är :math:`0`
zh_hans: 未包含值 `(v, v)` 的 `agg_cost` 为 :math:`0`

source: For optimization purposes, any duplicated value in the `start vids` or `end vids` are ignored.
sv: För optimeringsändamål ignoreras alla duplicerade värden i `start vids` eller `end vids`.
zh_hans: 出于优化目的， `start vids` 或`end vids`中的任何重复值都将被忽略。

source: Running time:
sv: Löptid:
zh_hans: 运行时间：

source: Worst case: :math:`O(| V | * | E |)`
sv: Sämsta fall: :math:`O(| V | * | E |)`
zh_hans: 最坏的情况：:math:`O(| V | * | E |)`

source: Average case: :math:`O( | E | )`
sv: Genomsnittligt fall: :math:`O( | E | )`
zh_hans: 平均情况：:math:`O( | E | )`

source: Using a combinations table on an **undirected** graph.
sv: Använda en kombinationstabell i en **icke-riktad** graf.
zh_hans: 在**无向**图上使用组合表。

source: ``pgr_extractVertices`` — Extracts the vertices information
sv: ``pgr_extractVertices`` - Extraherar information om hörnpunkter
zh_hans: ``pgr_extractVertices`` — 提取顶点信息

source: This is an auxiliary function for extracting the vertex information of the set of edges of a graph.
sv: Detta är en hjälpfunktion för att extrahera toppunktsinformationen för en grafs uppsättning kanter.
zh_hans: 这是一个用于提取图的边集的顶点信息的辅助函数。

source: When the edge identifier is given, then it will also calculate the in and out edges
sv: När kantidentifieraren anges kommer den också att beräkna in- och utkanterna
zh_hans: 当给出边标识符时，它也会计算出入边

source: RETURNS SETOF |result-extract|
sv: RETURNS SETOF |resultat-extrahera|

source: When line geometry is known
sv: När linjegeometrin är känd
zh_hans: 当线的几何形状已知时

source: (Optional) identifier of the edge.
sv: (Valfritt) identifierare för kanten.
zh_hans: （可选）边的标识符。

source: Geometry of the edge.
sv: Geometri för kanten.
zh_hans: 边的几何形状。

source: This inner query takes precedence over the next two inner query, therefore other columns are ignored when ``geom`` column appears.
sv: Denna inre fråga har företräde framför de två följande inre frågorna, och därför ignoreras andra kolumner när kolumnen ``geom`` visas.
zh_hans: 该内部查询优先于接下来的两个内部查询，因此当``geom`` 列出现时，其他列将被忽略。

source: Ignored columns:
sv: Ignorerade kolumner:
zh_hans: 忽略的列：

source: ``startpoint``
sv: ``startpunkt``

source: ``endpoint``
sv: ``slutpunkt``

source: When vertex geometry is known
sv: När toppunktsgeometrin är känd
zh_hans: 当顶点几何形状已知时

source: To use this inner query the column ``geom`` should not be part of the set of columns.
sv: För att använda den här inre frågan får kolumnen ``geom`` inte ingå i kolumnuppsättningen.
zh_hans: 要使用此内部查询，列 ``geom`` 不应成为列集的一部分。

source: POINT geometry of the starting vertex.
sv: POINT Geometri för startvertexen.
zh_hans: POINT 起始顶点的几何图形。

source: POINT geometry of the ending vertex.
sv: POINT Geometri för den avslutande vertexen.
zh_hans: POINT结束顶点的几何图形。

source: This inner query takes precedence over the next inner query, therefore other columns are ignored when ``startpoint`` and ``endpoint`` columns appears.
sv: Denna inre fråga har företräde framför nästa inre fråga, och därför ignoreras andra kolumner när kolumnerna ``startpunkt`` och ``slutpunkt`` visas.
zh_hans: 此内部查询优先于下一个内部查询，因此当出现``startpoint`` 和 ``endpoint``列时，其他列将被忽略。

source: When identifiers of vertices are known
sv: När identifierare av toppar är kända
zh_hans: 当顶点的标识符已知时

source: To use this inner query the columns ``geom``, ``startpoint`` and ``endpoint`` should not be part of the set of columns.
sv: För att kunna använda den här inre frågan får kolumnerna ``geom``, ``startpoint`` och ``endpoint`` inte ingå i kolumnuppsättningen.
zh_hans: 要使用此内部查询，列 ``geom``、``startpoint``和``endpoint``不应成为列集的一部分。

source: ``NULL`` When the ``id`` is not part of the inner query
sv: ``NULL`` När ``id`` inte är en del av den inre frågan
zh_hans: ``NULL`` 当 ``id``不是内部查询的一部分时

source: X value of the point geometry
sv: X-värde för punktgeometrin
zh_hans: 点几何的X值

source: ``NULL`` When no geometry is provided
sv: ``NULL`` När ingen geometri anges
zh_hans: ``NULL``当没有提供几何图形时

source: Geometry of the point
sv: Geometri för punkten
zh_hans: 点几何

source: To get the query generated used to get the vertex information, use ``dryrun := true``.
sv: Använd ``dryrun := true`` för att få den fråga som genereras för att få fram toppunktsinformationen.
zh_hans: 要获取用于生成顶点信息的查询，请使用 ``dryrun := true``。

source: Create a routing topology
sv: Skapa en routningstopologi
zh_hans: 创建路由拓扑

source: Make sure the database does not have the ``vertices_table``
sv: Kontrollera att databasen inte har ``vertices_table``
zh_hans: 确保数据库没有 ``vertices_table``

source: Clean up the columns of the routing topology to be created
sv: Rensa upp kolumnerna i den routningstopologi som ska skapas
zh_hans: 清理要创建的路由拓扑的列

source: When the ``LINESTRING`` has a SRID then use ``geom::geometry(POINT, <SRID>)``
sv: När ``LINESTRING`` har en SRID används ``geom::geometry(POINT, <SRID>)``
zh_hans: 当 ``LINESTRING``具有 SRID 时，请使用 ``geom::geometry(POINT, <SRID>)``

source: For big edge tables that are been prepared,
sv: För bord med stor kant som är förberedda,
zh_hans: 对于已经准备好的大型边表，

source: Create it as ``UNLOGGED`` and
sv: Skapa den som ``UNLOGGED`` och
zh_hans: 创建它为 ``UNLOGGED`` 并

source: After the table is created ``ALTER TABLE .. SET LOGGED``
sv: Efter att tabellen har skapats ``ALTER TABLE .. SET LOGGED``
zh_hans: 创建表后，执行 ``ALTER TABLE .. SET LOGGED`` 操作

source: Inspect the vertices table
sv: Inspektera tabellen med hörnpunkter
zh_hans: 检查顶点表

source: Create the routing topology on the edge table
sv: Skapa routningstopologin på edge-tabellen
zh_hans: 在边表上创建路由拓扑

source: Updating the ``source`` information
sv: Uppdatering av informationen om ``källan``
zh_hans: 更新``source``信息

source: Updating the ``target`` information
sv: Uppdatering av informationen om "målet
zh_hans: 更新``target``信息

source: Inspect the routing topology
sv: Inspektera routingtopologin
zh_hans: 检查路由拓扑

source: **Generated topology**
sv: **Genererad topologi**
zh_hans: **生成的拓扑结构**

source: ``pgr_findCloseEdges`` - Finds the close edges to a point geometry.
sv: ``pgr_findCloseEdges`` - Hittar de närmaste kanterna till en punktgeometri.

source: ``partial`` option is removed.
sv: ``partial`` alternativet är borttaget.

source: ``pgr_findCloseEdges`` - An utility function that finds the closest edge to a point geometry.
sv: ``pgr_findCloseEdges`` - En verktygsfunktion som hittar den närmaste kanten till en punktgeometri.

source: The geometries must be in the same coordinate system (have the same SRID).
sv: Geometrierna måste ligga i samma koordinatsystem (ha samma SRID).

source: The code to do the calculations can be obtained for further specific adjustments needed by the application.
sv: Koden för att göra beräkningarna kan erhållas för ytterligare specifika justeringar som krävs av applikationen.

source: ``EMPTY SET`` is returned on dryrun executions
sv: ``EMPTY SET`` returneras vid dryrun-körningar

source: Returns set of |result-find|
sv: Returnerar uppsättning av |result-find|

source: One point
sv: En punkt

source: Get two close edges to points of interest with :math:`pid = 5`
sv: Få två nära kanter till intressanta platser med :math:`pid = 5`

source: Many points
sv: Många punkt

source: For each points of interests, find the closest edge.
sv: För varje intressepunkt, hitta den närmaste kanten.
