Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: When ``type`` = **'e'**.
sv: När ``typ`` = **'e'**.
zh_hans: 当 ``type`` = **'e'**时。

source: Decreasing sequence starting from **-1**.
sv: Minskande sekvens med början från **-1**.
zh_hans: 从**-1**开始递减序列。

source: Representing a pseudo `id` as is not incorporated in the set of original edges.
sv: Representerar ett pseudo-id som inte ingår i uppsättningen av ursprungliga kanter.
zh_hans: 将一个伪 `id` 表示为不包括在原始边集中。

source: ``contracted_vertices``
sv: "kontrakterade vertikaler

source: Array of contracted vertex identifiers.
sv: Array med identifierare för kontrakterade vertex.
zh_hans: 收缩的顶点标识符数组。

source: When ``type`` = **'v'**: :math:`-1`
sv: När ``typ`` = **'v'**: :math:`-1`
zh_hans: 当 ``type`` = **'v'**: :math:`-1`时

source: When ``type`` = **'e'**: Identifier of the source vertex of the current edge (``source``, ``target``).
sv: När ``typ`` = **'e'**: Identifierare av källvertexen för den aktuella kanten (``källa``, ``mål``).
zh_hans: 当 ``type`` = **'e'**时：当前边（``source``，``target``）的source顶点标识符。

source: When ``type`` = **'e'**: Identifier of the target vertex of the current edge (``source``, ``target``).
sv: När ``typ`` = **'e'**: Identifierare av målvertexen för den aktuella kanten (``källa``, ``mål``).
zh_hans: 当 ``type`` = **'e'** 时：当前边(``source``, ``target``)的target 顶点标识符。

source: When ``type`` = **'e'**: Weight of the current edge (``source``, ``target``).
sv: När ``typ`` = **'e'**: Vikt för den aktuella kanten (``källa``, ``mål``).
zh_hans: 当 ``type`` = **'e'** 时：当前边(``source``, ``target``)的权重。

source: Only dead end contraction
sv: Endast återvändsgränd kontraktion
zh_hans: 仅死端收缩

source: Only linear contraction
sv: Endast linjär sammandragning
zh_hans: 仅线性收缩

source: The cycle
sv: Cykeln
zh_hans: 循环

source: Contracting a graph can be done with more than one operation. The order of the operations affect the resulting contracted graph, after applying one operation, the set of vertices that can be contracted by another operation changes.
sv: Kontrahering av en graf kan göras med mer än en operation. Ordningen på operationerna påverkar den resulterande kontraherade grafen, efter att ha tillämpat en operation ändras uppsättningen toppar som kan kontraheras med en annan operation.

source: This implementation cycles ``cycles`` times through the ``methods`` .
sv: Denna implementation cyklar ``cyklar`` gånger genom ``metoderna`` .

source: Contracting sample data
sv: Upphandling av provdata
zh_hans: 收缩示例数据

source: In this section, building and using a contracted graph will be shown by example.
sv: I det här avsnittet visas exempel på hur man bygger upp och använder en kontraherad graf.
zh_hans: 在本节中，将通过示例展示构建和使用收缩图。

source: The :doc:`sampledata` for an undirected graph is used
sv: :doc:`sampledata` för en enkelriktad graf används
zh_hans: 使用无向图的:doc:`sampledata`

source: a dead end operation first followed by a linear operation.
sv: först en operation i en återvändsgränd och därefter en linjär operation.
zh_hans: 首先是死端操作，然后是线性操作。

source: Construction of the graph in the database
sv: Konstruktion av grafen i databasen
zh_hans: 数据库中图的构建

source: The original graph:
sv: Den ursprungliga grafen:
zh_hans: 原始图

source: The results do not represent the contracted graph. They represent the changes that need to be done to the graph after applying the contraction methods.
sv: Resultaten representerar inte den sammandragna grafen. De representerar de ändringar som måste göras i grafen efter att man har tillämpat sammandragningsmetoderna.

source: Observe that vertices, for example, :math:`6` do not appear in the results because it was not affected by the contraction algorithm.
sv: Observera att toppar, till exempel :math:`6`, inte visas i resultaten eftersom de inte påverkades av sammandragningsalgoritmen.
zh_hans: 例如，观察到顶点:math:`6`没有出现在结果中，因为它不受收缩算法的影响。

source: After doing the dead end contraction operation:
sv: Efter att ha gjort den återvändsgränd sammandragning operation:
zh_hans: 进行死端收缩操作后：

source: After doing the linear contraction operation to the graph above:
sv: Efter att ha gjort den linjära sammandragningsoperationen på grafen ovan:
zh_hans: 对上图进行线性收缩运算后：

source: The process to create the contraction graph on the database:
sv: Processen för att skapa sammandragningsgrafen i databasen:
zh_hans: 在数据库上创建收缩图的过程：

source: Add additional columns
sv: Lägg till ytterligare kolumner
zh_hans: 添加附加列

source: Adding extra columns to the edges and vertices tables. In this documentation the following will be used:
sv: Lägga till extra kolumner i tabellerna edges och vertices. I denna dokumentation kommer följande att användas:

source: Column.
sv: Kolumn.

source: The vertices set belonging to the vertex/edge
sv: Uppsättningen av toppar som hör till toppen/kanten
zh_hans: 属于顶点/边的顶点集

source: ``is_contracted``
sv: ``är_kontrakterad``

source: On the vertex table
sv: På toppunktstabellen
zh_hans: 在顶点表上

source: when ``true`` the vertex is contracted, its not part of the contracted graph.
sv: när ``true`` vertexen är kontraherad, är den inte en del av den kontraherade grafen.
zh_hans: 当 ``true`` 时，顶点收缩，它不是收缩图的一部分。

source: when ``false`` the vertex is not contracted, its part of the contracted graph.
sv: när ``false`` är vertexen inte kontraherad, den är en del av den kontraherade grafen.
zh_hans: 当 ``false`` 时，顶点不收缩，它是收缩图的一部分。

source: ``is_new``
sv: ``är_ny``

source: On the edge table
sv: På kanten av bordet
zh_hans: 在边表上

source: when ``true`` the edge was generated by the contraction algorithm. its part of the contracted graph.
sv: när ``true`` kanten genererades av sammandragningsalgoritmen. dess del av den sammandragna grafen.
zh_hans: 当 ``true`` 时，边缘由收缩算法生成。 它是收缩图的一部分。

source: when ``false`` the edge is an original edge, might be or not part of the contracted graph.
sv: när ``false`` är kanten en originalkant, som kan vara eller inte vara en del av den kontraherade grafen.
zh_hans: 当 ``false`` 时，边是原始边，可能是也可能不是收缩图的一部分。

source: Store contraction information
sv: Lagra information om sammandragning
zh_hans: 存储收缩信息

source: Store the contraction results in a table.
sv: Spara sammandragningsresultaten i en tabell.

source: Update the edges and vertices tables
sv: Uppdatera tabellerna för kanter och toppar

source: Use ``is_contracted`` column to indicate the vertices that are contracted.
sv: Använd kolumnen ``is_contracted`` för att ange de toppar som är kontraherade.
zh_hans: 使用 ``is_contracted``列来指示收缩的顶点。

source: Fill ``contracted_vertices`` with the information from the results that belong to the vertices.
sv: Fyll i ``contracted_vertices`` med informationen från de resultat som hör till topparna.

source: Insert the new edges generated by pgr_contraction.
sv: Infoga de nya kanterna som genererats av pgr_contraction.
zh_hans: 插入由 pgr_contraction 生成的新边。

source: The contracted graph
sv: Den kontraherade grafen
zh_hans: 收缩图

source: Vertices that belong to the contracted graph.
sv: Punkter som hör till den kontraherade grafen.
zh_hans: 属于收缩图的顶点。

source: Edges that belong to the contracted graph.
sv: Kanter som hör till den kontraherade grafen.
zh_hans: 属于收缩图的边。

source: Visually:
sv: Visuellt:

source: Using the contracted graph
sv: Använda den kontraherade grafen
zh_hans: 使用收缩图

source: Depending on the final application the graph is to be prepared. In this example the final application will be to calculate the cost from two vertices in the original graph by using the contracted graph with ``pgr_dijkstraCost``
sv: Beroende på den slutliga tillämpningen ska grafen förberedas. I detta exempel kommer den slutliga tillämpningen att vara att beräkna kostnaden från två toppar i originalgrafen genom att använda den kontraherade grafen med ``pgr_dijkstraCost``

source: There are three cases when calculating the shortest path between a given source and target in a contracted graph:
sv: Det finns tre fall när man beräknar den kortaste vägen mellan en given källa och ett givet mål i en kontrakterad graf:
zh_hans: 计算收缩图中给定源和目标之间的最短路径时，存在三种情况：

source: Case 1: Both source and target belong to the contracted graph.
sv: Fall 1: Både källan och målet hör till den kontrakterade grafen.
zh_hans: 情况1：源和目标都属于收缩图。

source: Case 2: Source and/or target belong to an edge subgraph.
sv: Fall 2: Källa och/eller mål tillhör en edge-subgraf.
zh_hans: 情况 2：源和/或目标属于边缘子图。

source: Case 3: Source and/or target belong to a vertex.
sv: Fall 3: Källa och/eller mål hör till en vertex.
zh_hans: 情况 3：源和/或目标属于一个顶点。

source: The final application should consider all of those cases.
sv: Den slutliga applikationen bör ta hänsyn till alla dessa fall.

source: Create a view (or table) of the contracted graph:
sv: Skapa en vy (eller tabell) av den kontraherade grafen:

source: Create the function that will use the contracted graph.
sv: Skapa den funktion som ska använda den kontraherade grafen.

source: Case 2: Source and/or target belong to an edge that has contracted vertices.
sv: Fall 2: Källa och/eller mål hör till en kant som har kontraherade toppar.

source: Case 3: Source and/or target belong to a vertex that has been contracted.
sv: Fall 3: Källa och/eller mål hör till en vertex som har kontrakterats.

source: ``pgr_contractionDeadEnd`` - Proposed
sv: ``pgr_contractionDeadEnd`` - Förslag

source: ``pgr_contractionDeadEnd`` — Performs graph contraction and returns the contracted vertices and edges.
sv: ``pgr_contractionDeadEnd`` - Utför grafkontraktion och returnerar de kontraherade topparna och kanterna.

source: A node is considered a dead end node when:
sv: En nod anses vara en återvändsgrändsnod när:

source: On undirected graphs:
sv: Om odelade grafer:
zh_hans: 在无向图上：

source: The number of adjacent vertices is 1.
sv: Antalet angränsande hörn är 1.
zh_hans: 相邻顶点的个数为1。

source: On directed graphs:
sv: Om riktade grafer:
zh_hans: 在有向图上：

source: When there is only one adjacent vertex or
sv: När det bara finns en angränsande toppunkt eller

source: When all edges are incoming regardless of the number of adjacent vertices.
sv: När alla kanter är inkommande oavsett antalet angränsande toppar.

source: Dead end contraction on an undirected graph.
sv: Sammandragning av återvändsgränder i en odelad graf.

source: The green nodes are dead end nodes.
sv: De gröna noderna är återvändsgrändsnoder.

source: Node :math:`3` is a dead end node after node :math:`1` is contracted.
sv: Noden :math:`3` är en återvändsgränd efter att noden :math:`1` har dragits in.

source: **Empty**
sv: **Tomt**

source: Value = ``e`` indicating the row is an edge.
sv: Värde = ``e`` som anger att raden är en kant.

source: A pseudo `id` of the edge.
sv: Ett pseudo "id" för kanten.

source: Identifier of the source vertex of the current edge.
sv: Identifierar källvertexen för den aktuella kanten.
zh_hans: 当前边的源顶点的标识符。

source: Identifier of the target vertex of the current edge.
sv: Identifierare av målvertexen för den aktuella kanten.
zh_hans: 当前边的目标顶点的标识符。

source: Weight of the current edge.
sv: Vikt för den aktuella kanten.

source: Dead end vertex on undirected graph
sv: Dead end-knutpunkt på odelad graf
zh_hans: 无向图上的死端顶点

source: They have only one adjacent node.
sv: De har bara en angränsande nod.

source: Dead end vertex on directed graph
sv: Dead end-knutpunkt på riktad graf
zh_hans: 有向图上的死端顶点

source: The green nodes are dead end nodes
sv: De gröna noderna är återvändsgrändsnoder

source: The blue nodes have an unlimited number of incoming and/or outgoing edges.
sv: De blå noderna har ett obegränsat antal inkommande och/eller utgående kanter.
zh_hans: 蓝色节点具有无限数量的传入和/或传出边缘。

source: Node
sv: Nod
zh_hans: 节点

source: Adjacent nodes
sv: Angränsande noder

source: Dead end
sv: Död återvändsgränd
zh_hans: 死端

source: Reason
sv: Orsak

source: Yes
sv: Ja

source: Has only one adjacent node.
sv: Har endast en angränsande nod.

source: Has more than one adjacent node and all edges are incoming.
sv: Har mer än en angränsande nod och alla kanter är inkommande.

source: No
sv: Nej

source: Has more than one adjacent node and all edges are outgoing.
sv: Har mer än en angränsande nod och alla kanter är utgående.

source: Many adjacent nodes.
sv: Många angränsande noder.

source: Has more than one adjacent node and some edges are incoming and some are outgoing.
sv: Har mer än en angränsande nod och vissa kanter är inkommande och vissa är utgående.

source: From above, nodes :math:`\{6, 7, 9\}` are dead ends because the total number of adjacent vertices is one.
sv: Ovan är noderna :math:`\{6, 7, 9\}` återvändsgränder eftersom det totala antalet angränsande hörn är ett.

source: When there are more than one adjacent vertex, all edges need to be all incoming edges otherwise it is not a dead end.
sv: När det finns mer än ett angränsande toppunkt måste alla kanter vara alla inkommande kanter, annars är det inte en återvändsgränd.

source: Step by step dead end contraction
sv: Steg för steg återvändsgränd sammandragning

source: The dead end contraction will stop until there are no more dead end nodes. For example, from the following graph where :math:`3` is the dead end node:
sv: Sammandragningen av återvändsgränder kommer att upphöra tills det inte finns några fler återvändsgrändsnoder. Till exempel, från följande graf där :math:`3` är återvändsgränden:

source: After contracting :math:`3`, node :math:`2` is now a dead end node and is contracted:
sv: Efter kontrakteringen av :math:`3` är noden :math:`2` nu en återvändsgränd och kontrakteras:

source: After contracting :math:`2`, stop. Node :math:`1` has the information of nodes that were contracted.
sv: Efter att ha dragit in :math:`2`, sluta. Noden :math:`1` har information om de noder som kontrakterades.

source: Creating the contracted graph
sv: Skapa den kontraherade grafen

source: Steps for the creation of the contracted graph
sv: Steg för att skapa den avtalade grafen

source: Add additional columns.
sv: Lägg till ytterligare kolumner.

source: Save results into a table.
sv: Spara resultaten i en tabell.

source: The contracted vertices are not part of the contracted graph.
sv: De kontraherade topparna är inte en del av den kontraherade grafen.

source: Using when departure and destination are in the contracted graph
sv: Används när avgång och destination ligger i den kontrakterade grafen

source: Using when departure/destination is not in the contracted graph
sv: Används när avgång/destination inte finns i den avtalade grafen

source: Using when departure and destination are not in the contracted graph
sv: Används när avgång och destination inte finns i den avtalade grafen

source: ``pgr_contractionHierarchies`` - Experimental
sv: ``pgr_contractionHierarchies`` - Experimentell

source: ``pgr_contractionHierarchies`` — Performs graph contraction according to the contraction hierarchies method and returns the contracted vertices and shortcut edges created.
sv: ``pgr_contractionHierarchies`` - Utför grafkontraktion enligt metoden contraction hierarchies och returnerar de kontraherade topparna och de skapade genvägskanterna.

source: New **experimental** function
sv: Ny **experimentell** funktion
zh_hans: 新**实验**函数

source: The contraction hierarchies method builds, from an initial order of the vertices, a hierarchical order, giving priority to some vertices during the processing of label fixing of shortest paths algorithms. Furthermore, the contraction hierarchies algorithm adds shortcut edges in the graph, that helps the shortest paths algorithm to follow the created hierarchical graph structure.
sv: Contraction Hierarchies-metoden bygger, från en initial ordning av topparna, en hierarkisk ordning som prioriterar vissa toppar under bearbetningen av kortaste vägar-algoritmernas etikettfixering. Dessutom lägger algoritmen för sammandragningshierarkier till genvägskanter i grafen, vilket hjälper algoritmen för kortaste vägar att följa den skapade hierarkiska grafstrukturen.

source: The idea of the hierarchy is to put at a high priority level vertices that belong to the long distance network (highways for example in a road network) and to a low level of priority nodes that belong to the short distance network (arterials or secondary roads for example in road networks).
sv: Tanken med hierarkin är att ge hög prioritet åt toppar som tillhör det långväga nätet (t.ex. motorvägar i ett vägnät) och låg prioritet åt noder som tillhör det kortväga nätet (t.ex. artärer eller sekundära vägar i ett vägnät).

source: The contraction hierarchies algorithm makes the assumption that there is already a valuable vertices order that is used to initialize the contraction process. As in most cases there is no valuable initial node ordering, we use the order given by vertices ID. Then, the contraction process is made on the basis of this first order to give the final hierarchy.
sv: Algoritmen för sammandragningshierarkier förutsätter att det redan finns en värdefull nodordning som används för att initiera sammandragningsprocessen. Eftersom det i de flesta fall inte finns någon värdefull initial nodordning använder vi den ordning som ges av vertices ID. Sedan görs sammandragningsprocessen på grundval av denna första ordning för att ge den slutliga hierarkin.

source: The basic idea is to keep the vertices in a priority queue sorted by some estimate of how attractive is their contraction. The implemented case uses the metric called *edge difference*, which corresponds to the difference between the number of shortcuts produced by a vertex contraction and the number of incident edges in the graph before contraction (``#shortcuts - #incident edges``).
sv: Grundidén är att hålla topparna i en prioritetskö sorterade efter någon uppskattning av hur attraktiv deras sammandragning är. I det implementerade fallet används ett mått som kallas *edge difference*, vilket motsvarar skillnaden mellan antalet genvägar som produceras av en vertexkontraktion och antalet infallande kanter i grafen före kontraktionen (``#shortcuts - #incident edges``).

source: Finally, the aim is to reduce the explored part of the graph, when using a bidirectional Dijkstra-like algorithm. The vertices order is used to feed the oriented search. The search is made without losing optimality.
sv: Slutligen är målet att minska den utforskade delen av grafen när man använder en dubbelriktad Dijkstra-liknande algoritm. Topparnas ordning används för att mata den orienterade sökningen. Sökningen görs utan att förlora optimalitet.

source: Finding an optimal vertices ordering for contraction is a difficult problem. Nevertheless, very simple local heuristics work quite well, according to Geisberger et al. [2]. The principle here is to a priori estimate the value of the *edge difference* and to contract the node at the top of the queue only if the new value of the metric keeps it at the top of the queue. Otherwise, it is reinserted in the queue, at its right place corresponding to the new metric value.
sv: Det är ett svårt problem att hitta en optimal ordning på topparna för sammandragning. Ändå fungerar mycket enkla lokala heuristiker ganska bra, enligt Geisberger et al [2]. Principen här är att på förhand uppskatta värdet på *kantskillnaden* och att dra ihop noden högst upp i kön endast om det nya värdet på metriken håller den kvar högst upp i kön. I annat fall återinsätts den i kön på sin rätta plats som motsvarar det nya metriska värdet.

source: The process is done on graphs having only edges with positive costs.
sv: Processen görs på grafer som bara har kanter med positiva kostnader.

source: It is necessary to remember that there are no deleted vertices with this function. At the end, the graph keeps every vertex it had, but has some added edges, corresponding to shortcuts. The vertices which have been contracted, to build the shortcut edges, are kept and hierarchically ordered.
sv: Det är nödvändigt att komma ihåg att det inte finns några borttagna toppar med denna funktion. I slutet behåller grafen alla toppar den hade, men har några extra kanter som motsvarar genvägar. De toppar som har dragits ihop för att bygga upp genvägskanterna behålls och ordnas hierarkiskt.

source: As for the other contraction methods, it does not return the full contracted graph, only the changes. They are here of two types:
sv: När det gäller de andra kontraktionsmetoderna returneras inte hela den kontraherade grafen, utan endast förändringarna. De är här av två typer:

source: added shortcut edges, with negative identifiers;
sv: lagt till genvägskanter, med negativa identifierare;

source: contracted nodes with an order.
sv: kontrakterade noder med en order.

source: The ``pgr_contractionHierarchies`` function has the following signature:
sv: Funktionen ``pgr_contractionHierarchies`` har följande signatur:

source: Returns set of |result-contraction-hierarchies|
sv: Returnerar uppsättning av |resultat-kontraktion-hierarkier|

source: Contraction hierarchies optional parameters
sv: Sammandragningshierarkier valfria parametrar

source: True if the graph is directed, False otherwise.
sv: True om grafen är riktad, False annars.

source: The function returns many rows (one per vertex and one per shortcut edge created). The columns of the rows are:
sv: Funktionen returnerar många rader (en per toppunkt och en per skapad genvägskant). Kolumnerna i raderna är:

source: Type of the ``id``.
sv: Typ av ``id``.
zh_hans: ``id``的类型。

source: Column ``id`` has a positive value
sv: Kolumnen ``id`` har ett positivt värde
zh_hans: 列``id`` 具有正值

source: Column ``id`` has a negative value
sv: Kolumnen ``id`` har ett negativt värde
zh_hans: 列 ``id`` 具有负值

source: ``metric``
sv: ``metrisk``

source: On an undirected graph
sv: På en odelad graf

source: The following query shows the original data involved in the contraction operation on an undirected graph.
sv: Följande fråga visar de ursprungliga data som är involverade i sammandragningsoperationen på en oriktad graf.

source: building contraction hierarchies on the whole graph
sv: bygga sammandragningshierarkier på hela grafen

source: The results do not represent the contracted graph. They represent the changes done to the graph after applying the contraction algorithm and give the vertex order built by the algorithm, by ordering vertices according to the *edge difference* metric. As a consequence, vertices are all represented in the result (except of course forbidden ones). Only shortcut built by the algorithm are represented in the result.
sv: Resultaten representerar inte den sammandragna grafen. De representerar de ändringar som gjorts i grafen efter tillämpning av sammandragningsalgoritmen och ger den vertexordning som algoritmen bygger upp genom att ordna vertex enligt *edge difference*-metriken. Som en följd av detta finns alla toppar representerade i resultatet (utom naturligtvis förbjudna). Endast genvägar som byggts av algoritmen finns representerade i resultatet.

source: After computing the contraction hierarchies, an order is now given to the vertices,
sv: Efter att ha beräknat sammandragningshierarkierna ges nu en ordning till topparna,

source: in order to be used with a specific Dijkstra algorithm (implementation coming in a future version), which speeds up the search.
sv: för att kunna användas med en specifik Dijkstra-algoritm (implementering kommer i en framtida version), som snabbar upp sökningen.

source: We obtain the contracted graph above:
sv: Vi får den kontraherade grafen ovan:

source: We can see without surprise that the vertices belonging to the shortcuts have a tendency to have a high priority level in the resulting vertices order.
sv: Vi kan utan överraskning se att de toppar som tillhör genvägarna har en tendens att ha en hög prioritetsnivå i den resulterande topparnas ordning.

source: On an undirected graph with forbidden vertices
sv: På en odelad graf med förbjudna toppar
