Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Case 2
zh_hans: 情况2

source: When source and/or target belong to an edge subgraph then a path is not found.
zh_hans: 当源和/或目标属于边缘子图时，则找不到路径。

source: In this case, the contracted graph do not have an edge connecting with node :math:`4`.
zh_hans: 在这种情况下，收缩图没有与节点:math:`4` 相连的边。

source: Case 3
zh_hans: 情况3

source: When source and/or target belong to a vertex then a path is not found.
zh_hans: 当源和/或目标属于顶点时，则找不到路径。

source: In this case, the contracted graph do not have an edge connecting with node :math:`7` and of node :math:`4` of the second case.
zh_hans: 在这种情况下，收缩图没有与第二种情况的节点:math:`7`和节点 :math:`4`连接的边。

source: Refining the above function to include nodes that belong to an edge.
zh_hans: 改进上述函数以包含属于边的节点。

source: The vertices that need to be expanded are calculated on lines 11 to 17.
zh_hans: 需要扩展的顶点在第 11 至 17 行计算。

source: Adding to the contracted graph that additional section on lines 26 to 28.
zh_hans: 将第 26 至 28 行的附加部分添加到收缩图中。

source: When source and/or target belong to an edge subgraph, now, a path is found.
zh_hans: 当源和目标都属于收缩图时，就找到了一条路径。

source: The routing graph now has an edge connecting with node :math:`4`.
zh_hans: 路由图现在有一条与节点:math:`4` 连接的边。

source: In this case, the contracted graph do not have an edge connecting with node :math:`7`.
zh_hans: 在这种情况下，收缩图没有与节点:math:`7`相连的边。

source: The vertices that need to be expanded are calculated on lines 19 to 24.
zh_hans: 需要扩展的顶点在第19到24行计算。

source: Adding to the contracted graph that additional section on lines 38 to 40.
zh_hans: 将第 38 至 40 行的附加部分添加到收缩图中。

source: The code change do not affect this case so when source and/or target belong to an edge subgraph, a path is still found.
zh_hans: 代码更改不会影响这种情况，因此当源和/或目标属于边缘子图时，仍然会找到路径。

source: When source and/or target belong to a vertex, now, a path is found.
zh_hans: 当源和/或目标属于一个顶点时，现在就找到了一条路径。

source: Now, the routing graph has an edge connecting with node :math:`7`.
zh_hans: 现在，路由图有一条与节点:math:`7`连接的边。

source: The **aggregate cost** of :math:`(u, v)` is the same as for :math:`(v, u)`.
zh_hans: :math:`(u, v)`的**总成本**与 :math:`(v, u)`的相同。

source: proposed
zh_hans: 建议的

source: :doc:`TSP-family` needs as input a symmetric cost matrix and no edge `(u, v)` must value :math:`\infty`.
zh_hans: :doc:`TSP-family`需要一个对称成本矩阵作为输入，并且没有边 `(u, v)`必须值为:math:`\infty` 。

source: Value in <0,1> that indicates the relative postition from the first end point of the edge.
zh_hans: <0,1> 中的值指示距边缘第一个端点的相对位置。

source: :doc:`pgr_dijkstra` - Dijkstra's algorithm for the shortest paths.
zh_hans: :doc:`pgr_dijkstra` - Dijkstra 最短路径算法。

source: :doc:`pgr_dijkstraCost` - Get the aggregate cost of the shortest paths.
zh_hans: :doc:`pgr_dijkstraCost` - 获取最短路径的总成本。

source: :doc:`pgr_dijkstraCostMatrix` - Use pgr_dijkstra to create a costs matrix.
zh_hans: :doc:`pgr_dijkstraCostMatrix` - 使用 pgr_dijkstra 创建成本矩阵。

source: :doc:`pgr_drivingDistance` - Use pgr_dijkstra to calculate catchament information.
zh_hans: :doc:`pgr_drivingDistance` - 使用 pgr_dijkstra 计算流域信息。

source: :doc:`pgr_KSP` - Use Yen algorithm with pgr_dijkstra to get the K shortest paths.
zh_hans: :doc:`pgr_KSP` - 使用 Yen 算法和 pgr_dijkstra 来获得 K 条最短路径。

source: :doc:`pgr_dijkstraVia` - Get a route of a seuence of vertices.
zh_hans: :doc:`pgr_dijkstraVia` - 获取一系列顶点的路径。

source: :doc:`pgr_dijkstraNear` - Get the route to the nearest vertex.
zh_hans: :doc:`pgr_dijkstraNear` - 获取到最近顶点的路线。

source: :doc:`pgr_dijkstraNearCost` - Get the cost to the nearest vertex.
zh_hans: :doc:`pgr_dijkstraNearCost` - 获取最近顶点的成本。

source: The weighted directed graph, :math:`G_d(V,E)`, is definied by:
zh_hans: 加权有向图， :math:`G_d(V,E)`的定义如下：

source: The weighted undirected graph, :math:`G_u(V,E)`, is definied by:
zh_hans: 加权无向图，:math:`G_u(V,E)`的定义如下：

source: In other words: The algorithm returns a the shortest path between :math:`start_{vid}` and :math:`end_{vid}`, if it exists, in terms of a sequence of nodes and of edges,
zh_hans: 换句话说：该算法返回 :math:`start_{vid}` 和:math:`end_{vid}` 之间的最短路径（如果存在），以节点和边的序列表示，

source: :math:`path\_seq` indicates the relative position in the path of the :math:`node` or :math:`edge`.
zh_hans: :math:`path\_seq`表示 :math:`node`或:math:`edge`的路径中的相对位置。

source: :math:`cost` is the cost of the edge to be used to go to the next node.
zh_hans: :math:`cost`是用于转到下一个节点的边的成本。

source: :math:`agg\_cost` is the cost from the :math:`start_{vid}` up to the node.
zh_hans: :math:`agg\_cost`是从 :math:`start_{vid}`到节点的成本。

source: :doc:`pgr_drivingDistance` - Driving Distance based on Dijkstra's algorithm
zh_hans: :doc:`pgr_drivingDistance` - 基于 Dijkstra 算法的行驶距离

source: :doc:`pgr_primDD` - Driving Distance based on Prim's algorithm
zh_hans: :doc:`pgr_primDD` - 基于Prim算法的行驶距离

source: :doc:`pgr_kruskalDD` - Driving Distance based on Kruskal's algorithm
zh_hans: :doc:`pgr_kruskalDD` - 基于Kruskal算法的行驶距离

source: Post pocessing
zh_hans: 后期处理

source: :doc:`pgr_alphaShape` - Alpha shape computation
zh_hans: :doc:`pgr_alphaShape` - Alpha 形状计算

source: :doc:`pgr_withPointsDD` - Driving Distance based on pgr_withPoints
zh_hans: :doc:`pgr_withPointsDD` - 基于 pgr_withPoints 的行驶距离

source: Returns SET OF |result-spantree|
zh_hans: 返回 |result-spantree| 的一组结果

source: Column ``pred`` only applies to :doc:`pgr_drivingDistance` and :doc:`pgr_withPointsDD`.
zh_hans: 列``pred``仅适用于 :doc:`pgr_drivingDistance` 和:doc:`pgr_withPointsDD`。

source: :doc:`pgr_maxFlowMinCost` - Details of flow and cost on edges.
zh_hans: :doc:`pgr_maxFlowMinCost` - 边缘上的流量和成本详细信息。

source: :doc:`pgr_maxFlowMinCost_Cost` - Only the Min Cost calculation.
zh_hans: :doc:`pgr_maxFlowMinCost_Cost` -仅最小成本计算。

source: :doc:`pgr_lineGraph` - Transformation algorithm for generating a Line Graph.
zh_hans: :doc:`pgr_lineGraph` - 用于生成折线图的转换算法。

source: :doc:`pgr_lineGraphFull` - Transformation algorithm for generating a Line Graph out of each vertex in the input graph.
zh_hans: :doc:`pgr_lineGraphFull` - 用于从输入图中的每个顶点生成线图的变换算法。

source: :doc:`pgr_breadthFirstSearch` - Breath first search traversal of the graph.
zh_hans: :doc:`pgr_breadthFirstSearch` - 图的广度优先搜索遍历。

source: :doc:`pgr_binaryBreadthFirstSearch` - Breath first search traversal of the graph.
zh_hans: :doc:`pgr_binaryBreadthFirstSearch` -图的广度优先搜索遍历。

source: :doc:`pgr_cuthillMckeeOrdering` - Return reverse Cuthill-McKee ordering of an undirected graph.
zh_hans: :doc:`pgr_cuthillMckeeOrdering` -返回无向图的反向 Cuthill-McKee 排序。

source: Not classified
zh_hans: 未分类

source: :doc:`pgr_maxFlow` - Only the Max flow calculation using Push and Relabel algorithm.
zh_hans: :doc:`pgr_maxFlow` - 仅使用 Push 和 Relabel 算法进行最大流量计算。

source: :doc:`pgr_boykovKolmogorov` - Boykov and Kolmogorov with details of flow on edges.
zh_hans: :doc:`pgr_boykovKolmogorov` - Boykov 和 Kolmogorov 的边流动细节。

source: :doc:`pgr_edmondsKarp` - Edmonds and Karp algorithm with details of flow on edges.
zh_hans: :doc:`pgr_edmondsKarp` - 带有边流量详细信息的 Edmonds 和 Karp 算法

source: :doc:`pgr_pushRelabel` - Push and relabel algorithm with details of flow on edges.
zh_hans: :doc:`pgr_pushRelabel` - 推送和重新标记算法以及边流量的详细信息

source: :doc:`pgr_edgeDisjointPaths` - Calculates edge disjoint paths between two groups of vertices.
zh_hans: :doc:`pgr_edgeDisjointPaths` - 计算两组顶点之间的边不相交路径。

source: :doc:`pgr_maxCardinalityMatch` - Calculates a maximum cardinality matching in a graph.
zh_hans: :doc:`pgr_maxCardinalityMatch` - 计算图中的最大基数匹配。

source: There is no flow when a **source** is the same as a **target**.
zh_hans: 当 **source**与 **target**相同时，就没有流量。

source: Any duplicated value in the source(s) or target(s) are ignored.
zh_hans: source(s)或target(s) 中的任何重复值都将被忽略。

source: Creates a **super source** and edges to all the source(s), and a **super target** and the edges from all the targets(s).
zh_hans: 创建**super source**和所有源的边，以及 **super target** 和所有目标的边。

source: :doc:`pgr_maxFlow` is the maximum Flow and that maximum is guaranteed to be the same on the functions :doc:`pgr_pushRelabel`, :doc:`pgr_edmondsKarp`, :doc:`pgr_boykovKolmogorov`, but the actual flow through each edge may vary.
zh_hans: :doc:`pgr_maxFlow` 是最大流量，并且该最大值保证在函数 :doc:`pgr_pushRelabel`, :doc:`pgr_edmondsKarp`, :doc:`pgr_boykovKolmogorov`, 上相同，但通过每条边的实际流量可能会有所不同。

source: Capacity of the edge (``source``, ``target``)
zh_hans: 边 (``source``, ``target``)的容量

source: Weight of the edge (``source``, ``target``) if it exist
zh_hans: 边 (``source``, ``target``)的权重（如果存在）

source: :math:`\boldsymbol{\Phi}` is a subset of the original edges with their residual capacity and flow. The maximum flow through the graph can be obtained by aggregating on the source or sink and summing the flow from/to it. In particular:
zh_hans: :math:`\boldsymbol{\Phi}`是原始边及其剩余容量和流量的子集。 通过图的最大流量可以通过在源或汇上聚合并对来自/到它的流量求和来获得。 尤其：

source: :math:`edge\_id = id_i` in edges_sql
zh_hans: :math:`edge\_id = id_i`在edges_sql中

source: :doc:`sampledata` that is used in the examples of this manual.
zh_hans: 本手册示例中使用的 :doc:`sampledata`

source: The following functions modify the database directly therefore the user must have special permissions given by the administrators to use them.
zh_hans: 以下函数直接修改数据库，因此用户必须具有管理员授予的特殊权限才能使用它们。

source: :doc:`pgr_createTopology` - create a topology based on the geometry.
zh_hans: :doc:`pgr_createTopology` - 根据几何形状创建拓扑。

source: :doc:`pgr_createVerticesTable` - reconstruct the vertices table based on the source and target information.
zh_hans: :doc:`pgr_createVerticesTable` - 根据源和目标信息重建顶点表。

source: :doc:`pgr_analyzeGraph` - to analyze the edges and vertices of the edge table.
zh_hans: :doc:`pgr_analyzeGraph` - 分析边表的边和顶点。

source: :doc:`pgr_analyzeOneWay` - to analyze directionality of the edges.
zh_hans: :doc:`pgr_analyzeOneWay` - 分析边的方向性。

source: :doc:`pgr_nodeNetwork` -to create nodes to a not noded edge table.
zh_hans: :doc:`pgr_nodeNetwork` -为无节点边表创建节点。

source: :doc:`pgr_trsp` - Turn Restriction Shortest Path (TRSP)
zh_hans: :doc:`pgr_trsp` - 转弯限制最短路径 (TRSP)

source: Boost Graph Inside
zh_hans: Boost 图内部

source: All deprecated functions will be removed on next mayor version 4.0.0
zh_hans: 所有已弃用的函数将在下一个主要版本 4.0.0 中被移除

source: Migration of functions
zh_hans: 函数迁移

source: Migrating functions
zh_hans: 迁移函数

source: Migration of ``pgr_aStar``
zh_hans: ``pgr_aStar``迁移

source: Starting from `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__
zh_hans: 开始从 `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__

source: ``pgr_aStar`` (`One to One`)
zh_hans: ``pgr_aStar`` (`一对一`)

source: ``pgr_aStar`` (`One to Many`)
zh_hans: ``pgr_aStar`` (`一对多`)

source: ``pgr_aStar`` (`Many to One`)
zh_hans: ``pgr_aStar`` (`多对一`)

source: Output columns were |old-generic-result|
zh_hans: 输出列是 |old-generic-result|

source: Depending on the overload used, the columns ``start_vid`` and ``end_vid`` might be missing:
zh_hans: 根据所使用的重载， ``start_vid`` 和``end_vid``列可能会丢失：

source: ``pgr_aStar`` (`One to One`) does not have ``start_vid`` and ``end_vid``.
zh_hans: ``pgr_aStar`` (`一对一`)没有``start_vid`` 和``end_vid``。

source: ``pgr_aStar`` (`One to Many`) does not have ``start_vid``.
zh_hans: ``pgr_aStar`` (`一对多`) 没有 ``start_vid``。

source: ``pgr_aStar`` (`Many to One`) does not have ``end_vid``.
zh_hans: ``pgr_aStar`` (`多对一`)没有 ``end_vid``。

source: Be aware of the existance of the additional columns.
zh_hans: 请注意附加列的存在。

source: In ``pgr_aStar`` (`One to One`)
zh_hans: 在``pgr_aStar`` (`一对一`)中

source: In ``pgr_aStar`` (`One to Many`)
zh_hans: 在``pgr_aStar`` (`一对多`)中

source: In ``pgr_aStar`` (`Many to One`)
zh_hans: 在``pgr_aStar`` (`多对一`)中

source: If needed filter out the added columns, for example:
zh_hans: 如果需要，过滤掉添加的列，例如：

source: If needed add the new columns, similar to the following example where ``pgr_dijkstra`` is used, and the function had to be modified to be able to return the new columns:
zh_hans: 如果需要添加新列，类似于以下使用 ``pgr_dijkstra`` 的示例，并且必须修改该函数才能返回新列：

source: In `v3.0 <https://docs.pgrouting.org/3.0/en/contraction-family.html#case-1-both-source-and-target-belong-to-the-contracted-graph>`__ the function ``my_dijkstra`` uses ``pgr_dijkstra``.
zh_hans: 在`v3.0 <https://docs.pgrouting.org/3.0/en/contraction-family.html#case-1-both-source-and-target-belong-to-the-contracted-graph>`__ 中，函数``my_dijkstra`` 使用 ``pgr_dijkstra``。

source: Starting from `v3.5 <https://docs.pgrouting.org/3.5/en/contraction-family.html#case-1-both-source-and-target-belong-to-the-contracted-graph>`__ the function ``my_dijkstra`` returns the new additional columns of ``pgr_dijkstra``.
zh_hans: 从 `v3.5 <https://docs.pgrouting.org/3.5/en/contraction-family.html#case-1-both-source-and-target-belong-to-the-contracted-graph>`__开始，函数 ``my_dijkstra`` 返回 ``pgr_dijkstra``的新附加列。

source: Migration of ``pgr_bdAstar``
zh_hans: 迁移``pgr_bdAstar``

source: ``pgr_bdAstar`` (`One to One`)
zh_hans: ``pgr_bdAstar`` (`一对一`)

source: ``pgr_bdAstar`` (`One to Many`)
zh_hans: ``pgr_bdAstar`` (`一对多`)

source: ``pgr_bdAstar`` (`Many to One`)
zh_hans: ``pgr_bdAstar`` (`多对一`)

source: ``pgr_bdAstar`` (`One to One`) does not have ``start_vid`` and ``end_vid``.
zh_hans: ``pgr_bdAstar`` (`一对一`)没有 ``start_vid`` 和 ``end_vid``。

source: ``pgr_bdAstar`` (`One to Many`) does not have ``start_vid``.
zh_hans: ``pgr_bdAstar`` (`一对多`) 没有 ``start_vid``。

source: ``pgr_bdAstar`` (`Many to One`) does not have ``end_vid``.
zh_hans: ``pgr_bdAstar`` (`多对一`) 没有 ``end_vid``。

source: In ``pgr_bdAstar`` (`One to One`)
zh_hans: 在``pgr_bdAstar`` (`一对一`)中

source: In ``pgr_bdAstar`` (`One to Many`)
zh_hans: 在``pgr_bdAstar`` (`一对多`)中

source: In ``pgr_bdAstar`` (`Many to One`)
zh_hans: 在``pgr_bdAstar`` (`多对一`)中

source: Migration of ``pgr_dijkstra``
zh_hans: 迁移``pgr_dijkstra``

source: Starting from `v3.5.0 <https://docs.pgrouting.org/3.5/en/migration.html>`__
zh_hans: 从`v3.5.0 <https://docs.pgrouting.org/3.5/en/migration.html>`__版本开始

source: ``pgr_dijkstra`` (`One to One`)
zh_hans: ``pgr_dijkstra`` (`一对一`)

source: ``pgr_dijkstra`` (`One to Many`)
zh_hans: ``pgr_dijkstra`` (`一对多`)

source: ``pgr_dijkstra`` (`Many to One`)
zh_hans: ``pgr_dijkstra`` (`多对一`)

source: ``pgr_dijkstra`` (`One to One`) does not have ``start_vid`` and ``end_vid``.
zh_hans: ``pgr_dijkstra`` (`一对一`)没有``start_vid`` 和 ``end_vid``。

source: ``pgr_dijkstra`` (`One to Many`) does not have ``start_vid``.
zh_hans: ``pgr_dijkstra`` (`一对多`) 没有 ``start_vid``。

source: ``pgr_dijkstra`` (`Many to One`) does not have ``end_vid``.
zh_hans: ``pgr_dijkstra`` (`多对一`) 没有``end_vid``。

source: In ``pgr_dijkstra`` (`One to One`)
zh_hans: 在``pgr_dijkstra`` (`一对一`)中

source: In ``pgr_dijkstra`` (`One to Many`)
zh_hans: 在``pgr_dijkstra`` (`一对多`)中

source: In ``pgr_dijkstra`` (`Many to One`)
zh_hans: 在``pgr_dijkstra`` (`多对一`)中

source: If needed add the new columns, for example:
zh_hans: 如果需要，过滤掉添加的列，例如：

source: Migration of ``pgr_drivingdistance``
zh_hans: 迁移``pgr_drivingdistance``

source: Starting from `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__ :doc:`pgr_drivingDistance` result columns are being standarized.
zh_hans: 从 `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__开始， :doc:`pgr_drivingDistance`结果列正在标准化。

source: ``pgr_drivingdistance`` (Single vertex)
zh_hans: ``pgr_drivingdistance`` (单个顶点)

source: ``pgr_drivingdistance`` (Multiple vertices)
zh_hans: ``pgr_drivingdistance`` (多个顶点)

source: Output columns were |result-dij-dd|
zh_hans: 输出列是 |result-dij-dd|

source: Does not have ``start_vid`` and ``depth`` result columns.
zh_hans: 没有``start_vid``和 ``depth``结果列。

source: Has ``from_v`` instead of ``start_vid`` result column.
zh_hans: 有 ``from_v`` 而不是 ``start_vid``结果列。

source: does not have ``depth`` result column.
zh_hans: 没有``depth``结果列。

source: Be aware of the existance and name change of the result columns.
zh_hans: 请注意结果列的存在和名称更改。

source: Using `this <https://docs.pgrouting.org/3.5/en/pgr_drivingDistance.html#single-vertex>`__ example.
zh_hans: 使用`这个 <https://docs.pgrouting.org/3.5/en/pgr_drivingDistance.html#single-vertex>`__示例。

source: ``depth`` contains the depth of the ``node``.
zh_hans: ``depth``包含``node``的深度。

source: ``pred`` contains the predecessor of the ``node``.
zh_hans: ``pred`` 包含``node``的前驱。

source: If needed filter out the added columns, for example, to return the original columns
zh_hans: 如果需要，过滤掉添加的列，例如返回原始列

source: Using `this <https://docs.pgrouting.org/3.5/en/pgr_drivingDistance.html#multiple-vertices>`__ example.
zh_hans: 使用 `这个 <https://docs.pgrouting.org/3.5/en/pgr_drivingDistance.html#multiple-vertices>`__ 示例。

source: The ``from_v`` result column name changes to ``start_vid``.
zh_hans: ``from_v`结果列名称更改为 ``start_vid``。

source: If needed filter out and rename colums, for example, to return the original columns:
zh_hans: 如果需要，过滤掉并重命名列，例如，返回原始列：

source: Migration of ``pgr_KSP``
zh_hans: 迁移``pgr_KSP``

source: Starting from `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__ :doc:`pgr_KSP` result columns are being standarized.
zh_hans: 从 `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__ 开始， :doc:`pgr_KSP`结果列正在标准化。

source: ``pgr_KSP`` (One to One)
zh_hans: ``pgr_KSP`` (一对一)

source: Output columns were |ksp-result|
zh_hans: 输出列是 |ksp-result|

source: ``pgr_KSP`` (One to One) does not have ``start_vid`` and ``end_vid``.
zh_hans: ``pgr_KSP`` (一对一) 没有 ``start_vid`` 和``end_vid``。

source: If needed filter out the added columns, for example, to return the original columns:
zh_hans: 如果需要，过滤掉添加的列，例如，返回原始列：

source: :doc:`pgr_maxCardinalityMatch` works only for undirected graphs, therefore the ``directed`` flag has been removed.
zh_hans: :doc:`pgr_maxCardinalityMatch` 仅适用于无向图，因此``有向``标志已被删除。

source: Migration of ``pgr_withPointsDD``
zh_hans: 迁移``pgr_withPointsDD``

source: Starting from `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__ :doc:`pgr_withPointsDD` result columns are being standarized.
zh_hans: 从`v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__开始 :doc:`pgr_withPointsDD`结果列正在标准化。

source: And ``driving_side`` parameter changed from named optional to unnamed compulsory **driving side** and its validity differ for directed and undirected graphs.
zh_hans: 并且 ``driving_side`` 参数从命名可选变为未命名强制**driving side**，其有效性对于有向图和无向图是不同的。

source: ``pgr_withPointsDD`` (Single vertex)
zh_hans: ``pgr_withPointsDD`` (单个顶点)

source: ``pgr_withPointsDD`` (Multiple vertices)
zh_hans: ``pgr_withPointsDD`` (多个顶点)

source: Output columns were |result-1-1-no-seq|
zh_hans: 输出列为|result-1-1-no-seq|

source: Does not have ``start_vid``, ``pred`` and ``depth`` result columns.
zh_hans: 没有``start_vid``，``pred``和``depth``结果列。

source: ``driving_side`` parameter was named optional now it is compulsory unamed.
zh_hans: ``driving_side`` 参数被命名为可选，现在强制未命名。

source: ``pgr_withPointsDD`` (`Multiple vertices`)
zh_hans: ``pgr_withPointsDD`` (`多个顶点`)

source: Output columns were |result-m-1-no-seq|
zh_hans: 输出列为|result-m-1-no-seq|

source: Does not have ``depth`` and ``pred`` result columns.
zh_hans: 没有 ``depth``和``pred``结果列。

source: Driving side was optional
zh_hans: 驾驶侧是可选的

source: The default values on this query are:
zh_hans: 此查询的默认值为：

source: Driving side was named optional
zh_hans: 驾驶侧被命名为可选

source: On directed graph ``b`` could be used as **driving side**
zh_hans: 在有向图上 ``b``可以用作 **行驶方向**

source: On undirected graph ``r`` could be used as **driving side**
zh_hans: 在无向图上``r``可以用作**行驶方向**

source: Also ``l`` could be used as **driving side**
zh_hans: ``l`` 也可用作**行驶方向**

source: After Migration
zh_hans: 迁移后

source: Be aware of the existance of the additional return columns.
zh_hans: 请注意附加返回列的存在。

source: New output columns are |result-spantree|
zh_hans: 新的输出列是 |result-spantree|

source: Using `this <https://docs.pgrouting.org/3.5/en/pgr_withPointsDD.html#single-vertex>`__ example.
zh_hans: 使用`这个 <https://docs.pgrouting.org/3.5/en/pgr_withPointsDD.html#single-vertex>`__ 示例。

source: ``depth`` contains the **depth** from the ``start_vid`` vertex to the ``node``.
zh_hans: ``depth``包含从``start_vid``顶点到``node``的 **深度**。

source: To migrate, use an unnamed valid value for **driving side** after the **distance** parameter:
zh_hans: 要进行迁移，请在 **distance**参数之后使用一个未命名的有效值作为 **行驶方向**：

source: To get results from previous versions:
zh_hans: 要获取以前版本的结果：

source: filter out the additional columns, for example;
zh_hans: 过滤掉额外的列，例如；

source: When ``details => false`` to remove the points use ``WHERE node >= 0 OR cost = 0``
zh_hans: 当设置``details => false`` 以移除点时，请使用 ``WHERE node >= 0 OR cost = 0``

source: Using `this <https://docs.pgrouting.org/3.5/en/pgr_withPointsDD.html#multiple-vertices>`__ example.
zh_hans: 使用`这个 <https://docs.pgrouting.org/3.5/en/pgr_withPointsDD.html#multiple-vertices>`__ 示例。

source: Filter out the additional columns
zh_hans: 过滤掉额外的列

source: Starting from `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__ :doc:`pgr_withPointsKSP` result columns are being standarized.
zh_hans: 从`v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__ 开始 ，:doc:`pgr_withPointsKSP`结果列正在标准化。

source: ``pgr_withPointsKSP`` (`One to One`)
zh_hans: ``pgr_withPointsKSP`` (`一对一`)

source: New output columns are |nksp-result|
zh_hans: 新的输出列是 |nksp-result|

source: Migration of turn restrictions
zh_hans: 转弯限制的迁移

source: :doc:`pgr_trsp` signatures have changed and many issues have been fixed in the new signatures. This section will show how to migrate from the old signatures to the new replacement functions. This also affects the restrictions.
zh_hans: :doc:`pgr_trsp` 的签名已更改，并且新签名中已修复许多问题。 本节将展示如何从旧签名迁移到新的替换函数。 这也会影响限制。

source: The integral type of the ``Edges SQL`` can only be ``INTEGER``.
zh_hans: ``Edges SQL`` 的整数类型只能是 ``INTEGER``。

source: The floating point type of the ``Edges SQL`` can only be ``FLOAT``.
zh_hans: ``Edges SQL`` 的浮点类型只能是 ``FLOAT``。

source: ``directed`` flag is compulsory.
zh_hans: ``directed``标志是强制性的。

source: Does not autodetect if ``reverse_cost`` column exist.
zh_hans: 不自动检测 ``reverse_cost``列是否存在。

source: User must be careful to match the existence of the column with the value of ``has_rcost`` parameter.
zh_hans: 用户必须小心地将列的存在与``has_rcost`` 参数的值相匹配。

source: The restrictions inner query is optional.
zh_hans: 内部查询的限制是可选的。

source: The output column names are meaningless
zh_hans: 输出列名没有意义

source: Migrate by using:
zh_hans: 使用以下方式迁移：

source: :doc:`pgr_dijkstra` when there are no restrictions,
zh_hans: :doc:`pgr_dijkstra`当没有限制时，

source: :doc:`pgr_trsp` (One to One) when there are restrictions.
zh_hans: :doc:`pgr_trsp` (一对一)当有限制时。

source: Migrating ``pgr_trsp`` (Vertices) using ``pgr_dijkstra``
zh_hans: 使用 ``pgr_dijkstra`` 迁移 ``pgr_trsp``（顶点）

source: The following query does not have restrictions.
zh_hans: 以下查询没有限制。

source: A message about deprecation is shown
zh_hans: 显示有关弃用的消息

source: Deprecated functions will be removed on the next mayor version 4.0.0
zh_hans: 已弃用的功能将在下一个正式版本 4.0.0 中删除

source: The types casting has been removed.
zh_hans: 类型强制转换已被删除。

source: Autodetects if ``reverse_cost`` column is in the edges SQL.
zh_hans: 自动检测``reverse_cost``列是否在边SQL中。

source: Accepts ``ANY-INTEGER`` on integral types
zh_hans: 接受整数类型``ANY-INTEGER``

source: Accepts ``ANY-NUMERICAL`` on floating point types
zh_hans: 接受浮点类型``ANY-NUMERICAL``

source: ``directed`` flag has a default value of ``true``.
zh_hans: ``directed`` 标志的默认值为``true``。

source: Use the same value that on the original query.
zh_hans: 使用与原始查询相同的值。

source: In this example it is ``true`` which is the default value.
zh_hans: 在此示例中，默认值为``true``。

source: The flag has been omitted and the default is been used.
zh_hans: 该标志已被省略，并使用默认值。

source: When the need of using strictly the same (meaningless) names and types of the function been migrated then:
zh_hans: 当需要使用严格相同（无意义）的函数名称和类型进行迁移时：

source: Migrating ``pgr_trsp`` (Vertices) using ``pgr_trsp``
zh_hans: 使用``pgr_trsp``迁移 ``pgr_trsp``（顶点）

source: The following query has restrictions.
zh_hans: 以下查询有限制。

source: The restrictions are the last parameter of the function
zh_hans: 限制是函数的最后一个参数
