Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Finding dead ends
sv: Att hitta återvändsgränder

source: If there is a vertices table already built using ``pgr_extractVertices`` and want the degree of the whole graph rather than a subset, it can be forgo using ``pgr_degree`` and work with the ``in_edges`` and ``out_edges`` columns directly.
sv: Om det redan finns en toppunktstabell som byggts med hjälp av ``pgr_extractVertices`` och man vill ha graden för hela grafen i stället för en delmängd, kan man avstå från att använda ``pgr_degree`` och arbeta med kolumnerna ``in_edges`` och ``out_edges`` direkt.

source: The degree of a dead end is 1.
sv: Graden av en återvändsgränd är 1.

source: Finding linear vertices
sv: Hitta linjära hörn

source: The degree of a linear vertex is 2.
sv: Graden för ett linjärt toppunkt är 2.

source: If there is a vertices table already built using the ``pgr_extractVertices``
sv: Om det redan finns en toppunktstabell som byggts upp med hjälp av ``pgr_extractVertices``

source: ``pgr_depthFirstSearch`` - Proposed
sv: ``pgr_depthFirstSearch`` - Föreslagen
zh_hans: ``pgr_depthFirstSearch`` - 拟议

source: ``pgr_depthFirstSearch`` — Returns a depth first search traversal of the graph. The graph can be directed or undirected.
sv: ``pgr_depthFirstSearch`` - Returnerar en genomgång av grafen med första sökdjupet. Grafen kan vara riktad eller oriktad.
zh_hans: ``pgr_depthFirstSearch`` — 返回图的深度优先搜索遍历。 该图可以是有向图或无向图。

source: Depth First Search algorithm is a traversal algorithm which starts from a root vertex, goes as deep as possible, and backtracks once a vertex is reached with no adjacent vertices or with all visited adjacent vertices. The traversal continues until all the vertices reachable from the root vertex are visited.
sv: Depth First Search-algoritmen är en traverseringsalgoritm som startar från en rotvertex, går så djupt som möjligt och backar när en vertex nås utan några intilliggande vertex eller med alla besökta intilliggande vertex. Traversieringen fortsätter tills alla toppar som kan nås från rotvertexen har besökts.
zh_hans: 深度优先搜索算法是一种遍历算法，从根顶点开始，尽可能深入探索，一旦到达一个没有相邻顶点或所有相邻顶点都已访问的顶点，就会回溯。遍历会一直持续，直到从根顶点可达的所有顶点都被访问。

source: The implementation works for both **directed** and **undirected** graphs.
sv: Implementationen fungerar för både **directed** och **undirected** grafer.
zh_hans: 该实现适用于**有向**图和**无向**图。

source: Provides the Depth First Search traversal order from a root vertex or from a set of root vertices.
sv: Ger traversieringsordningen Depth First Search från en rotvertex eller från en uppsättning rotvertex.
zh_hans: 提供从根顶点或一组根顶点开始的深度优先搜索遍历顺序。

source: An optional non-negative maximum depth parameter to limit the results up to a particular depth.
sv: En valfri icke-negativ parameter för maximalt djup för att begränsa resultaten till ett visst djup.
zh_hans: 可选的非负最大深度参数，用于限制结果的深度到特定的深度。

source: For optimization purposes, any duplicated values in the `Root vids` are ignored.
sv: För optimeringsändamål ignoreras alla duplicerade värden i `Root vids`.
zh_hans: 为了优化的目的，`Root vids` 中的任何重复值都会被忽略。

source: It does not produce the shortest path from a root vertex to a target vertex.
sv: Den producerar inte den kortaste vägen från en rotvertex till en målvertex.
zh_hans: 它不会生成从根顶点到目标顶点的最短路径。

source: The aggregate cost of traversal is not guaranteed to be minimal.
sv: Det är inte säkert att den sammanlagda kostnaden för traverseringen är minimal.
zh_hans: 不保证遍历的总成本最小。

source: The returned values are ordered in ascending order of `start_vid`.
sv: De returnerade värdena är ordnade i stigande ordning efter `start_vid`.
zh_hans: 返回值按 `start_vid` 升序排列。

source: Depth First Search Running time: :math:`O(E + V)`
sv: Djup Första sökning Löptid: :math:`O(E + V)`
zh_hans: 深度优先搜索运行时间： :math:`O(E + V)`

source: Same as `Single vertex`_ but with edges in descending order of ``id``.
sv: Samma som `Single vertex`_ men med kanter i fallande ordning efter ``id``.
zh_hans: 与 `单顶点`_相同，但边按``id``降序排列。

source: `Boost: Depth First Search <https://www.boost.org/libs/graph/doc/depth_first_search.html>`__
sv: `Boost: Djup första sökning <https://www.boost.org/libs/graph/doc/depth_first_search.html>`__

source: `Boost: Undirected DFS <https://www.boost.org/libs/graph/doc/undirected_dfs.html>`__
sv: `Boost: Oriktad DFS <https://www.boost.org/libs/graph/doc/undirected_dfs.html>`__

source: `Wikipedia: Depth First Search algorithm <https://en.wikipedia.org/wiki/Depth-first_search>`__
sv: `Wikipedia: Djup först-sökalgoritm <https://en.wikipedia.org/wiki/Depth-first_search>`__
zh_hans: `维基百科：深度优先搜索算法 <https://en.wikipedia.org/wiki/Depth-first_search>`__

source: ``pgr_dijkstra`` — Shortest path using Dijkstra algorithm.
sv: ``pgr_dijkstra`` - Kortaste vägen med Dijkstra-algoritmen.

source: Signature change on pgr_dijkstra(One to One)
sv: Ändring av signatur på pgr_dijkstra(One to One)

source: From vertex :math:`6` to vertices :math:`\{10, 17\}` on a **directed**
sv: Från toppunkten :math:`6` till toppunkterna :math:`\{10, 17\}` på en **riktad**
zh_hans: 在**有向**图上，从顶点 :math:`6`到顶点 :math:`\{10, 17\}`

source: The examples of this section are based on the :doc:`sampledata` network.
sv: Exemplen i detta avsnitt är baserade på :doc:`sampledata`-nätverket.
zh_hans: 本节的示例基于 :doc:`示例数据` 网络。

source: For **directed** graphs with ``cost`` and ``reverse_cost`` columns
sv: För **riktade** grafer med kolumnerna ``kostnad`` och ``omvända_kostnader``
zh_hans: 对于带有 ``cost``和``reverse_cost``列的**有向**图

source: Directed graph with cost and reverse cost columns
sv: Riktad graf med kolumner för kostnad och omvänd kostnad
zh_hans: 带成本列和反向成本列的有向图

source: 1) Path from :math:`6` to :math:`10`
sv: 1) Väg från :math:`6` till :math:`10`
zh_hans: 1) 从 :math:`6` 到 :math:`10` 的路径

source: 2) Path from :math:`6` to :math:`7`
sv: 2) Väg från :math:`6` till :math:`7`
zh_hans: 2) 从 :math:`6` 到 :math:`7` 的路径

source: 3) Path from :math:`12` to :math:`10`
sv: 3) Väg från :math:`12` till :math:`10`
zh_hans: 3) 从 :math:`12` 到 :math:`10` 的路径

source: 4) Path from :math:`12` to :math:`7`
sv: 4) Väg från :math:`12` till :math:`7`
zh_hans: 4) 从 :math:`12` 到 :math:`7` 的路径

source: 5) Using `One to Many`_ to get the solution of examples 1 and 2
sv: 5) Använda `One to Many`_ för att få lösningen på exempel 1 och 2
zh_hans: 5) 使用 `一对多`_ 来获取示例1和示例2的解决方案

source: Paths :math:`\{6\}\rightarrow\{10, 7\}`
sv: Banor :math:`\{6\}\rightarrow\{10, 7\}`
zh_hans: 路径 :math:`\{6\}\rightarrow\{10, 7\}`

source: 6) Using `Many to One`_ to get the solution of examples 2 and 4
sv: 6) Använda `Many to One`_ för att få lösningen på exempel 2 och 4
zh_hans: 6) 使用 `多对一`_ 来获取示例2和示例4的解决方案

source: Paths :math:`\{6, 12\}\rightarrow\{7\}`
sv: Banor :math:`\{6, 12\}\rightarrow\{7\}` `
zh_hans: 路径 :math:`\{6, 12\}\rightarrow\{7\}`

source: 7) Using `Many to Many`_ to get the solution of examples 1 to 4
sv: 7) Använda `Many to Many`_ för att få lösningen på exempel 1 till 4
zh_hans: 7) 使用 `多对多`_ 来获取示例1到4的解决方案

source: Paths :math:`\{6, 12\}\rightarrow\{10, 7\}`
sv: Banor :math:`\{6, 12\}\rightarrow\{10, 7\}`
zh_hans: 路径 :math:`\{6, 12\}\rightarrow\{10, 7\}`

source: 8) Using `Combinations`_ to get the solution of examples 1 to 3
sv: 8) Använda `Kombinationer`_ för att få lösningen på exempel 1 till 3
zh_hans: 8) 使用 `组合`_ 来获取示例1到3的解决方案

source: For **undirected** graphs with ``cost`` and ``reverse_cost`` columns
sv: För **omdirigerade** grafer med kolumnerna ``kostnad`` och ``omvända kostnader``
zh_hans: 对于带有 ``cost``和``reverse_cost``列的**无向**图

source: Undirected graph with cost and reverse cost columns
sv: Oriktad graf med kostnads- och omvända kostnadskolumner
zh_hans: 带成本列和反向成本列的无向图

source: 9) Path from :math:`6` to :math:`10`
sv: 9) Stigen från :math:`6` till :math:`10`
zh_hans: 9)从 :math:`6` 到 :math:`10` 的路径

source: 10) Path from :math:`6` to :math:`7`
sv: 10) Väg från :math:`6` till :math:`7`
zh_hans: 10) 从 :math:`6` 到 :math:`7` 的路径

source: 11) Path from :math:`12` to :math:`10`
sv: 11) Stigen från :math:`12` till :math:`10`
zh_hans: 11)从 :math:`12` 到 :math:`10` 的路径

source: 12) Path from :math:`12` to :math:`7`
sv: 12) Väg från :math:`12` till :math:`7`
zh_hans: 12)从 :math:`12` 到 :math:`7` 的路径

source: 13) Using `One to Many`_ to get the solution of examples 9 and 10
sv: 13) Använda `One to Many`_ för att få lösningen till exempel 9 och 10
zh_hans: 13) 使用 `一对多`_ 来获取示例9和10的解决方案

source: 14) Using `Many to One`_ to get the solution of examples 10 and 12
sv: 14) Använda `Many to One`_ för att få lösningen på exempel 10 och 12
zh_hans: 14) 使用 `多对一`_ 来获取示例10和12的解决方案

source: 15) Using `Many to Many`_ to get the solution of examples 9 to 12
sv: 15) Använda `Many to Many`_ för att få lösningen på exempel 9 till 12
zh_hans: 15) 使用 `多对多`_ 来获取示例9到12的解决方案

source: 16) Using `Combinations`_ to get the solution of examples 9 to 11
sv: 16) Använda `Kombinationer`_ för att få lösningen på exempel 9 till 11
zh_hans: 16) 使用 `组合`_ 来获取示例9到11的解决方案

source: For **directed** graphs only with ``cost`` column
sv: För **riktade** grafer endast med kolumn ``kostnad``
zh_hans: 仅适用于**有向**图，且仅包含``cost``列

source: Directed graph only with cost column
sv: Riktad graf endast med kostnadskolumn
zh_hans: 仅有成本列的有向图

source: 17) Path from :math:`6` to :math:`10`
sv: 17) Väg från :math:`6` till :math:`10`
zh_hans: 17)从 :math:`6` 到 :math:`10` 的路径

source: 18) Path from :math:`6` to :math:`7`
sv: 18) Väg från :math:`6` till :math:`7`
zh_hans: 18) 从 :math:`6` 到 :math:`7` 的路径

source: 19) Path from :math:`12` to :math:`10`
sv: 19) Väg från :math:`12` till :math:`10`
zh_hans: 19)从 :math:`12` 到 :math:`10` 的路径

source: 20) Path from :math:`12` to :math:`7`
sv: 20) Väg från :math:`12` till :math:`7`
zh_hans: 20) 从 :math:`12` 到 :math:`7` 的路径

source: 21) Using `One to Many`_ to get the solution of examples 17 and 18
sv: 21) Använda `One to Many`_ för att få lösningen på exempel 17 och 18
zh_hans: 21) 使用 `一对多`_ 来获取示例17和18的解决方案

source: 22) Using `Many to One`_ to get the solution of examples 18 and 20
sv: 22) Använda `Many to One`_ för att få lösningen på exempel 18 och 20
zh_hans: 22) 使用 `多对一`_ 来获取示例18和20的解决方案

source: 23) Using `Many to Many`_ to get the solution of examples 17 to 20
sv: 23) Använda `Many to Many`_ för att få lösningen på exempel 17 till 20
zh_hans: 23) 使用 `多对多`_ 来获取示例17到20的解决方案

source: 24) Using `Combinations`_ to get the solution of examples 17 to 19
sv: 24) Använda `Kombinationer`_ för att få lösningen på exempel 17 till 19
zh_hans: 24) 使用 `组合`_ 来获取示例17到19的解决方案

source: For **undirected** graphs only with ``cost`` column
sv: För **ej riktade** grafer endast med kolumn ``kostnad``
zh_hans: 仅适用于带有``cost``列的**无向**图

source: Undirected graph only with cost column
sv: Ostyrd graf endast med kostnadskolumn
zh_hans: 仅有成本列的无向图

source: 25) Path from :math:`6` to :math:`10`
sv: 25) Väg från :math:`6` till :math:`10`
zh_hans: 25) 从 :math:`6` 到 :math:`10` 的路径

source: 26) Path from :math:`6` to :math:`7`
sv: 26) Väg från :math:`6` till :math:`7`
zh_hans: 26) 从 :math:`6` 到 :math:`7` 的路径

source: 27) Path from :math:`12` to :math:`10`
sv: 27) Väg från :math:`12` till :math:`10`
zh_hans: 27)从 :math:`12` 到 :math:`10` 的路径

source: 28) Path from :math:`12` to :math:`7`
sv: 28) Väg från :math:`12` till :math:`7`
zh_hans: 28) 从 :math:`12` 到 :math:`7` 的路径

source: 29) Using `One to Many`_ to get the solution of examples 25 and 26
sv: 29) Använda `One to Many`_ för att få lösningen på exempel 25 och 26
zh_hans: 29) 使用 `一对多`_ 来获取示例25和26的解决方案

source: 30) Using `Many to One`_ to get the solution of examples 26 and 28
sv: 30) Använda `Many to One`_ för att få lösningen på exempel 26 och 28
zh_hans: 30) 使用 `多对一`_ 来获取示例26和28的解决方案

source: 31) Using `Many to Many`_ to get the solution of examples 25 to 28
sv: 31) Använda `Many to Many`_ för att få lösningen på exempel 25 till 28
zh_hans: 31) 使用 `多对多`_ 来获取示例25到28的解决方案

source: 32) Using `Combinations`_ to get the solution of examples 25 to 27
sv: 32) Använda `Kombinationer`_ för att få lösningen på exempel 25 till 27
zh_hans: 32) 使用 `组合`_ 来获取示例25到27的解决方案

source: Equvalences between signatures
sv: Utjämningar mellan signaturer
zh_hans: 签名之间的等价性

source: The following examples find the path for :math:`\{6\}\rightarrow\{10\}`
sv: Följande exempel visar sökvägen för :math:`\{6\}\rightarrow\{10\}`
zh_hans: 下面的示例可以找到 :math:`\{6}\rightarrow\{10\}` 的路径

source: 33) Using `One to One`_
sv: 33) Använda "en till en
zh_hans: 33) 使用 `一对一`_

source: 34) Using `One to Many`_
sv: 34) Använda `One to Many`_
zh_hans: 34)使用 `一对多`_

source: 35) Using `Many to One`_
sv: 35) Använda `Många till ett`__
zh_hans: 35) 使用 `多对一`_

source: 36) Using `Many to Many`_
sv: 36) Använda `Many to Many`_
zh_hans: 36) 使用 `多对多`_

source: 37) Using `Combinations`_
sv: 37) Använda `Kombinationer`_
zh_hans: 37) 使用 `组合`_

source: `Boost: Dijkstra shortest paths <https://www.boost.org/libs/graph/doc/dijkstra_shortest_paths.html>`__
sv: `Boost: Dijkstra kortaste vägar <https://www.boost.org/libs/graph/doc/dijkstra_shortest_paths.html>`__

source: https://en.wikipedia.org/wiki/Dijkstra%27s_algorithm
sv: https://en.wikipedia.org/wiki/Dijkstra%27s_algoritm

source: ``pgr_dijkstraCost`` - Total cost of the shortest path using Dijkstra algorithm.
sv: ``pgr_dijkstraCost`` - Totalkostnad för den kortaste vägen med Dijkstra-algoritmen.

source: The ``pgr_dijkstraCost`` function summarizes of the cost of the shortest path using Dijkstra Algorithm.
sv: Funktionen ``pgr_dijkstraCost`` sammanfattar kostnaden för den kortaste vägen med hjälp av Dijkstra-algoritmen.

source: ``pgr_dijkstraCostMatrix`` - Calculates a cost matrix using :doc:`pgr_dijkstra`.
sv: ``pgr_dijkstraCostMatrix`` - Beräknar en kostnadsmatris med hjälp av :doc:`pgr_dijkstra`.
zh_hans: ``pgr_dijkstraCostMatrix`` - 使用 :doc:`pgr_dijkstra` 计算成本矩阵。

source: Using Dijkstra algorithm, calculate and return a cost matrix.
sv: Beräkna och returnera en kostnadsmatris med hjälp av Dijkstra-algoritmen.
zh_hans: 使用 Dijkstra 算法，计算并返回成本矩阵。

source: ``pgr_dijkstraNear`` - Proposed
sv: ``pgr_dijkstraNear`` - Förslag
zh_hans: ``pgr_dijkstraNear`` - 拟议

source: ``pgr_dijkstraNear`` — Using Dijkstra's algorithm, finds the route that leads to the nearest vertex.
sv: ``pgr_dijkstraNear`` - Med hjälp av Dijkstras algoritm hittar du den rutt som leder till närmaste toppunkt.
zh_hans: ``pgr_dijkstraNear`` - 使用 Dijkstra 算法，找到通往最近顶点的路径。

source: Given a graph, a starting vertex and a set of ending vertices, this function finds the shortest path from the starting vertex to the nearest ending vertex.
sv: Givet en graf, en startpunkt och en uppsättning slutpunkter, hittar den här funktionen den kortaste vägen från startpunkten till närmaste slutpunkt.
zh_hans: 给定一个图、一个起始顶点和一组终止顶点，该函数会找出从起始顶点到最近的终止顶点的最短路径。

source: Uses Dijkstra algorithm.
sv: Använder Dijkstra-algoritmen.
zh_hans: 使用 Dijkstra 算法。

source: Works for **directed** and **undirected** graphs.
sv: Fungerar för **directed** och **undirected** grafer.
zh_hans: 适用于**有向**和**无向**图。

source: When there are more than one path to the same vertex with same cost:
sv: När det finns mer än en väg till samma toppunkt med samma kostnad:
zh_hans: 当有多条路径通向同一顶点且成本相同时：

source: The algorithm will return just one path
sv: Algoritmen kommer bara att returnera en väg
zh_hans: 算法将只返回一条路径

source: Optionally allows to find more than one path.
sv: Det går även att hitta mer än en sökväg.
zh_hans: 可选择查找多条路径。

source: When more than one path is to be returned:
sv: När mer än ett tågläge ska returneras:
zh_hans: 当需要返回多条路径时：

source: Results are sorted in increasing order of:
sv: Resultaten sorteras i stigande ordning efter:
zh_hans: 结果按以下顺序递增排序：

source: aggregate cost
sv: sammanlagd kostnad
zh_hans: 总成本

source: Within the same value of aggregate costs:
sv: Inom samma värde för de sammanlagda kostnaderna:
zh_hans: 在总成本相同值范围内：

source: results are sorted by (source, target)
sv: resultaten sorteras efter (källa, mål)
zh_hans: 结果按 (source, target)排序

source: Running time: Dijkstra running time: :math:`drt = O((|E| + |V|)log|V|)`
sv: Körtid: Dijkstra-löptid: :math:`drt = O((|E| + |V|)log|V|)`
zh_hans: 运行时间：Dijkstra 运行时间： :math:`drt = O((|E| + |V|)log|V|)`

source: One to Many; :math:`drt`
sv: En till många; :math:`drt`
zh_hans: 一对多； :math:`drt`

source: Many to One: :math:`drt`
sv: Många till en: :math:`drt`
zh_hans: 多对一： :math:`drt`

source: Many to Many: :math:`drt * |Starting vids|`
sv: Många till många: :math:`drt * |Startande vids|`
zh_hans: 多对多： :math:`drt * |Starting vids|`

source: Combinations: :math:`drt * |Starting vids|`
sv: Kombinationer: :math:`drt * |Starting vids|`
zh_hans: 组合： :math:`drt * |Starting vids|`

source: Departing on car from vertex :math:`6` find the nearest subway station.
sv: Avgår med bil från toppunkt :math:`6` hitta närmaste tunnelbanestation.
zh_hans: 从顶点:math:`6`乘车出发，找到最近的地铁站。

source: Using a **directed** graph for car routing.
sv: Använda en **riktad** graf för bildirigering.
zh_hans: 使用**有向**图进行汽车路线规划。

source: The subway stations are on the following vertices :math:`\{1, 10, 11\}`
sv: Tunnelbanestationerna ligger på följande hörn :math:`\{1, 10, 11\}`
zh_hans: 地铁站位于以下顶点上 :math:``{1, 10, 11\}`

source: The defaults used:
sv: De standardvärden som används:
zh_hans: 使用的默认值：

source: `directed => true`
sv: `riktad => sann`

source: `cap => 1`
sv: `kap => 1`

source: The result shows that station at vertex :math:`11` is the nearest.
sv: Resultatet visar att stationen vid toppunktet :math:`11` är den närmaste.
zh_hans: 结果显示，位于顶点 :math:`11` 的站最近。

source: Departing on a car from a subway station find the nearest **two** stations to vertex :math:`2`
sv: Avgår med en bil från en tunnelbanestation hitta de närmaste **två** stationerna till toppunkten :math:`2`
zh_hans: 从地铁站开车出发，找到距离顶点 :math:`2`最近的**两个**车站

source: On line `4`: using the positional parameter: `directed` set to ``true``
sv: På rad `4`: använder den positionella parametern: `directed` satt till ``true``
zh_hans: 第`4`行：使用位置参数：`directed`设置为`true`

source: In line `5`: using named parameter `cap => 2`
sv: I rad `5`: använder namngiven parameter `cap => 2`
zh_hans: 第 `5` 行：使用命名参数 `cap => 2`

source: The result shows that station at vertex :math:`10` is the nearest and the next best is :math:`11`.
sv: Resultatet visar att stationen vid toppunktet :math:`10` är den närmaste och den näst bästa är :math:`11`.
zh_hans: 结果显示，位于顶点 :math:`10` 的站点最近，其次是 :math:`11`。

source: Find the best pedestrian connection between two lines of buses
sv: Hitta den bästa förbindelsen för fotgängare mellan två busslinjer
zh_hans: 在两条公交线路之间寻找最佳的行人通道

source: Using an **undirected** graph for pedestrian routing
sv: Använda en **omdirigerad** graf för att leda fotgängare

source: The first subway line stations are at :math:`\{15, 16\}`
sv: De första tunnelbanestationerna ligger vid :math:`\{15, 16\}`
zh_hans: 第一条地铁线的站点位于 :math:`\{15, 16\}`

source: The second subway line stations stops are at :math:`\{1, 10, 11\}`
sv: Den andra tunnelbanelinjen stannar vid :math:`\{1, 10, 11\}`
zh_hans: 地铁二号线的站点是:math:`\{1, 10, 11\}`

source: On line `4`: using the named parameter: `directed => false`
sv: På rad `4`: använder den namngivna parametern: `directed => false`
zh_hans: 第 `4` 行：使用命名参数：`directed => false`

source: `global => true`
sv: `global => sant`

source: For a pedestrian the best connection is to get on/off is at vertex :math:`15` of the first subway line and at vertex :math:`10` of the second subway line.
sv: För en fotgängare är den bästa anslutningen att gå av och på vid toppunkten :math:`15` på den första tunnelbanelinjen och vid toppunkten :math:`10` på den andra tunnelbanelinjen.
zh_hans: 对于行人来说，上下车的最佳连接点是第一条地铁线的顶点 :math:`15` 和第二条地铁线的顶点 :math:`10`。

source: Only `one` route is returned because `global` is ``true`` and `cap` is ``1``
sv: Endast `en` rutt returneras eftersom `global` är ``true`` och `cap` är ``1``
zh_hans: 只返回 `一条`路由，因为 `global` 为 `true` 且 `cap` 为 `1

source: Find the best car connection between all the stations of two subway lines
sv: Hitta den bästa bilförbindelsen mellan alla stationer på två tunnelbanelinjer
zh_hans: 查找两条地铁线所有站点之间的最佳汽车连接线路

source: The first subway line stations stops are at :math:`\{1, 10, 11\}`
sv: Den första tunnelbanelinjen stannar vid :math:`\{1, 10, 11\}`
zh_hans: 第一条地铁线的站点是:math:`\{1, 10, 11\}`

source: The second subway line stations are at :math:`\{15, 16\}`
sv: Den andra tunnelbanelinjens stationer ligger vid :math:`\{15, 16\}`
zh_hans: 地铁二号线站点位于 :math:`\{15, 16\}`

source: The combinations contents:
sv: Kombinationernas innehåll:
zh_hans: 组合内容：

source: lines `3~4` sets the start vertices to be from the first subway line and the ending vertices to be from the second subway line
sv: linjerna `3~4` anger att startpunkterna ska vara från den första tunnelbanelinjen och att slutpunkterna ska vara från den andra tunnelbanelinjen
zh_hans: 行 `3~4` 将起始顶点设置为第一条地铁线上的顶点，将终点顶点设置为第二条地铁线上的顶点

source: lines `6~7` sets the start vertices to be from the first subway line and the ending vertices to be from the first subway line
sv: linjerna `6~7` anger att startpunkterna ska vara från den första tunnelbanelinjen och att slutpunkterna ska vara från den första tunnelbanelinjen
zh_hans: 行 `6~7` 将起始顶点设置为第一条地铁线上的顶点，将终点顶点设置为第一条地铁线上的顶点

source: On line `8`: using the named parameter is `global => false`
sv: På rad `8`: att använda den namngivna parametern är `global => false`
zh_hans: 第 `8` 行：使用名为 `global => false` 的参数

source: From the results:
sv: Från resultaten:
zh_hans: 从结果来看：

source: making a connection from the first subway line :math:`\{1, 10, 11\}` to the second :math:`\{15, 16\}`:
sv: skapa en förbindelse från den första tunnelbanelinjen :math:`\{1, 10, 11\\}` till den andra :math:`\{15, 16\\}`:
zh_hans: 将第一条地铁线:math:`{1, 10, 11\}` 连接到第二条地铁线:math:`{15, 16\}`：

source: The best connections from all the stations from the first line are: :math:`{(1 \rightarrow 16) (10 \rightarrow 16) (11 \rightarrow 16)}`
sv: De bästa förbindelserna från alla stationer från den första linjen är: :math:`{(1 \rightarrow 16) (10 \rightarrow 16) (11 \rightarrow 16)}`
zh_hans: 从第一条线路的所有站点出发的最佳连接是： :math:`{(1 \rightarrow 16) (10 \rightarrow 16) (11 \rightarrow 16)}`

source: The best one is :math:`(11 \rightarrow 16)` with a cost of :math:`1` (lines: `11` and `12`)
sv: Den bästa är :math:`(11 \rightarrow 16)` med en kostnad på :math:`1` (rader: `11` och `12`)
zh_hans: 最好的方法是 :math:`(11/rightarrow 16)`，成本是 :math:`1`（行：`11`和`12`）

source: making a connection from the second subway line :math:`\{15, 16\}` to the first :math:`\{1, 10, 11\}`:
sv: skapa en förbindelse från den andra tunnelbanelinjen :math:`\{15, 16\\}` till den första :math:`\{1, 10, 11\\}`:
zh_hans: 将第二条地铁线:math:`{15, 16\}` 连接到第一条地铁线:math:`{1, 10, 11\}`：

source: The best connections from all the stations from the second line are: :math:`{(15 \rightarrow 10) (16 \rightarrow 11)}`
sv: De bästa förbindelserna från alla stationer från den andra linjen är: :math:`{(15 \rightarrow 10) (16 \rightarrow 11)}`
zh_hans: 从二号线所有站点出发的最佳连接是： :math:`{(15 ／rightarrow 10) (16 ／rightarrow 11)}`

source: Both are equally good as they have the same cost. (lines: `13` and `14` and lines: `15` and `16`)
sv: Båda är lika bra eftersom de har samma kostnad. (rader: `13` och `14` och rader: `15` och `16`)

source: Dijkstra optional parameters
sv: Dijkstra valfria parametrar
zh_hans: Dijkstra 可选参数

source: Near optional parameters
sv: Nära valfria parametrar
zh_hans: 接近可选参数

source: Find at most ``cap`` number of nearest shortest paths
sv: Hitta högst ``cap`` antal närmaste kortaste vägar
zh_hans: 查找最多 ``cap`` 条最近的最短路径

source: When ``true``: only ``cap`` limit results will be returned
sv: När ``true``: endast ``cap`` gränsresultat kommer att returneras
zh_hans: ``true``时：仅返回``cap``结果

source: When ``false``: ``cap`` limit per ``Start vid`` will be returned
sv: När ``false``: ``cap`` gräns per ``Start vid`` kommer att returneras
zh_hans: 当 ``false` 时：将返回每个 ``Start vid` 的 ``cap` 限值
