Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgRouting-concepts.po
Languages: es

source: **Supported versions:** `Latest <https://docs.pgrouting.org/latest/en/pgRouting-concepts.html>`__ (`3.2 <https://docs.pgrouting.org/3.2/en/pgRouting-concepts.html>`__) `3.1 <https://docs.pgrouting.org/3.1/en/pgRouting-concepts.html>`__ `3.0 <https://docs.pgrouting.org/3.0/en/pgRouting-concepts.html>`__
es: **Versions soportadas:** `Actual <https://docs.pgrouting.org/latest/en/pgRouting-concepts.html>`__ (`3.2 <https://docs.pgrouting.org/3.2/en/pgRouting-concepts.html>`__) `3.1 <https://docs.pgrouting.org/3.1/en/pgRouting-concepts.html>`__ `3.0 <https://docs.pgrouting.org/3.0/en/pgRouting-concepts.html>`__

source: **Unsupported versions:** `2.6 <https://docs.pgrouting.org/2.6/en/pgRouting-concepts.html>`__ `2.5 <https://docs.pgrouting.org/2.5/en/pgRouting-concepts.html>`__ `2.4 <https://docs.pgrouting.org/2.4/en/pgRouting-concepts.html>`__ `2.3 <https://docs.pgrouting.org/2.3/en/doc/src/tutorial/index.html>`__ `2.2 <https://docs.pgrouting.org/2.2/en/doc/src/tutorial/index.html>`__ `2.1 <https://docs.pgrouting.org/2.1/en/doc/src/tutorial/index.html>`__ `2.0 <https://docs.pgrouting.org/2.0/en/doc/src/tutorial/index.html>`__
es: **Versiones soportadas:** `2.6 <https://docs.pgrouting.org/2.6/en/pgRouting-concepts.html>`__ `2.5 <https://docs.pgrouting.org/2.5/en/pgRouting-concepts.html>`__ `2.4 <https://docs.pgrouting.org/2.4/en/pgRouting-concepts.html>`__ `2.3 <https://docs.pgrouting.org/2.3/en/doc/src/tutorial/index.html>`__ `2.2 <https://docs.pgrouting.org/2.2/en/doc/src/tutorial/index.html>`__ `2.1 <https://docs.pgrouting.org/2.1/en/doc/src/tutorial/index.html>`__ `2.0 <https://docs.pgrouting.org/2.0/en/doc/src/tutorial/index.html>`__

source: pgRouting Concepts
es: Conceptos de pgRouting

source: Contents
es: Contenido

source: Getting Started
es: Comenzando a trabajar

source: This is a simple guide to walk you through the steps of getting started with pgRouting. In this guide we will cover:
es: Esta es una guía simple para llevarte a través de los pasos básicos para trabajar con pgRouting. Esta guía cubre:

source: Create a routing Database
es: Crear una Base de Datos de Ruteo

source: The first thing we need to do is create a database and load pgrouting in the database. Typically you will create a database for each project. Once you have a database to work in, your can load your data and build your application in that database. This makes it easy to move your project later if you want to to say a production server.
es: Lo primero que hay que hacer es crear una base de datos y cargar pgRouting a la base de datos. Típicamente se creará una base de datos para cada proyecto. Una vez que se tiene una base de datos donde trabajar, se pueden cargar los datos y construir la aplicación en la base de datos. Esto hace que sea sencillo de mover el proyecto en el futuro, como por ejemplo, a un servidor de producción.

source: For Postgresql 9.2 and later versions
es: Para Postgresql 9.2 y versiones posteriores

source: Load Data
es: Cargar Datos

source: There are several ways to load your data into pgRouting. The most direct way is to load an Open Street Maps (OSM) dataset using **osm2pgrouting**. This is a tool, integrated in pgRouting project, that loads OSM data into postgresql with pgRouting requirements, including data structure and routing topology.
es: Hay varias maneras de cargar los datos en pgRouting. La forma más directa es cargar un dataset de Open Street Maps (OSM) utilizando **osm2pgrouting**. Esta es una herramienta, integrada en el proyecto pgRouting, que carga datos OSM en postgresql con requisitos pgRouting, incluida la estructura de datos y la topología de enrutamiento.

source: If you have other requirements, you can try various OpenSource tools that can help you, like:
es: Si tiene otros requisitos, puede probar varias herramientas de OpenSource que pueden ayudarle, como:

source: this is the postgresql shapefile loader
es: Este es un cargador de archivo shape a postgresql

source: this is a vector data conversion utility
es: Esta es una utilidad de conversión de datos vectoriales

source: this is a tool for loading OSM data into postgresql
es: Esta es una herramienta para cargar los datos de OSM a postgresql

source: Please note that these tools will not import the data in a structure compatible with pgRouting and you might need to adapt it.
es: Tenga en cuenta que estas herramientas no importarán los datos en una estructura compatible con pgRouting y es posible que deba adaptarlos.

source: These tools and probably others will allow you to read vector data so that you may then load that data into your database as a table of some kind. At this point you need to know a little about your data structure and content. One easy way to browse your new data table is with pgAdmin or phpPgAdmin.
es: Estas herramientas y probablemente otras le permitirán leer datos vectoriales para poder cargar esos datos en la base de datos como una tabla de algún tipo. En este punto necesita saber un poco sobre su estructura de datos y contenido. Una manera fácil de navegar por su nueva tabla de datos es con pgAdmin o phpPgAdmin.

source: Build a Routing Topology
es: Construir una Topología de Ruteo

source: this step is not needed if data is loaded with `osm2pgrouting`
es: este paso no es necesario si los datos se cargan con `osm2pgrouting`

source: Next we need to build a topology for our street data. What this means is that for any given edge in your street data the ends of that edge will be connected to a unique node and to other edges that are also connected to that same unique node. Once all the edges are connected to nodes we have a graph that can be used for routing with pgrouting. We provide a tool that will help with this:
es: A continuación, tenemos que construir una topología para nuestros datos de calle. Esto significa que para cualquier arista dada dentro de los datos de calle, los extremos de la arista se conectarán a un nodo único y a otras aristas que también están conectados a ese mismo nodo único. Una vez que todas las aristas están conectados a los nodos tenemos un grafo que se puede utilizar para el ruteo con pgRouting. Proporcionamos una herramienta que le ayudará con esto:

source: where you should replace 'myroads' with the name of your table storing the edges.
es: donde debe reemplazar 'myroads' con el nombre de su tabla almacenando los bordes.

source: Check the Routing Topology
es: Compruebe la Topología de Ruteo

source: There are lots of possible sources for errors in a graph. The data that you started with may not have been designed with routing in mind. A graph has some very specific requirements. One is that it is *NODED*, this means that except for some very specific use cases, each road segment starts and ends at a node and that in general is does not cross another road segment that it should be connected to.
es: Hay muchas fuentes posibles de errores en un grafo. Es posible que los datos con los que comenzó no se hayan diseñado teniendo en cuenta el ruteo. Un grafo tiene algunos requisitos muy específicos. Una es que es *NODED*, esto significa que, a excepción de algunos casos de usos muy específicos, cada segmento de carretera comienza y termina en un nodo y, en general, no cruza otro segmento de carretera al que debería estar conectado.

source: There can be other errors like the direction of a one-way street being entered in the wrong direction. We do not have tools to search for all possible errors but we have some basic tools that might help.
es: Puede haber otros errores como en una calle de un solo sentido tener el sentido equivocado. No contamos con herramientas para buscar todos los errores posibles, pero tenemos algunas herramientas básicas que pueden ayudar.

source: where you should replace 'myroads' with the name of your table storing the edges ('ways', in case you used osm2pgrouting to import the data).
es: donde debe reemplazar 'myroads' por el nombre de la tabla que almacena los bordes ('ways', en caso de que haya utilizado osm2pgrouting para importar los datos).

source: Compute a Path
es: Calcular una Ruta

source: Once you have all the preparation work done above, computing a route is fairly easy. We have a lot of different algorithms that can work with your prepared road network. The general form of a route query using Dijkstra algorithm is:
es: Una vez que tenga todo el trabajo de preparación realizado anteriormente, calcular una ruta es bastante fácil. Tenemos muchos algoritmos diferentes que pueden funcionar con su red de carreteras preparada. La forma general de una consulta de ruta mediante el algoritmo Dijkstra es:

source: This algorithm only requires *id*, *source*, *target* and *cost* as the minimal attributes, that by default will be considered to be columns in your roads table. If the column names in your roads table do not match exactly the names of these attributes, you can use aliases. For example, if you imported OSM data using **osm2pgrouting**, your id column's name would be *gid* and your roads table would be *ways*, so you would query a route from node id 1 to node id 2 by typing:
es: Este algoritmo solo requiere *id*, *source*, *target* y *cost* como los atributos mínimos, que de forma predeterminada se considerarán columnas en la tabla de caminos. Si los nombres de columna de la tabla de caminos no coinciden exactamente con los nombres de estos atributos, puede usar alias. Por ejemplo, si importara datos de OSM mediante **osm2pgrouting**, el nombre de la columna id sería *gid* y la tabla de caminos sería *ways*, por lo que consultaría una ruta del id 1 del nodo al id 2 del nodo escribiendo:

source: As you can see this is fairly straight forward and it also allows for great flexibility, both in terms of database structure and in defining cost functions. You can test the previous query using *length_m AS cost* to compute the shortest path in meters or *cost_s / 60 AS cost* to compute the fastest path in minutes.
es: Como puede ver, esto es bastante sencillo y también permite una gran flexibilidad, tanto en términos de estructura de base de datos como en la definición de funciones de coste. Puede probar la consulta anterior utilizando *length_m AS cost* para calcular la ruta de acceso más corta en metros o *cost_s / 60 AS cost* para calcular la ruta de acceso más rápida en minutos.

source: You can look and the specific algorithms for the details of the signatures and how to use them. These results have information like edge id and/or the node id along with the cost or geometry for the step in the path from *start* to *end*. Using the ids you can join these result back to your edge table to get more information about each step in the path.
es: Puede buscar y los algoritmos específicos para los detalles de las firmas y cómo utilizarlas. Estos resultados tienen información como el id de borde y/o el id del nodo junto con el costo o la geometría del paso en la ruta de acceso de *start* a *end*. Con los identificadores puede volver a unir estos resultados a la tabla perimetral para obtener más información sobre cada paso de la ruta de acceso.

source: Group of Functions
es: Grupo de Funciones

source: A function might have different overloads. Across this documentation, to indicate which overload we use the following terms:
es: Una función puede tener diferentes sobrecargas. A través de esta documentación, para indicar qué sobrecarga usamos los siguientes términos:

source: `One to One`_
es: `Uno a Uno`_

source: `One to Many`_
es: `Uno a Muchos`_

source: `Many to One`_
es: `Muchos a Uno`_

source: `Many to Many`_
es: `Muchos a Muchos`_

source: `Combinations`_
es: `Combinaciones`_

source: Depending on the overload are the parameters used, keeping consistency across all functions.
es: Dependiendo de la sobrecarga son los parámetros utilizados, manteniendo la coherencia en todas las funciones.

source: One to One
es: Uno a Uno

source: When routing from:
es: Cuando se rutea desde:

source: From **one** starting vertex
es: Desde el vértice inicial **one**

source: to **one** ending vertex
es: al vértice final **one**

source: One to Many
es: Uno a Muchos

source: to **many** ending vertices
es: a los vértices finales **many**

source: Many to One
es: Muchos a Uno

source: From **many** starting vertices
es: Desde vértices iniciales **many**

source: Many to Many
es: Muchos a Muchos

source: Combinations
es: Combinaciones

source: From **many** different starting vertices
es: A partir de **muchos** diferentes vértices de inicio

source: to **many** different ending vertices
es: a **muchos** diferentes vértices finales

source: Every tuple specifies a pair of a start vertex and an end vertex
es: Cada tupla especifica un par de vértices iniciales y un vértice final

source: Users can define the combinations as desired.
es: Los usuarios pueden definir las combinaciones como deseen.

source: Inner Queries
es: Consultas Internas

source: There are several kinds of valid inner queries and also the columns returned are depending of the function. Which kind of inner query will depend on the function(s) requirements. To simplify variety of types, ``ANY-INTEGER`` and ``ANY-NUMERICAL`` is used.
es: Hay varios tipos de consultas internas válidas y también las columnas devueltas dependen de la función. El tipo de consulta interna dependerá de los requisitos de las funcion(es). Para simplificar la variedad de tipos, se utiliza ``ANY-INTEGER`` y ``ANY-NUMERICAL``.

source: Where:
es: Donde:

source: Description of the edges_sql query for dijkstra like functions
es: Descripción de la consulta edges_sql para funciones similares a dijkstra

source: Column
es: Columna

source: Type
es: Tipo

source: Default
es: Valores predeterminados

source: Description
es: Descripción

source: Identifier of the edge.
es: Identificador de la arista.

source: **source**
es: **origen**

source: Identifier of the first end point vertex of the edge.
es: Identificador del primer punto final en el vértice de la arista.

source: **target**
es: **objetivo**

source: Identifier of the second end point vertex of the edge.
es: Identificador del segundo punto final en el vértice de la arista.

source: Weight of the edge `(source, target)`
es: Peso de la arista `(source, target)`

source: When negative: edge `(source, target)` does not exist, therefore it's not part of the graph.
es: Cuando es negativo: la arista `(source, target)` no existe, por lo tanto no es parte del grafo.

source: Weight of the edge `(target, source)`,
es: Peso de la arista `(target, source)`,

source: When negative: edge `(target, source)` does not exist, therefore it's not part of the graph.
es: En caso negativo: la arista `(target, source)` no existe, por lo tanto no es parte del grafo.

source: Description of the edges_sql query (id is not necessary)
es: Descripción de la consulta edges_sql (no es necesarioun id)

source: an SQL query, which should return a set of rows with the following columns:
es: Una consulta SQL, que debe regresar un conjunto de filas con las siguientes columnas:

source: Parameters
es: Parámetros

source: Parameter
es: Parámetro

source: SQL query as described above.
es: Consulta SQL como se describió anteriormente.

source: Array of ordered vertices identifiers that are going to be visited.
es: Arreglo de identificadores de vértices ordenados que serán visitados.

source: **directed**
es: **dirigido**

source: When ``true`` Graph is considered `Directed`
es: Cuando ``true`` el gráfo se considera `Dirigido`

source: When ``false`` the graph is considered as Undirected.
es: Cuando ``false`` el gráfico se considera como No Dirigido

source: When ``false`` ignores missing paths returning all paths found
es: En caso de ``false``, ignora las rutas faltantes y devuelve todas las rutas encontradas

source: When ``true`` if a path is missing stops and returns `EMPTY SET`
es: en caso de ``true`` si falta una ruta de acceso se detiene y devuelve `EMPTY SET`

source: When ``true`` departing from a visited vertex will not try to avoid using the edge used to reach it. In other words, U turn using the edge with same `id` is allowed.
es: En caso de ``true`` saliendo de un vértice visitado no intentará evitar el uso de la arista utilizada para alcanzarlo. En otras palabras, se permite el giro U utilizando la arista con el mismo 'id'.

source: When ``false`` when a departing from a visited vertex tries to avoid using the edge used to reach it. In other words, U turn using the edge with same `id` is used when no other path is found.
es: En caso de ``false`` cuando una salida de un vértice visitado intenta evitar el uso de la arista utilizada para alcanzarlo. En otras palabras, se utiliza el giro U utilizando el borde con el mismo `id` cuando no se encuentra ninguna otra ruta.

source: edges_sql query for :doc:`aStar-family` and :doc:`aStar-family` functions
es: consulta edges_sql para las funciones :doc:`aStar-family` y :doc:`aStar-family`

source: X coordinate of `source` vertex.
es: Coordenada X del vértice `source`.

source: Y coordinate of `source` vertex.
es: Coordenada Y del vértice `source`.

source: X coordinate of `target` vertex.
es: Coordenada X del vértice `objetivo`.

source: Y coordinate of `target` vertex.
es: Coordenada Y del vértice `target`.

source: For :doc:`pgr_pushRelabel <pgr_pushRelabel>`, :doc:`pgr_edmondsKarp <pgr_edmondsKarp>`, :doc:`pgr_boykovKolmogorov <pgr_boykovKolmogorov>` :
es: Para :doc:`pgr_pushRelabel <pgr_pushRelabel>`, :doc:`pgr_edmondsKarp <pgr_edmondsKarp>`, :doc:`pgr_boykovKolmogorov <pgr_boykovKolmogorov>` :

source: an SQL query of a directed graph of capacities, which should return a set of rows with the following columns:
es: Consulta SQL de un grafo dirigido de capacidades, que debe devolver un conjunto de filas con las siguientes columnas:

source: **capacity**
es: **capacidad**

source: **reverse_capacity**
es: **reverse_capacity** (**capacidad inversa**)

source: For :doc:`pgr_maxFlowMinCost` and :doc:`pgr_maxFlowMinCost_Cost`:
es: Para :doc:`pgr_maxFlowMinCost` and :doc:`pgr_maxFlowMinCost_Cost`:

source: Capacity of the edge `(source, target)`
es: Capacidad de la arista `(origen, destino)`

source: Capacity of the edge `(target, source)`,
es: Capacidad de la arista `(destino, origen)`,

source: Weight of the edge `(source, target)` if it exists.
es: Peso de la arista `(origen, destino)` si existe.

source: Weight of the edge `(target, source)` if it exists.
es: Peso de la arista `(destino, origen)` si existe.

source: Description of the Points SQL query
es: Descripción de la consulta SSQL de Puntos

source: (optional) Identifier of the point.
es: (opcional) Identificador del punto.

source: If column present, it can not be NULL.
es: Si la columna está presente, no puede ser NULL.

source: If column not present, a sequential identifier will be given automatically.
es: Si la columna no está presente, se proporcionará automáticamente un identificador secuencial.

source: Identifier of the "closest" edge to the point.
es: Identificador de la arista "más cercano" al punto.

source: Value in <0,1> that indicates the relative postition from the first end point of the edge.
es: El valor en <0,1> que indica la posición relativa desde el primer punto final de la arista.

source: (optional) Value in ['b', 'r', 'l', NULL] indicating if the point is:
es: (opcional) Valor en ['b', 'r', 'l', NULL] que indica si el punto es:

source: In the right, left of the edge or
es: A la derecha, a la izquierda del borde o

source: If it doesn't matter with 'b' or NULL.
es: Si no importa con 'b' o NULL.

source: If column not present 'b' is considered.
es: Si la columna no presente 'b' es considerada

source: Description of the combinations_sql query for dijkstra like functions
es: Descripción de la consulta de combinaciones_sql para funciones similares a dijkstra

source: Return columns & values
es: Devolución de columnas y valores

source: There are several kinds of columns returned are depending of the function.
es: Hay varios tipos de columnas devueltas que dependen de la función.

source: Return values for a path
es: Valores devueltos para una ruta

source: Returns set of ``(seq, path_seq [, start_vid] [, end_vid], node, edge, cost, agg_cost)``
es: Devuelve el conjunto de ``(seq, path_seq [, start_vid] [, end_vid], node, edge, cost, agg_cost)``

source: Sequential value starting from **1**.
es: Valor secuencial a partir de **1**.

source: Relative position in the path. Has value **1** for the beginning of a path.
es: Posición relativa en la ruta. Tiene el valor **1** para el principio de una ruta.

source: Identifier of the starting vertex. Returned when multiple starting vetrices are in the query.
es: Identificador del vértice inicial. Se devuelve cuando hay varias vetrices iniciales en la consulta.

source: Identifier of the ending vertex. Returned when multiple ending vertices are in the query.
es: Identificador del vértice final. Se devuelve cuando hay varios vértices finales en la consulta.

source: Identifier of the node in the path from ``start_vid`` to ``end_vid``.
es: Identificador del nodo en la ruta de ``start_vid`` a ``end_vid``.

source: Identifier of the edge used to go from ``node`` to the next node in the path sequence. ``-1`` for the last node of the path.
es: Identificador del borde utilizado para ir del ``nodo`` al siguiente nodo de la secuencia de ruta. ``-1`` para el último nodo de la ruta.

source: Cost to traverse from ``node`` using ``edge`` to the next node in the path sequence.
es: Costo de desplazamiento desde ``node`` usando `` edge`` hasta el siguiente nodo en la secuencia de ruta.

source: Aggregate cost from ``start_v`` to ``node``.
es: Coste agregado de ``start_v`` to ``node``.

source: Return values for multiple paths from the same source and destination
es: Valores devueltos para varias rutas desde el mismo origen y destino

source: Returns set of ``(seq, path_id, path_seq [, start_vid] [, end_vid], node, edge, cost, agg_cost)``
es: Devuelve el conjunto de ``(seq, path_id, path_seq [, start_vid] [, end_vid], node, edge, cost, agg_cost)``

source: Path identifier. Has value **1** for the first of a path. Used when there are multiple paths for the same ``start_vid`` to ``end_vid`` combination.
es: Identificador de ruta. Tiene el valor **1** para el primero de una ruta. Se utiliza cuando hay varias rutas para la misma combinación de ``start_vid`` a ``end_vid``.

source: Description of the return values for a :doc:`costMatrix-category` function
es: Descripción de los valores devueltos para una función :doc:`costMatrix-category`

source: Returns SET OF ``(start_vid, end_vid, agg_cost)``
es: Devuelve SET OF ``(start_vid, end_vid, agg_cost)``

source: Identifier of the starting vertex.
es: Identificador del vértice inicial.

source: Identifier of the ending vertex.
es: Identificador del vértice final.

source: Aggregate cost from ``start_vid`` to ``end_vid``.
es: Coste agregado de ``start_vid`` a ``end_vid``.

source: Description of the Return Values
es: Descripción de los valores devueltos

source: Identifier of the edge in the original query(edges_sql).
es: Identificador de la arista en la consulta original(edges_sql).

source: **flow**
es: **flujo**

source: Flow through the edge in the direction (``start_vid``, ``end_vid``).
es: Flujo a través del arista en la dirección (``start_vid``, ``end_vid``).

source: **residual_capacity**
es: **residual_capacity** (**capacidad residual**)

source: Residual capacity of the edge in the direction (``start_vid``, ``end_vid``).
es: Capacidad residual del arista en la dirección (``start_vid``, ``end_vid``).

source: For :doc:`pgr_maxFlowMinCost`
es: Para :doc:`pgr_maxFlowMinCost`

source: Flow through the edge in the direction (source, target).
es: Flujo a través de la arista en la dirección (origen, destino).
