Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: ``bigint`` Identifier of the vertex.
zh_hans: ``bigint``顶点的标识符。

source: ``integer`` Number of vertices in the edge_table that reference this vertex.
zh_hans: ``integer``edge_table 中引用该顶点的顶点数。

source: ``integer`` Indicator that the vertex might have a problem.
zh_hans: ``integer``指示顶点可能有问题。

source: ``integer`` Number of vertices in the edge_table that reference this vertex as incoming. See :doc:`pgr_analyzeOneWay <pgr_analyzeOneWay>`.
zh_hans: ``integer``edge_table 中引用该顶点作为传入的顶点数。 请参阅 :doc:`pgr_analyzeOneWay <pgr_analyzeOneWay>`。

source: ``integer`` Number of vertices in the edge_table that reference this vertex as outgoing. See :doc:`pgr_analyzeOneWay <pgr_analyzeOneWay>`.
zh_hans: ``integer``Edge_table 中引用该顶点作为传出的顶点数。 请参阅 :doc:`pgr_analyzeOneWay <pgr_analyzeOneWay>`。

source: ``geometry`` Point geometry of the vertex.
zh_hans: ``geometry``顶点的点几何。

source: Usage when the edge table's columns MATCH the default values:
zh_hans: 当边表的列与默认值匹配时的用法：

source: The simplest way to use pgr_analyzeGraph is:
zh_hans: 使用 pgr_analyzeGraph 最简单的方法是：

source: Arguments are given in the order described in the parameters:
zh_hans: 参数按照参数中描述的顺序给出：

source: We get the same result as the simplest way to use the function.
zh_hans: 我们得到与使用该函数的最简单方法相同的结果。

source: An error would occur when
zh_hans: 错误将会发生，当

source: the arguments are not given in the appropriate order:
zh_hans: 参数未按适当的顺序给出：

source: In this example, the column ``id`` of the table ``mytable`` is passed to the function as the geometry column, and the geometry column ``the_geom`` is passed to the function as the id column.
zh_hans: 在此示例中，表 ``mytable``的列 ``id`` 作为几何列传递给函数，几何列 ``the_geom`` 作为 id 列传递给函数。

source: When using the named notation
zh_hans: 当使用命名符号时

source: The order of the parameters do not matter:
zh_hans: 参数的顺序并不重要：

source: Parameters defined with a default value can be omitted, as long as the value matches the default:
zh_hans: 定义有默认值的参数可以省略，只要该值与默认值匹配即可：

source: Selecting rows using rows_where parameter
zh_hans: 使用 rows_where 参数选择行

source: Selecting rows based on the id. Displays the analysis a the section of the network.
zh_hans: 根据 id 选择行。 显示网络部分的分析。

source: Selecting the rows where the geometry is near the geometry of row with ``id`` = 5
zh_hans: 选择几何形状接近``id``= 5 的几何形状的行

source: Selecting the rows where the geometry is near the geometry of the row with ``gid`` =100 of the table ``othertable``.
zh_hans: 选择几何形状接近表``othertable`` 的``gid`` = 100 的行的几何形状的行。

source: Usage when the edge table's columns DO NOT MATCH the default values:
zh_hans: 当边表的列与默认值不匹配时的用法：

source: For the following table
zh_hans: 对于下表

source: Using positional notation:
zh_hans: 使用位置符号：

source: The arguments need to be given in the order described in the parameters:
zh_hans: 参数需要按照参数中描述的顺序给出：

source: An error would occur when the arguments are not given in the appropriate order: In this example, the column ``gid`` of the table ``mytable`` is passed to the function as the geometry column, and the geometry column ``mygeom`` is passed to the function as the id column.
zh_hans: 如果未按适当的顺序给出参数，则会发生错误：在此示例中，表 ``mytable`` 的列 ``gid``作为几何列传递给函数，几何列 ``mygeom`` 作为 id 列传递给函数 。

source: In this scenario omitting a parameter would create an error because the default values for the column names do not match the column names of the table.
zh_hans: 在这种情况下，省略参数会产生错误，因为列名的默认值与表的列名不匹配。

source: Selecting rows based on the id.
zh_hans: 根据 id 选择行。

source: Selecting the rows WHERE the geometry is near the geometry of row with ``id`` =5 .
zh_hans: 选择那些几何与具有``id`` = 5的行的几何接近的行。

source: Selecting the rows WHERE the geometry is near the place='myhouse' of the table ``othertable``. (note the use of quote_literal)
zh_hans: 选择几何图形靠近表``othertable``的 place='myhouse' 的行。 （注意 quote_literal 的使用）

source: The examples use the :doc:`sampledata` network.
zh_hans: 这些示例使用 :doc:`示例数据`网络。

source: :doc:`pgr_nodeNetwork` to create nodes to a not noded edge table.
zh_hans: :doc:`pgr_nodeNetwork`创建节点到非节点边表。

source: ``pgr_analyzeOneWay`` — Analyzes oneway Sstreets and identifies flipped segments.
zh_hans: ``pgr_analyzeOneWay`` — 分析单向街道并识别翻转路段。

source: This function analyzes oneway streets in a graph and identifies any flipped segments.
zh_hans: 该函数分析图中的单向街道并识别任何翻转的路段。

source: The analyses of one way segments is pretty simple but can be a powerful tools to identifying some the potential problems created by setting the direction of a segment the wrong way. A node is a `source` if it has edges the exit from that node and no edges enter that node. Conversely, a node is a `sink` if all edges enter the node but none exit that node. For a `source` type node it is logically impossible to exist because no vehicle can exit the node if no vehicle and enter the node. Likewise, if you had a `sink` node you would have an infinite number of vehicle piling up on this node because you can enter it but not leave it.
zh_hans: 单向路段的分析非常简单，但可以成为一种强大的工具，可以识别由于错误地设置路段方向而产生的一些潜在问题。 如果一个节点有从该节点出口的边并且没有边进入该节点，则该节点是`source` 。 相反，如果所有边都进入该节点但没有一条边退出该节点，则该节点是`sink`。 对于`source` 类型节点来说，逻辑上不可能存在，因为如果没有车辆进入该节点，则任何车辆都无法离开该节点。 同样，如果您有一个`sink`节点，那么您将在该节点上堆积无限数量的车辆，因为您可以进入它但不能离开它。

source: So why do we care if the are not feasible? Well if the direction of an edge was reversed by mistake we could generate exactly these conditions. Think about a divided highway and on the north bound lane one segment got entered wrong or maybe a sequence of multiple segments got entered wrong or maybe this happened on a round-about. The result would be potentially a `source` and/or a `sink` node.
zh_hans: 那么我们为什么要关心这些是否不可行呢？ 如果边的方向被错误地反转，我们就可以准确地生成这些条件。 想象一下一条分开的高速公路，在北行车道上，有一个路段输入错误，或者可能是一系列多个路段输入错误，或者这可能发生在环岛上。 结果可能是 `source` 节点和/或`sink`节点。

source: So by counting the number of edges entering and exiting each node we can identify both `source` and `sink` nodes so that you can look at those areas of your network to make repairs and/or report the problem back to your data vendor.
zh_hans: 因此，通过计算进入和退出每个节点的边数，我们可以识别 `source`节点和`sink`节点，以便您可以查看网络的这些区域以进行修复和/或将问题报告给数据供应商。

source: ``text[]`` source node **in** rules
zh_hans: ``text[]``source节点**输入**规则

source: ``text[]`` source node **out** rules
zh_hans: ``text[]``source节点**输出**规则

source: ``text[]`` target node **in** rules
zh_hans: ``text[]``target节点**输入**规则

source: ``text[]`` target node **out** rules
zh_hans: ``text[]``target节点**输出**规则

source: ``text`` oneway column name name of the network table. Default value is ``oneway``.
zh_hans: ``text``oneway 列名，网络表的名称。 默认值为``oneway``。

source: ``boolean`` flag to treat oneway NULL values as bi-directional. Default value is ``true``.
zh_hans: ``boolean``将单向 NULL 值视为双向的标志。 默认值为 ``true``。

source: It is strongly recommended to use the named notation. See :doc:`pgr_createVerticesTable` or :doc:`pgr_createTopology` for examples.
zh_hans: 强烈建议使用命名符号。 有关示例，请参阅 :doc:`pgr_createVerticesTable` 或 :doc:`pgr_createTopology`。

source: Fills completely the ``ein`` and ``eout`` columns of the vertices table.
zh_hans: 完全填充顶点表的 ``ein``和 ``eout`` 列。

source: The names of source , target or oneway are the same.
zh_hans: source 、 target 或 oneway 的名称相同。

source: The rules are defined as an array of text strings that if match the ``oneway`` value would be counted as ``true`` for the source or target **in** or **out** condition.
zh_hans: 这些规则被定义为文本字符串数组，如果与 ``oneway``值匹配，则 source或 target**输入**或**输出**条件将被视为``true``。

source: The vertices table can be created with :doc:`pgr_createVerticesTable` or :doc:`pgr_createTopology`
zh_hans: 顶点表可以使用 :doc:`pgr_createVerticesTable` 或 :doc:`pgr_createTopology`创建

source: ``integer`` Number of vertices in the edge_table that reference this vertex. See :doc:`pgr_analyzeGgraph <pgr_analyzeGraph>`.
zh_hans: ``integer``edge_table 中引用该顶点的顶点数。 请参阅 :doc:`pgr_analyzeGgraph <pgr_analyzeGraph>`。

source: ``integer`` Indicator that the vertex might have a problem. See :doc:`pgr_analyzeGraph <pgr_analyzeGraph>`.
zh_hans: ``integer``指示顶点可能有问题。 请参阅 :doc:`pgr_analyzeGraph <pgr_analyzeGraph>`。

source: ``integer`` Number of vertices in the edge_table that reference this vertex as incoming.
zh_hans: ``integer``edge_table 中引用该顶点作为传入的顶点数。

source: ``integer`` Number of vertices in the edge_table that reference this vertex as outgoing.
zh_hans: ``integer``Edge_table 中引用该顶点作为传出的顶点数。

source: Return columns change: ``seq`` is removed
zh_hans: 返回列更改：``seq``被删除

source: Version 2.5.0
zh_hans: 版本2.5.0

source: Boost: `Biconnected components & articulation points <https://www.boost.org/libs/graph/doc/biconnected_components.html>`__
zh_hans: Boost: `双连通分量和关节点 <https://www.boost.org/libs/graph/doc/biconnected_components.html>`__

source: ``pgr_bdAstar`` (`One to One`_) added ``start_vid`` and ``end_vid`` columns.
zh_hans: ``pgr_bdAstar`` (`一对一`_) 增加``start_vid`` 和 ``end_vid``列。

source: ``pgr_bdAstar`` (`One to Many`_) added ``end_vid`` column.
zh_hans: ``pgr_bdAstar`` (`一对多`_) 增加``end_vid`` 列。

source: ``pgr_bdAstar`` (`Many to One`_) added ``start_vid`` column.
zh_hans: ``pgr_bdAstar`` (`多对一`_) 增加``start_vid``列。

source: ``pgr_bdAstar`` (`Combinations`_)
zh_hans: ``pgr_bdAstar`` (`组合`_)

source: ``pgr_bdAstar`` (`One to Many`_)
zh_hans: ``pgr_bdAstar`` (`一对多`_)

source: ``pgr_bdAstar`` (`Many to One`_)
zh_hans: ``pgr_bdAstar`` (`多对一`_)

source: ``pgr_bdAstar`` (`Many to Many`_)
zh_hans: ``pgr_bdAstar`` (`多对多`_)

source: Signature change on ``pgr_bdAstar`` (`One to One`_)
zh_hans: 在``pgr_bdAstar`` (`一对一`_)上的签名更改

source: **Official** ``pgr_bdAstar`` (`One to One`_)
zh_hans: **官方**``pgr_bdAstar`` (`一对一`_)

source: The results are equivalent to the union of the results of the `pgr_bdAStar(` `One to One`_ `)` on the:
zh_hans: 结果相当于`pgr_bdAStar(` `一对一`_ `)` 结果的并集：

source: `pgr_bdAstar(` `One to Many`_ `)`
zh_hans: `pgr_bdAstar(` `一对多`_ `)`

source: `pgr_bdAstar(` `Many to One`_ `)`
zh_hans: `pgr_bdAstar(` `多对一`_ `)`

source: `pgr_bdAstar(` `Many to Many`_ `)`
zh_hans: `pgr_bdAstar(` `多对多`_ `)`

source: `pgr_bdAstar(` `Combinations`_ `)`
zh_hans: `pgr_bdAstar(` `组合`_ `)`

source: ``pgr_bdAstarCost`` - Total cost of the shortest path(s) using the bidirectional A* algorithm.
zh_hans: ``pgr_bdAstarCost`` -使用双向 A* 算法的最短路径的总成本。

source: ``pgr_bdAstarCost`` (`Combinations`_)
zh_hans: ``pgr_bdAstarCost`` (`组合`_)

source: The ``pgr_bdAstarCost`` function sumarizes of the cost of the shortest path(s) using the bidirectional A* algorithm.
zh_hans: ``pgr_bdAstarCost``函数使用双向 A* 算法汇总最短路径的成本。

source: Using internaly the :doc:`pgr_bdAstar` algorithm
zh_hans: 内部使用 :doc:`pgr_bdAstar` 算法

source: ``pgr_bdDijkstra`` — Returns the shortest path(s) using Bidirectional Dijkstra algorithm.
zh_hans: ``pgr_bdDijkstra`` — 使用双向 Dijkstra 算法返回最短路径。

source: pgr_bdDijkstra(`Combinations`_)
zh_hans: pgr_bdDijkstra(`组合`_)

source: New **Proposed** functions:
zh_hans: 新**拟议**函数：

source: ``pgr_bdDijkstra`` (`One to Many`_)
zh_hans: ``pgr_bdDijkstra`` (`一对多`_)

source: ``pgr_bdDijkstra`` (`Many to One`_)
zh_hans: ``pgr_bdDijkstra`` (`多对一`_)

source: ``pgr_bdDijkstra`` (`Many to Many`_)
zh_hans: ``pgr_bdDijkstra`` (`多对多`_)

source: Signature change on ``pgr_bdDijsktra`` (`One to One`_)
zh_hans: ``pgr_bdDijsktra`` (`一对一`_)上的签名更改

source: **Official** ``pgr_bdDijkstra`` (`One to One`_)
zh_hans: **官方** ``pgr_bdDijkstra`` (`一对一`_)

source: ``pgr_bdDijkstraCost`` — Returns the shortest path(s)'s cost using Bidirectional Dijkstra algorithm.
zh_hans: ``pgr_bdDijkstraCost`` — 使用双向 Dijkstra 算法返回最短路径的成本。

source: ``pgr_bdDijkstraCost`` (`Combinations`_)
zh_hans: ``pgr_bdDijkstraCost`` (`组合`_)

source: The ``pgr_bdDijkstraCost`` function sumarizes of the cost of the shortest path using the bidirectional Dijkstra Algorithm.
zh_hans: ``pgr_bdDijkstraCost`` 函数使用双向 Dijkstra 算法汇总最短路径的成本。

source: ``pgr_bellmanFord`` — Shortest path(s) using Bellman-Ford algorithm.
zh_hans: ``pgr_bellmanFord`` — 使用 Bellman-Ford 算法的最短路径。

source: New **experimental** signature:
zh_hans: 新**实验性**签名：

source: ``pgr_bellmanFord`` (`Combinations`_)
zh_hans: ``pgr_bellmanFord`` (`组合`_)

source: New **experimental** signatures:
zh_hans: 新**实验**签名：

source: ``pgr_bellmanFord`` (`One to One`_)
zh_hans: ``pgr_bellmanFord`` (`一对一`_)

source: ``pgr_bellmanFord`` (`One to Many`_)
zh_hans: ``pgr_bellmanFord`` (`一对多`_)

source: ``pgr_bellmanFord`` (`Many to One`_)
zh_hans: ``pgr_bellmanFord`` (`多对一`_)

source: ``pgr_bellmanFord`` (`Many to Many`_)
zh_hans: ``pgr_bellmanFord`` (`多对多`_)

source: From vertex :math:`6` to vertices :math:`\{ 10, 17\}` on a **directed** graph
zh_hans: 在**有向**图上从顶点 :math:`6` 到顶点 :math:`\{ 10, 17\}`

source: Return columns change:
zh_hans: 返回列更改：

source: Boost: `Biconnected components <https://www.boost.org/libs/graph/doc/biconnected_components.html>`__
zh_hans: Boost: `双连通分量<https://www.boost.org/libs/graph/doc/biconnected_components.html>`__

source: ``pgr_binaryBreadthFirstSearch`` — Returns the shortest path(s) in a binary graph.
zh_hans: ``pgr_binaryBreadthFirstSearch`` — 返回二元图中的最短路径。

source: pgr_binaryBreadthFirstSearch(`Combinations`_)
zh_hans: pgr_binaryBreadthFirstSearch(`组合`_)

source: pgr_binaryBreadthFirstSearch(`One to One`_)
zh_hans: pgr_binaryBreadthFirstSearch(`一对一`_)

source: pgr_binaryBreadthFirstSearch(`One to Many`_)
zh_hans: pgr_binaryBreadthFirstSearch(`一对多`_)

source: pgr_binaryBreadthFirstSearch(`Many to One`_)
zh_hans: pgr_binaryBreadthFirstSearch(`多对一`_)

source: pgr_binaryBreadthFirstSearch(`Many to Many`_)
zh_hans: pgr_binaryBreadthFirstSearch(`多对多`_)

source: It is well-known that the shortest paths between a single source and all other vertices can be found using Breadth First Search in :math:`O(|E|)` in an unweighted graph, i.e. the distance is the minimal number of edges that you need to traverse from the source to another vertex. We can interpret such a graph also as a weighted graph, where every edge has the weight :math:`1`. If not alledges in graph have the same weight, that we need a more general algorithm, like Dijkstra's Algorithm which runs in :math:`O(|E|log|V|)` time.
zh_hans: 众所周知，在无权图中，可以使用广度优先搜索（Breadth First Search）找到从单一源点到所有其他顶点的最短路径，其时间复杂度为 :math:`O(|E|)`，其中 |E| 表示图中的边数。也就是说，这里的距离是指从源点到另一个顶点所需穿越的最小边数。我们也可以将这样的图解释为一个带权图，其中每条边的权重都为 :math:`1`。如果图中的边不都具有相同的权重，那么我们就需要使用更通用的算法，比如Dijkstra算法，它的时间复杂度为 :math:`O(|E|log|V|)`，其中 |E| 表示图中的边数，|V| 表示图中的顶点数。

source: Optional Parameters
zh_hans: 可选参数

source: pgr_bipartite -Experimental
zh_hans: pgr_bipartite -实验

source: New **experimental** signature
zh_hans: 新的**实验**签名

source: The algorithm checks graph is bipartite or not. If it is bipartite then it returns the node along with two colors `0` and `1` which represents two different sets.
zh_hans: 该算法检查图是否是二分图。如果是二分图，它将返回节点以及分别代表两个不同集合的两种颜色，分别为 `0` 和 `1`。

source: New **proposed** signature
zh_hans: 新的**拟议**签名

source: ``pgr_boykovKolmogorov`` (`Combinations`_)
zh_hans: ``pgr_boykovKolmogorov`` (`组合`_)

source: **Proposed** function
zh_hans: **拟议**函数

source: New **Experimental** function
zh_hans: 新的**实验**函数

source: ``pgr_breadthFirstSearch`` (`Single Vertex`_)
zh_hans: ``pgr_breadthFirstSearch`` (`单个顶点`_)

source: ``pgr_breadthFirstSearch`` (`Multiple Vertices`_)
zh_hans: ``pgr_breadthFirstSearch`` (`多个顶点`_)

source: `Boost: Breadth First Search algorithm documentation <https://www.boost.org/libs/graph/doc/breadth_first_search.html>`__
zh_hans: `Boost: 广度优先搜索算法文档 <https://www.boost.org/libs/graph/doc/breadth_first_search.html>`__

source: **Supported versions**
zh_hans: **支持版本**

source: Boost: `Connected components <https://www.boost.org/libs/graph/doc/connected_components.html>`__
zh_hans: Boost: `连接组件 <https://www.boost.org/libs/graph/doc/connected_components.html>`__

source: Does not return the full contracted graph
zh_hans: 不返回完整的收缩图

source: Only changes on the graph are returned
zh_hans: 仅返回图上的更改

source: Currnetly there are two types of contraction methods
zh_hans: 目前有两种类型的收缩方法

source: Dead End Contraction
zh_hans: 死端收缩

source: Linear Contraction
zh_hans: 线性收缩

source: The returned values include
zh_hans: 返回值包括

source: the added edges by linear contraction.
zh_hans: 由线性收缩添加的边。

source: the modified vertices by dead end contraction.
zh_hans: 通过死端收缩修改顶点。

source: column ``id`` ascending when type is ``v``
zh_hans: 当类型为 ``v``时，按列 ``id`` 升序

source: column ``id`` descending when type is ``e``
zh_hans: 当类型为 ``e`` 时，按列``id``降序

source: The pgr_contraction function has the following signature:
zh_hans: pgr_contraction 函数具有以下签名：

source: Making a dead end and linear contraction in that order on an undirected graph.
zh_hans: 在无向图上按顺序进行死端和线性收缩。

source: Returns set of |result-contract|
zh_hans: 返回集合 |result-contract|

source: ``pgr_createTopology`` — Builds a network topology based on the geometry information.
zh_hans: ``pgr_createTopology`` — 根据几何信息构建网络拓扑。

source: ``OK`` after the network topology has been built and the vertices table created.
zh_hans: ``OK``在网络拓扑建立完成并且顶点表创建后。

source: ``FAIL`` when the network topology was not built due to an error.
zh_hans: ``FAIL``当由于错误原因未能构建网络拓扑时。

source: The topology creation function accepts the following parameters:
zh_hans: 拓扑创建函数接受以下参数：

source: ``text`` Condition to SELECT a subset or rows. Default value is ``true`` to indicate all rows that where ``source`` or ``target`` have a null value, otherwise the condition is used.
zh_hans: ``text`` 用于选择一组行的条件。默认值为 ``true``，表示选择所有具有空值的 ``source`` 或 ``target`` 的行，否则将使用条件。

source: ``boolean`` Clean any previous topology. Default value is ``false``.
zh_hans: ``boolean`` 清除任何先前的拓扑信息。默认值为 ``false``。

source: The ``edge_table`` will be affected
zh_hans: ``edge_table`` 将受到影响

source: The ``source`` column values will change.
zh_hans: ``source`` 列的值将发生改变。

source: The ``target`` column values will change.
zh_hans: ``target``列的值将发生改变。

source: An index will be created, if it doesn't exists, to speed up the process to the following columns:
zh_hans: 如果索引不存在，则会创建一个索引，以加快以下列的处理速度：

source: ``OK`` after the network topology has been built.
zh_hans: ``OK``在网络拓扑建立完成后。

source: Creates a vertices table: <edge_table>_vertices_pgr.
zh_hans: 创建一个顶点表：<edge_table>_vertices_pgr。

source: Fills ``id`` and ``the_geom`` columns of the vertices table.
zh_hans: 填充顶点表的``id`` 和 ``the_geom`` 列。

source: Fills the source and target columns of the edge table referencing the ``id`` of the vertices table.
zh_hans: 引用顶点表的``id``填充边表的 source列和target列。

source: ``FAIL`` when the network topology was not built due to an error:
zh_hans: ``FAIL``当由于错误原因未能构建网络拓扑时：

source: The vertices table is a requirement of the :doc:`pgr_analyzeGraph` and the :doc:`pgr_analyzeOneWay` functions.
zh_hans: 顶点表是 :doc:`pgr_analyzeGraph` 和 :doc:`pgr_analyzeOneWay`函数的必需条件。

source: ``integer`` Number of vertices in the edge_table that reference this vertex. See :doc:`pgr_analyzeGraph`.
zh_hans: ``integer``edge_table 中引用该顶点的顶点数。 参见:doc:`pgr_analyzeGraph`。

source: ``integer`` Indicator that the vertex might have a problem. See :doc:`pgr_analyzeGraph`.
zh_hans: ``integer`` 表示该顶点可能存在问题的指标。请参阅 :doc:`pgr_analyzeGraph`。

source: ``integer`` Number of vertices in the edge_table that reference this vertex AS incoming. See :doc:`pgr_analyzeOneWay`.
zh_hans: ``integer``边表中引用此顶点作为入边的顶点数量。请参考 :doc:`pgr_analyzeOneWay`。

source: ``integer`` Number of vertices in the edge_table that reference this vertex AS outgoing. See :doc:`pgr_analyzeOneWay`.
zh_hans: ``integer``边表中引用此顶点作为出边的顶点数量。请参考 :doc:`pgr_analyzeOneWay`。

source: The simplest way to use pgr_createTopology is:
zh_hans: 使用 pgr_createTopology 最简单的方法是：

source: An error would occur when the arguments are not given in the appropriate order: In this example, the column ``id`` of the table ``ege_table`` is passed to the function as the geometry column, and the geometry column ``the_geom`` is passed to the function as the id column.
zh_hans: 当参数未按适当顺序给出时会导致错误：在此示例中，表格 ``ege_table`` 的列``id`` 被错误地传递给函数作为几何列，而几何列 ``the_geom``被错误地传递给函数作为 id 列。

source: Parameters defined with a default value can be omitted, as long as the value matches the default And The order of the parameters would not matter.
zh_hans: 定义有默认值的参数可以省略，只要该值与默认值匹配并且参数的顺序无关紧要。

source: Selecting the rows where the geometry is near the geometry of row with ``id = 5``.
zh_hans: 选择与具有 ``id = 5`` 的行的几何图形接近的行。

source: The arguments need to be given in the order described in the parameters.
zh_hans: 参数需要按照参数中描述的顺序给出。

source: Note that this example uses clean flag. So it recreates the whole vertices table.
zh_hans: 请注意，此示例使用 clean 标志。 所以它重新创建了整个顶点表。

source: An error would occur when the arguments are not given in the appropiriate order: In this example, the column ``gid`` of the table ``mytable`` is passed to the function AS the geometry column, and the geometry column ``mygeom`` is passed to the function AS the id column.
zh_hans: 当参数未按适当的顺序给出时，会导致错误。在这个示例中，表``mytable``的列 ``gid`` 被错误地传递给函数作为几何列，而几何列``mygeom`` 被错误地传递给函数作为 id 列。

source: In this scenario omitting a parameter would create an error because the default values for the column names do not match the column names of the table. The order of the parameters do not matter:
zh_hans: 在这种情况下，省略参数会产生错误，因为列名的默认值与表的列名不匹配。 参数的顺序并不重要：

source: Based on id:
zh_hans: 基于id：

source: An alternate method to create a routing topology use :doc:`pgr_extractVertices`
zh_hans: 使用 :doc:`pgr_extractVertices`创建路由拓扑的替代方法

source: With full output
zh_hans: 带有完整输出

source: This example start a clean topology, with 5 edges, and then its incremented to the rest of the edges.
zh_hans: 这个例子开始一个干净的拓扑结构，包括 5 条边，然后将其逐渐扩展到其余的边。

source: The example uses the :doc:`sampledata` network.
zh_hans: 本例使用 :doc:`sampledata` 网络。

source: ``pgr_createVerticesTable`` — Reconstructs the vertices table based on the source and target information.
zh_hans: ``pgr_createVerticesTable`` — 根据 source和target信息重建顶点表。

source: ``OK`` after the vertices table has been reconstructed.
zh_hans: ``OK``重建顶点表后。

source: ``FAIL`` when the vertices table was not reconstructed due to an error.
zh_hans: ``FAIL``当由于错误而未重建顶点表时。

source: The reconstruction of the vertices table function accepts the following parameters:
zh_hans: 顶点表的重建函数接受以下参数：

source: ``text`` Condition to SELECT a subset or rows. Default value is ``true`` to indicate all rows.
zh_hans: ``text`` 用于选择行的子集的条件。默认值为 ``true``，表示选择所有行。

source: Fills ``id`` and ``the_geom`` columns of the vertices table based on the source and target columns of the edge table.
zh_hans: 根据边表的源点（source）和目标点（target）列，填充顶点表的``id``和``the_geom``列。

source: The names of source, target are the same.
zh_hans: source, target的名称相同。

source: ``integer`` Number of vertices in the edge_table that reference this vertex as incoming. See :doc:`pgr_analyzeOneWay`.
zh_hans: ``integer``edge_table 中引用该顶点作为传入的顶点数。 请参阅 :doc:`pgr_analyzeOneWay`。

source: ``integer`` Number of vertices in the edge_table that reference this vertex as outgoing. See :doc:`pgr_analyzeOneWay`.
zh_hans: ``integer``Edge_table 中引用该顶点作为传出的顶点数。 请参阅 :doc:`pgr_analyzeOneWay`。

source: The simplest way to use pgr_createVerticesTable
zh_hans: 使用 pgr_createVerticesTable 最简单的方法

source: When the arguments are given in the order described in the parameters:
zh_hans: 当参数按照参数中描述的顺序给出时：

source: An error would occur when the arguments are not given in the appropriate order: In this example, the column source column ``source`` of the table ``mytable`` is passed to the function as the geometry column, and the geometry column ``the_geom`` is passed to the function as the source column.
zh_hans: 当参数没有按照适当的顺序提供时，将会发生错误：在这个例子中，表``mytable``的源列``source``被错误地传递给函数作为几何列，而几何列``the_geom``被错误地传递给函数作为源列。

source: Example 4
zh_hans: 示例4

source: Using a different ordering
zh_hans: 使用不同的排序

source: Example 5
zh_hans: 示例5

source: Example 6
zh_hans: 示例6

source: Example 7
zh_hans: 示例7

source: Selecting the rows where the geometry is near the geometry of row with ``id`` =5 .
zh_hans: 选择几何与具有``id``=5的行的几何接近的行。

source: Using the following table
zh_hans: 使用下表

source: Example 9
zh_hans: 示例9
