Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: An error would occur when the arguments are not given in the appropriate order: In this example, the column ``src`` of the table ``mytable`` is passed to the function as the geometry column, and the geometry column ``mygeom`` is passed to the function as the source column.
zh_hans: 当参数没有按照适当的顺序提供时，会发生错误。在这个例子中，表 ``mytable`` 的``src``列被错误地传递给函数作为几何列，而几何列``mygeom``被错误地传递给函数作为源列。

source: Example 10
zh_hans: 示例10

source: Example 11
zh_hans: 示例11

source: Example 12
zh_hans: 示例12

source: Selecting rows based on the gid. (positional notation)
zh_hans: 根据 gid 选择行（使用位置表示法）

source: Example 13
zh_hans: 示例13

source: Selecting rows based on the gid. (named notation)
zh_hans: 根据 gid 选择行。（使用命名表示法）

source: Example 14
zh_hans: 示例14

source: Selecting the rows where the geometry is near the geometry of row with ``gid`` = 5.
zh_hans: 选择几何与具有``gid``=5的行的几何接近的行。

source: Example 15
zh_hans: 示例15

source: Example 16
zh_hans: 示例16

source: Example 17
zh_hans: 示例17

source: :doc:`topology-functions` for an overview of a topology for routing algorithms.
zh_hans: :doc:`topology-functions` 用于路由算法拓扑的概述。

source: :doc:`pgr_createTopology` <pgr_create_topology>` to create a topology based on the geometry.
zh_hans: :doc:`pgr_createTopology` <pgr_create_topology>`根据几何图形创建拓扑。

source: :doc:`pgr_analyzeGraph` to analyze the edges and vertices of the edge table.
zh_hans: :doc:`pgr_analyzeGraph`分析边表的边和顶点。

source: :doc:`pgr_analyzeOneWay` to analyze directionality of the edges.
zh_hans: :doc:`pgr_analyzeOneWay`分析边方向性的方法。

source: Version 3.4.0
zh_hans: 版本3.4.0

source: :math:`m` is the maximum degree of the vertices in the graph.
zh_hans: :math:`m`是图中顶点的最大度数。

source: pgr_dagShortestPath - Experimental
zh_hans: pgr_dagShortestPath - 实验

source: ``pgr_dagShortestPath`` — Returns the shortest path(s) for weighted directed acyclic graphs(DAG). In particular, the DAG shortest paths algorithm implemented by Boost.Graph.
zh_hans: ``pgr_dagShortestPath`` — 返回加权有向无环图（DAG）的最短路径（path）。特别是，由Boost.Graph实现的DAG最短路径算法。

source: New **experimental** function:
zh_hans: 新**实验**函数：

source: pgr_dagShortestPath(Combinations)
zh_hans: pgr_dagShortestPath(组合)

source: From vertex :math:`5` to vertex :math:`11` on a **directed** graph
zh_hans: 在**有向**图上，从顶点:math:`5`到顶点 :math:`11`

source: Resturn Columns
zh_hans: 返回列

source: ``pgr_degree`` -- Proposed
zh_hans: ``pgr_degree`` -- 拟议

source: Calculates the degree of the vertices of an **undirected** graph
zh_hans: 计算**无向**图顶点的度数

source: pgr_degree can utilize output from `pgr_extractVertices` or can have `pgr_extractVertices` embedded in the call. For decent size networks, it is best to prep your vertices table before hand and use that vertices table for pgr_degree calls.
zh_hans: `pgr_degree`可以利用`pgr_extractVertices`的输出，或者可以在调用中嵌入`pgr_extractVertices`。对于较大规模的网络，最好提前准备好顶点表并在`pgr_degree`调用中使用该顶点表。

source: Degree from an existing table
zh_hans: 来自现有表的度数

source: If you have a vertices table already built using ``pgr_extractVertices`` and want the degree of the whole graph rather than a subset, you can forgo using pgr_degree and work with the ``in_edges`` and ``out_edges`` columns directly.
zh_hans: 如果您已经使用 ``pgr_extractVertices``构建了一个顶点表，并且想要整个图的度而不是子集，则可以放弃使用 pgr_ Degree 并直接使用 ``in_edges`` 和 ``out_edges``列。

source: Version 3.3.0
zh_hans: 版本3.3.0

source: Promoted to **proposed** function
zh_hans: 升级至**拟议**函数

source: ``pgr_depthFirstSearch`` (`Single Vertex`_)
zh_hans: ``pgr_depthFirstSearch`` (`单个顶点`_)

source: ``pgr_depthFirstSearch`` (`Multiple Vertices`_)
zh_hans: ``pgr_depthFirstSearch`` (`多个顶点`_)

source: `Boost: Depth First Search algorithm documentation <https://www.boost.org/libs/graph/doc/depth_first_search.html>`__
zh_hans: `Boost: 深度优先搜索算法文档 <https://www.boost.org/libs/graph/doc/depth_first_search.html>`__

source: `Boost: Undirected DFS algorithm documentation <https://www.boost.org/libs/graph/doc/undirected_dfs.html>`__
zh_hans: `Boost：非定向 DFS 算法文档 <https://www.boost.org/libs/graph/doc/undirected_dfs.html>`__

source: ``pgr_dijkstra`` — Shortest path(s) using Dijkstra algorithm.
zh_hans: `pgr_dijkstra`` - 使用 Dijkstra 算法的最短路径。

source: Version 3.5.0
zh_hans: 版本 3.5.0

source: ``pgr_dijkstra`` (`One to One`_) added ``start_vid`` and ``end_vid`` columns.
zh_hans: ``pgr_dijkstra`` (`一对一`_)增加``start_vid``和``end_vid``列。

source: ``pgr_dijkstra`` (`One to Many`_) added ``end_vid`` column.
zh_hans: ``pgr_dijkstra`` (`一对多`_) 增加``end_vid`` 列。

source: ``pgr_dijkstra`` (`Many to One`_) added ``start_vid`` column.
zh_hans: ``pgr_dijkstra`` (`多对一`_) 增加 ``start_vid``列。

source: Version 3.1.0
zh_hans: 版本 3.1.0

source: ``pgr_dijkstra`` (`Combinations`_)
zh_hans: ``pgr_dijkstra`` (`组合`_)

source: **Official** functions
zh_hans: **官方**函数

source: Version 2.2.0
zh_hans: 版本 2.2.0

source: New **proposed** functions:
zh_hans: 新的**拟议**函数：

source: ``pgr_dijkstra`` (`One to Many`_)
zh_hans: ``pgr_dijkstra`` (`一对多`_)

source: ``pgr_dijkstra`` (`Many to One`_)
zh_hans: ``pgr_dijkstra`` (`多对一`_)

source: ``pgr_dijkstra`` (`Many to Many`_)
zh_hans: ``pgr_dijkstra`` (`多对多`_)

source: Signature change on ``pgr_dijkstra`` (`One to One`_)
zh_hans: ``pgr_dijkstra`` (`一对一`_)的签名更改

source: **Official** ``pgr_dijkstra`` (`One to One`_)
zh_hans: **官方**``pgr_dijkstra`` (`一对一`_)

source: pgr_dijkstra(`Edges SQL`_, **start vids**, **end vid**, [``directed``])
zh_hans: pgr_dijkstra(`Edges SQL`_, **start vid**, **end vid**, [``directed``])

source: Breaking change on 3.5.0
zh_hans: 3.5.0 上的重大变更

source: Read the :doc:`migration` about how to migrate from the old result columns to the new result columns.
zh_hans: 请阅读 :doc:`migration` 关于如何从旧的结果列迁移到新的结果列。

source: Paths :math:`\{6\}\rightarrow\{10, 7\}\cup\{12\}\rightarrow\{10\}`
zh_hans: 路径 :math:`\{6\}\rightarrow\{10, 7\}\cup\{12\}\rightarrow\{10\}`

source: ``pgr_dijkstraCost`` - Total cost of the shortest path(s) using Dijkstra algorithm.
zh_hans: `pgr_dijkstraCost`` - 使用 Dijkstra 算法计算的最短路径总成本。

source: ``pgr_dijkstraCost`` (`Combinations`_)
zh_hans: ``pgr_dijkstraCost`` (`组合`_)

source: The ``pgr_dijkstraCost`` function sumarizes of the cost of the shortest path(s) using Dijkstra Algorithm.
zh_hans: ``pgr_dijkstraCost`` 函数总结了使用Dijkstra算法的最短路径的成本。

source: pgr_dijkstraCost(`Edges SQL`_, **start vids**, **end vid**, [``directed``])
zh_hans: pgr_dijkstraCost(`Edges SQL`_, **start vid**, **end vid**, [``directed``])

source: **options A:** ``[directed, cap]``
zh_hans: **选项A：** ``[directed, cap]``

source: **options B:** ``[directed, cap, global]``
zh_hans: **选项B：** ``[directed, cap, global]``

source: **options:** ``[directed, cap]``
zh_hans: **选项：** ``[directed, cap]``

source: **options:** ``[directed, cap, global]``
zh_hans: **选项：** ``[定向、上限、全局]```

source: Unsing an **undirected** graph for pedestrian routing
zh_hans: 使用**无向**图进行行人路线规划

source: Both are equaly good as they have the same cost. (lines: `13` and `14` and lines: `15` and `16`)
zh_hans: 它们都一样好，因为它们具有相同的成本（线路：`13`和`14`以及线路：`15`和`16`）

source: pgr_dijkstraNearCost(`Edges SQL`_, **start vids**, **end vid**, [**options**])
zh_hans: pgr_dijkstraNearCost(`Edges SQL`_, **start vid**, **end vid**, [**options**])

source: lines `3~4` sets the start vertices to be from the fisrt subway line and the ending vertices to be from the second subway line
zh_hans: 行 `3~4` 设置地铁三号线的起始顶点和地铁二号线的终点顶点

source: Both are equaly good as they have the same cost. (lines: `12` and `13`)
zh_hans: 由于成本相同，所以两者同样好。(线路：`12`和 `13`）

source: **options:** ``[directed, strict, U_turn_on_edge]``
zh_hans: **选项：** ``[directed, strict, U_turn_on_edge]``

source: Find the route that visits the vertices :math:`\{5, 1, 8\}` in that order on an **directed** graph.
zh_hans: 在一个**有向**图上，找出按此顺序访问顶点 :math:`\{5, 1, 8\}` 的路径。

source: ``pgr_drivingDistance``
zh_hans: 驾驶距离

source: Standarizing output columns to |result-spantree|
zh_hans: 将输出列标准化为 |result-spantree|

source: Signature change pgr_drivingDistance(single vertex)
zh_hans: 签名更改 pgr_drivingDistance（单顶点）

source: New **Official** pgr_drivingDistance(multiple vertices)
zh_hans: 新**官方** pgr_drivingDistance(多顶点)

source: Official:: pgr_drivingDistance(single vertex)
zh_hans: 官方:: pgr_drivingDistance(单顶点)

source: Using the Dijkstra algorithm, extracts all the nodes that have costs less than or equal to the value ``distance``. The edges extracted will conform to the corresponding spaning tree.
zh_hans: 使用Dijkstra算法，提取所有成本小于或等于值``distance``的节点。提取的边将符合相应的生成树。

source: pgr_edgeColoring - Experimental
zh_hans: pgr_edgeColoring - 实验

source: :math:`|V|` is the number of vertices in the graph.
zh_hans: :math:`|V|` 是图中的顶点数。

source: New **proposed** function:
zh_hans: 新的**拟议**函数：

source: pgr_edgeDisjointPaths(Combinations)
zh_hans: pgr_edgeDisjointPaths(组合)

source: pgr_edgeDisjointPaths(`Edges SQL`_, **start vids**, **end vid**, [``directed``])
zh_hans: pgr_edgeDisjointPaths(`Edges SQL`_, **start vid**, **end vid**, [``directed``])

source: RETURNS SET OF |result-disjoint|
zh_hans: 返回 |result-disjoint| 的集合

source: RETURNS SET OF |result-disjoint-1-1|
zh_hans: 返回|result-disjoint-1-1|集合

source: RETURNS SET OF |result-disjoint-1-m|
zh_hans: 返回 |result-disjoint-1-m|集合

source: RETURNS SET OF |result-disjoint-m-1|
zh_hans: 返回|result-disjoint-m-1|集合

source: RETURNS SET OF |result-disjoint-m-m|
zh_hans: 返回 |result-disjoint-m-m|集合

source: ``pgr_edmondsKarp`` (`Combinations`_)
zh_hans: ``pgr_edmondsKarp`` (`组合`_)

source: ``pgr_edwardMoore - Experimental``
zh_hans: ``pgr_edwardMoore -实验``

source: ``pgr_edwardMoore`` — Returns the shortest path using Edward-Moore algorithm.
zh_hans: ``pgr_edwardMoore`` - 使用 Edward-Moore 算法返回最短路径。

source: ``pgr_edwardMoore`` (`Combinations`_)
zh_hans: ``pgr_edwardMoore`` (`组合`_)

source: ``pgr_edwardMoore`` (`One to One`_)
zh_hans: ``pgr_edwardMoore`` (`一对一`_)

source: ``pgr_edwardMoore`` (`One to Many`_)
zh_hans: ``pgr_edwardMoore`` (`一对多`_)

source: ``pgr_edwardMoore`` (`Many to One`_)
zh_hans: ``pgr_edwardMoore`` (`多对一`_)

source: ``pgr_edwardMoore`` (`Many to Many`_)
zh_hans: ``pgr_edwardMoore`` (`多对多`_)

source: `start vid` ascending
zh_hans: `start vid`升序

source: `end vid` ascending
zh_hans: `end vid`升序

source: pgr_extractVertices -- Proposed
zh_hans: pgr_extractVertices -- 拟议

source: Classified as **proposed** function
zh_hans: 列为**拟议**函数

source: Dryrun execution
zh_hans: 试运行执行

source: Queries uses the :doc:`sampledata` network.
zh_hans: 查询使用 :doc:`示例数据`网络。

source: New **official** function
zh_hans: **官方**新功能

source: pgRouting version
zh_hans: pgRouting 版本

source: Boost version
zh_hans: Boost 版本

source: ``pgr_hawickCircuits - Experimental``
zh_hans: ``pgr_hawickCircuits - 实验``

source: ``pgr_hawickCircuits`` — Returns the list of cirucits using hawick circuits algorithm.
zh_hans: ``pgr_hawickCircuits`` — 使用 Hawick 回路算法返回回路列表。

source: :math:`|c|` is the number of circuts in the graph.
zh_hans: :math:`|c|`是图中的电路数量。

source: Relative postion in the path. Has value ``0`` for beginning of the path
zh_hans: 路径中的相对位置。 路径开头的值为 ``0``

source: `Boost: Hawick Circuit Algorithm <https://www.boost.org/doc/libs/1_78_0/libs/graph/doc/hawick_circuits.html>`__
zh_hans: `Boost：Hawick 电路算法<https://www.boost.org/doc/libs/1_78_0/libs/graph/doc/hawick_circuits.html>`__

source: The Johnson algorithm, is a good choice to calculate the sum of the costs of the shortest path for each pair of nodes in the graph, for *sparse graphs*. It usees the Boost's implementation which runs in :math:`O(V E \log V)` time,
zh_hans: Johnson算法是计算图中每一对节点的最短路径成本之和的好选择，特别适用于*稀疏图*。它使用了Boost的实现，其运行时间为 :math:`O(V E \log V)`，

source: pgr_lengauerTarjanDominatorTree -Experimental
zh_hans: pgr_lengauerTarjanDominatorTree -实验

source: The algorithm calculates the *immidiate dominator* of each vertex called **idom**, once **idom** of each vertex is calculated then by making every **idom** of each vertex as its parent, the dominator tree can be built.
zh_hans: 该算法计算每个顶点的**直接支配者**（称为**idom**），一旦计算出每个顶点的**idom**，然后通过将每个顶点的**idom**作为其父节点，可以构建支配树。

source: `Boost: Lengauer-Tarjan dominator tree algorithm <https://www.boost.org/libs/graph/doc/lengauer_tarjan_dominator.htm>`__
zh_hans: `BOOST：Languer-Tarzan 支配树算法 <https://www.boost.org/libs/graph/doc/lengauer_tarjan_dominator.htm>`__

source: ``pgr_lineGraph`` - Experimental
zh_hans: ``pgr_lineGraph`` - 实验

source: Given a graph G, its line graph L(G) is a graph such that:
zh_hans: 给定一个图 G，它的线图 L(G) 是这样的图：

source: Each vertex of L(G) represents an edge of G
zh_hans: L(G)的每个顶点代表G的一条边

source: Two vertices of L(G) are adjacent if and only if their corresponding edges share a common endpoint in G.
zh_hans: L(G) 的两个顶点相邻当且仅当它们对应的边共享 G 中的公共端点。

source: For a **directed** graph
zh_hans: 对于**有向**图

source: Version 2.6.0
zh_hans: 版本2.6.0

source: The examples of this section are based on the :doc:`sampledata` network. The examples include the subgraph including edges 4, 7, 8, and 10 with ``reverse_cost``.
zh_hans: 本节的示例基于 :doc:`示例数据`网络。 这些示例包括包含具有``reverse_cost``的边 4、7、8 和 10 的子图。

source: Idenifying the restriction
zh_hans: 识别限制

source: The edge to be altered is ``WHERE cost = 0 AND seq != 1 AND edge != -1`` from the previus query:
zh_hans: 要更改的边是上一个查询中的 ``WHERE cost = 0 AND seq != 1 AND edge != -1``：

source: Query done on :doc:`sampledata` network gives the list of edges that are needed to connect the graph.
zh_hans: 在:doc:`示例数据`网络上完成的查询给出了连接图所需的边列表。

source: ``directed => false`` when used.
zh_hans: 使用时``directed => false``。

source: :math:`\alpha(E,V)` is the inverse of the `Ackermann function`_.
zh_hans: :math:`\alpha(E,V)`与`Ackermann function`_相反。

source: ``pgr_maxFlow`` (`Combinations`_)
zh_hans: ``pgr_maxFlow`` (`组合`_)

source: New **Proposed** function
zh_hans: 新**拟议** 的函数

source: Calculates the maximum flow from the `source(s)` to the `target(s)`.
zh_hans: 计算从 `source(s)`到 `target(s)`的最大流量。

source: ``pgr_maxFlowMinCost`` (`Combinations`_)
zh_hans: ``pgr_maxFlowMinCost`` (`组合`_)

source: :math:`U` is upper bound on number of iterations. In many real world cases number of iterations is much smaller than :math:`U`.
zh_hans: :math:`U`是迭代次数的上限。 在许多现实世界的情况下，迭代次数远小于:math:`U` 。

source: ``pgr_maxFlowMinCost_Cost`` (`Combinations`_)
zh_hans: ``pgr_maxFlowMinCost_Cost`` (`组合`_)

source: ``pgr_nodeNetwork`` - Nodes an network edge table.
zh_hans: ``pgr_nodeNetwork`` - 网络边表的节点。

source: Author
zh_hans: 作者

source: Copyright
zh_hans: 版权

source: Nicolas Ribot, The source code is released under the MIT-X license.
zh_hans: Nicolas Ribot，源代码根据 MIT-X 许可证发布。

source: The function reads edges from a not "noded" network table and writes the "noded" edges into a new table.
zh_hans: 该函数从非"noded"网络表中读取边，并将"noded"边写入新表中。

source: A common problem associated with bringing GIS data into pgRouting is the fact that the data is often not "noded" correctly. This will create invalid topologies, which will result in routes that are incorrect.
zh_hans: 将 GIS 数据引入 pgRouting 的一个常见问题是数据通常没有正确“节点化”。 这将创建无效的拓扑，从而导致路由不正确。

source: What we mean by "noded" is that at every intersection in the road network all the edges will be broken into separate road segments. There are cases like an over-pass and under-pass intersection where you can not traverse from the over-pass to the under-pass, but this function does not have the ability to detect and accommodate those situations.
zh_hans: 我们所说的 "noded"是指在道路网络的每个交叉口，所有边缘都将被分成单独的路段。 在某些情况下，例如天桥和地下通道交叉口，您无法从天桥穿越到地下通道，但此功能无法检测和适应这些情况。

source: This function reads the ``edge_table`` table, that has a primary key column ``id`` and geometry column named ``the_geom`` and intersect all the segments in it against all the other segments and then creates a table ``edge_table_noded``. It uses the ``tolerance`` for deciding that multiple nodes within the tolerance are considered the same node.
zh_hans: 该函数读取``edge_table``表，该表具有主键列 ``id`` 和名为``the_geom``的几何列，并将其中的所有段与所有其他段相交，然后创建表``edge_table_noded``。 它使用``tolerance``来决定容差内的多个节点被视为同一节点。

source: ``float8`` tolerance for coincident points (in projection unit)dd
zh_hans: ``float8`` 重合点公差（以投影单位表示）dd

source: ``text`` Primary key column name of the network table. Default value is ``id``.
zh_hans: ``text`` 网络表的主键列名称。 默认值为``id``。

source: ``text`` Geometry column name of the network table. Default value is ``the_geom``.
zh_hans: ``text``网络表的几何列名称。 默认值为``the_geom``。

source: ``text`` Suffix for the new table's. Default value is ``noded``.
zh_hans: ``text``新表的后缀。 默认值是``noded``。

source: The output table will have for ``edge_table_noded``
zh_hans: 输出表将具有``edge_table_noded``

source: ``bigint`` Unique identifier for the table
zh_hans: ``bigint`` 表的唯一标识符

source: ``bigint`` Identifier of the edge in original table
zh_hans: ``bigint``原表中边的标识符

source: ``integer`` Segment number of the original edge
zh_hans: ``integer``原边的段号

source: ``integer`` Empty source column to be used with :doc:`pgr_createTopology` function
zh_hans: ``integer``与 :doc:`pgr_createTopology` 函数一起使用的空source列

source: ``integer`` Empty target column to be used with :doc:`pgr_createTopology` function
zh_hans: ``integer``与 :doc:`pgr_createTopology` 函数一起使用的空target列

source: ``geometry`` Geometry column of the noded network
zh_hans: ``geometry``节点网络的几何列

source: Let's create the topology for the data in :doc:`sampledata`
zh_hans: 让我们为 :doc:`示例数据`中的数据创建拓扑

source: Now we can analyze the network.
zh_hans: 现在我们可以分析网络了。

source: The analysis tell us that the network has a gap and an intersection. We try to fix the problem using:
zh_hans: 分析告诉我们，网络存在缺口和交叉点。 我们尝试使用以下方法解决该问题：

source: Inspecting the generated table, we can see that edges 13,14 and 18 has been segmented
zh_hans: 检查生成的表，我们可以看到边 13,14 和 18 已被分段

source: We can create the topology of the new network
zh_hans: 我们可以创建新网络的拓扑

source: Now let's analyze the new topology
zh_hans: 现在我们来分析一下新的拓扑

source: Before Image
zh_hans: 之前的图像

source: before image
zh_hans: 之前的图像

source: After Image
zh_hans: 后面的图像

source: after image
zh_hans: 后面的图像

source: Comparing the results
zh_hans: 比较结果

source: Comparing with the Analysis in the original edge_table, we see that.
zh_hans: 与原始edge_table中的分析相比，我们看到了这一点。

source: Before
zh_hans: 前

source: After
zh_hans: 后

source: Table name
zh_hans: 表名

source: Fields
zh_hans: 字段

source: All original fields
zh_hans: 所有原始字段

source: Has only basic fields to do a topology analysis
zh_hans: 仅具有进行拓扑分析的基本字段

source: Edges with 1 dead end: 1,6,24
zh_hans: 有 1 个死端的边：1、6、24

source: Edges with 2 dead ends 17,18
zh_hans: 有两个死端的边：17，18

source: Edge 17's right node is a dead end because there is no other edge sharing that same node. (cnt=1)
zh_hans: 边 17 的右侧节点是一个死端，因为没有其他边共享同一节点。 （cnt=1）

source: Edges with 1 dead end: 1-1 ,6-1,14-2, 18-1 17-1 18-2
zh_hans: 有 1 个死端的边：1-1 ,6-1,14-2, 18-1 17-1 18-2

source: Isolated segments
zh_hans: 孤立的片段

source: two isolated segments: 17 and 18 both they have 2 dead ends
zh_hans: 两个孤立的段：17 和 18 都有 2 个死端

source: No Isolated segments
zh_hans: 无孤立段

source: Edge 17 now shares a node with edges 14-1 and 14-2
zh_hans: 边 17 现在与边 14-1 和 14-2 共享一个节点

source: Edges 18-1 and 18-2 share a node with edges 13-1 and 13-2
zh_hans: 边 18-1 和 18-2 与边 13-1 和 13-2 共享一个节点

source: Gaps
zh_hans: 差距

source: There is a gap between edge 17 and 14 because edge 14 is near to the right node of edge 17
zh_hans: 边 17 和边 14 之间有间隙，因为边 14 靠近边 17 的右侧节点

source: Edge 14 was segmented Now edges: 14-1 14-2 17 share the same node The tolerance value was taken in account
zh_hans: 边缘14 被分段了，现在边缘14-1、14-2 和 17 共享同一个节点。容差值已被考虑

source: Intersections
zh_hans: 交叉口

source: Edges 13 and 18 were intersecting
zh_hans: 边 13 和 18 相交

source: Edges were segmented, So, now in the interection's point there is a node and the following edges share it: 13-1 13-2 18-1 18-2
zh_hans: 边被分段，所以，现在在交点处有一个节点，并且以下边共享它： 13-1 13-2 18-1 18-2

source: Now, we are going to include the segments 13-1, 13-2 14-1, 14-2 ,18-1 and 18-2 into our edge-table, copying the data for dir,cost,and reverse cost with tho following steps:
zh_hans: 现在，我们将包括段 13-1、13-2、14-1、14-2、18-1 和 18-2 到我们的边表中，并复制 dir、cost 和 reverse cost 的数据，按照以下步骤进行：

source: Add a column old_id into edge_table, this column is going to keep track the id of the original edge
zh_hans: 在边表中添加一列old_id，该列将跟踪原始边的id

source: Insert only the segmented edges, that is, the ones whose max(sub_id) >1
zh_hans: 仅插入分段边，即 max(sub_id) >1 的边

source: We recreate the topology:
zh_hans: 我们重新创建拓扑：

source: To get the same analysis results as the topology of edge_table_noded, we do the following query:
zh_hans: 为了获得与edge_table_noded的拓扑相同的分析结果，我们执行以下查询：

source: To get the same analysis results as the original edge_table, we do the following query:
zh_hans: 为了获得与原始edge_table相同的分析结果，我们执行以下查询：

source: Or we can analyze everything because, maybe edge 18 is an overpass, edge 14 is an under pass and there is also a street level juction, and the same happens with edges 17 and 13.
zh_hans: 或者我们可以分析所有内容，因为也许边 18 是立交桥，边 14 是地下通道，还有一个街道水平交汇处，边 17 和 13 也会发生同样的情况。

source: :doc:`topology-functions` for an overview of a topology for routing algorithms. :doc:`pgr_analyzeOneWay` to analyze directionality of the edges. :doc:`pgr_createTopology` to create a topology based on the geometry. :doc:`pgr_analyzeGraph` to analyze the edges and vertices of the edge table.
zh_hans: :doc:`topology-functions`，用于概述路由算法的拓扑。 :doc:`pgr_analyzeOneWay` 分析边方向性的方法。:doc:`pgr_createTopology` 根据几何图创建拓扑。 :doc:`pgr_analyzeGraph`分析边表的边和顶点。

source: There are 25 vehciles in the problem all with the same characteristics.
zh_hans: 问题中有 25 辆车都具有相同的特征。

source: The original data needs to be converted to an appropiate table:
zh_hans: 需要将原始数据转换为合适的表格：

source: Visits and extracts the nodes information in Breath First Search ordering of the Minimum Spanning Tree created with Prims's algorithm.
zh_hans: 访问并提取Prims算法创建的最小生成树的呼吸优先搜索排序中的节点信息。

source: Using Prim's algorithm, extracts the nodes that have aggregate costs less than or equal to a **distance** from a **root** vertex (or vertices) within the calculated minimum spanning tree.
zh_hans: 使用 Prim 算法，在计算的最小生成树中提取总成本小于或等于距根顶点（或多个顶点）距离的节点。

source: ``pgr_pushRelabel`` (`Combinations`_)
zh_hans: ``pgr_pushRelabel`` (`组合`_)

source: pgr_sequentialVertexColoring - Proposed
zh_hans: pgr_sequentialVertexColoring - 拟议

source: Promoted to **proposed** signature
zh_hans: 晋升为 **拟议** 签名

source: :math:`d` is the maximum degree of the vertices in the graph,
zh_hans: :math:`d`是图中顶点的最大度数，

source: :math:`k` is the number of colors used.
zh_hans: :math:`k`是使用的颜色数量。

source: pgr_stoerWagner - Experimental
zh_hans: pgr_stoerWagner - 实验

source: Version 3.0
zh_hans: 版本3.0

source: Boost: `Strong components <https://www.boost.org/libs/graph/doc/strong_components.html>`__
zh_hans: Boost: `强大组件<https://www.boost.org/libs/graph/doc/strong_components.html>`__

source: The returned graph is compresed
zh_hans: 返回的图被压缩

source: pgr_trsp - Proposed
zh_hans: pgr_trsp - 拟议

source: ``pgr_trsp`` (`One to One`_)
zh_hans: ``pgr_trsp`` (`一对一`_)

source: ``pgr_trsp`` (`One to Many`_)
zh_hans: ``pgr_trsp`` (`一对多`_)

source: ``pgr_trsp`` (`Many to One`_)
zh_hans: ``pgr_trsp`` (`多对一`_)

source: ``pgr_trsp`` (`Many to Many`_)
zh_hans: ``pgr_trsp`` (`多对多`_)

source: ``pgr_trsp`` (`Combinations`_)
zh_hans: ``pgr_trsp`` (`组合`_)

source: New prototypes:
zh_hans: 新原型：

source: From vertex :math:`6` to vertex :math:`10` on an undirected graph.
zh_hans: 无向图上从一个顶点 :math:`6`到另一个顶点:math:`10`。

source: ``pgr_trspVia`` - Proposed
zh_hans: ``pgr_trspVia`` - 拟议

source: New proposed function:
zh_hans: 新提议的函数：

source: Find the route that visits the vertices :math:`\{ 5, 1, 8\}` in that order on an directed graph.
zh_hans: 在有向图上查找按顺序访问顶点 :math:`\{ 5, 1, 8\}` 的路线。

source: ``pgr_trspVia_withPoints`` - Proposed
zh_hans: ``pgr_trspVia_withPoints`` - 拟议

source: Value in [``r``, ``l``] indicating if the driving side is:
zh_hans: 在 [``r``, ``l``] 中的值表示驾驶方向是：

source: ``r`` for right driving side
zh_hans: ``r`` 代表右驾驶侧

source: ``l`` for left driving side
zh_hans: ``l``表示左驾驶侧
