Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Before updating pgRouting enumerate the columns: |result-m-1|
sv: Innan uppdatering av pgRouting räknas kolumnerna upp: |resultat-m-1|

source: Using ``pgr_dijkstra``
sv: Använda ``pgr_dijkstra``

source: Migrating `this v3.4 <https://docs.pgrouting.org/3.4/en/pgr_dijkstra.html#many-to-one>`__ example.
sv: Migrering av `this v3.4 <https://docs.pgrouting.org/3.4/en/pgr_dijkstra.html#many-to-one>`__ exempel.

source: Examples for Many to Many with one route result
sv: Exempel för Many to Many med ett ruttresultat

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPoints.html#many-to-many>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPoints.html#many-to-many>`__ exempel.

source: Examples for combinations with one route result
sv: Exempel på kombinationer med ett vägresultat

source: Migrating `this v3.8 `this <https://docs.pgrouting.org/3.8/en/pgr_withPoints.html#combinations>`__ example.
sv: Migrering av `this v3.8 `this <https://docs.pgrouting.org/3.8/en/pgr_withPoints.html#combinations>`__ exempel.

source: Migration of spanning tree functions
sv: Migrering av spanning tree-funktioner

source: The standardized :ref:`pgRouting-concepts:Result columns for spanning tree functions` are |result-spantree|
sv: De standardiserade :ref:`pgRouting-concepts:Result-kolumnerna för spanning tree-funktioner` är |result-spantree|

source: ``pgr_withPointsDD``
sv: ``pgr_medPointsDD``

source: ``pgr_breadthFisrtSearch``
sv: ``pgr_breddFisrtSearch``

source: ``pgr_depthFisrtSearch``
sv: ``pgr_djupFisrtSearch``

source: to |result-spantree|
sv: till |resultat-spantree|

source: Migration from |result-bfs|.
sv: Migrering från |result-bfs|.

source: Single vertex
sv: Enstaka toppunkt
zh_hans: 单顶点

source: Multiple vertices
sv: Flera hörn
zh_hans: 多点

source: Before updating pgRouting enumerate the columns: |result-bfs|
sv: Innan uppdatering av pgRouting räknas kolumnerna upp: |resultat-bfs|

source: Single vertex example using ``pgr_kruskalDD``
sv: Exempel på enstaka toppar med ``pgr_kruskalDD``

source: Migrating `this v3.6 <https://docs.pgrouting.org/3.6/en/pgr_kruskalDD.html#single-vertex>`__ example.
sv: Migrering av `this v3.6 <https://docs.pgrouting.org/3.6/en/pgr_kruskalDD.html#single-vertex>`__ exempel.

source: Before updating pgRouting enumerate the columns: |result-bfs|.
sv: Innan uppdatering av pgRouting räknas kolumnerna upp: |resultat-bfs|.

source: Multiple vertices example using ``pgr_kruskalDFS``
sv: Exempel på flera vertikaler med hjälp av ``pgr_kruskalDFS``

source: Migrating `this v3.6 <https://docs.pgrouting.org/3.6/en/pgr_kruskalDFS.html#multiple-vertices>`__ example.
sv: Migrering av `this v3.6 <https://docs.pgrouting.org/3.6/en/pgr_kruskalDFS.html#multiple-vertices>`__ exempel.

source: Migration from |result-dij-dd|
sv: Migrering från |resultat-dij-dd|

source: Migration depends on the signature.
sv: Migrationen beror på signaturen.

source: For single vertex:
sv: För enstaka toppunkt:

source: Before updating pgRouting, enumerate |result-1-1| columns
sv: Innan du uppdaterar pgRouting, räkna upp |result-1-1| kolumner

source: For multiple vertices:
sv: För flera hörn:

source: Changes must be done after updating pgRouting.
sv: Ändringar måste göras efter uppdatering av pgRouting.

source: To get the old version column names |result-dij-dd-m|:
sv: För att få den gamla versionens kolumnnamn |resultat-dij-dd-m|:

source: filter out the column ``pred`` and ``depth`` and
sv: filtrera bort kolumnen ``pred`` och ``depth`` och

source: rename ``start_vid`` to ``from_v``.
sv: byt namn på ``start_vid`` till ``from_v``.

source: Single vertex example using ``pgr_drivingDistance``
sv: Exempel på en enda vertex med hjälp av ``pgr_drivingDistance``

source: Migrating `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_drivingDistance.html#single-vertex>`__ example.
sv: Migrering av `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_drivingDistance.html#single-vertex>`__ exempel.

source: Before updating pgRouting, enumerate |result-1-1-no-seq| columns
sv: Innan du uppdaterar pgRouting, räkna upp kolumnerna |result-1-1-no-seq

source: Multiple vertices example using ``pgr_drivingDistance``
sv: Exempel på flera toppar med hjälp av ``pgr_drivingDistance``

source: Migrating `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_drivingDistance.html#multiple-vertices>`__ example.
sv: Migrering av `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_drivingDistance.html#multiple-vertices>`__ exempel.

source: To get the old version column names |result-dij-dd-m|: filter out the column ``pred`` and ``depth`` and rename ``start_vid`` to ``from_v``.
sv: För att få den gamla versionens kolumnnamn |result-dij-dd-m|: filtrera bort kolumnen ``pred`` och ``depth`` och byt namn på ``start_vid`` till ``from_v``.

source: Migration of |result-generic-no-seq|
sv: Migrering av |result-generic-no-seq|

source: After updating pgRouting:
sv: Efter uppdatering av pgRouting:

source: Enumerate |result-1-1-no-seq| columns
sv: Räkna upp kolumner för resultat-1-1-icke-seq

source: Use an unnamed valid value for **driving side** after the **distance** parameter.
sv: Använd ett icke namngivet giltigt värde för **körsida** efter parametern **avstånd**.

source: Enumerate |result-m-1-no-seq| columns
sv: Räkna upp |resultat-m-1-no-seq|-kolumner

source: Validity of **driving side** parameter
sv: Giltighet för parametern **förarsida**

source: **driving side** parameter is unnamed compulsory, and valid values differ for directed and undirected graphs.
sv: *parametern *driving side** är obligatorisk utan namn och giltiga värden skiljer sig åt för riktade och oriktade grafer.
zh_hans: **driving side**参数是未命名的强制参数，有向图和无向图的有效值不同。

source: Does not have a default value.
sv: Har inget förinställt värde.
zh_hans: 没有默认值。

source: In directed graph: valid values are [``r``, ``R``, ``l``, ``L``]
sv: I riktad graf: giltiga värden är [``r``, ``R``, ``l``, ``L``]
zh_hans: 在有向图中：有效值为 [``r``, ``R``, ``l``, ``L``]

source: In undirected graph: valid values are [``b``, ``B``]
sv: I en oriktad graf: giltiga värden är [``b``, ``B``]
zh_hans: 在无向图中：有效值为 [``b``, ``B``]

source: Using an invalid value throws an ``ERROR``.
sv: Om du använder ett ogiltigt värde får du ett ``ERROR``.
zh_hans: 使用无效值会引发 ``ERROR``。

source: Single vertex example using ``pgr_withPointsDD``
sv: Exempel på en enda toppunkt med ``pgr_withPointsDD``

source: Migrating `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_withPointsDD.html#single-vertex>`__ example.
sv: Migrering av `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_withPointsDD.html#single-vertex>`__ exempel.

source: Multiple vertices example using ``pgr_withPointsDD``
sv: Exempel på flera vertikaler med hjälp av ``pgr_withPointsDD``

source: Migrating `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_withPointsDD.html#multiple-vertex>`__ example.
sv: Migrering av `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_withPointsDD.html#multiple-vertex>`__ exempel.

source: Migration of output column name change
sv: Ändring av namn på utdatakolumn vid migrering

source: The standardized result columns:
sv: De standardiserade resultatkolumnerna:

source: |result_edge_color|
sv: |resultat_kant_färg|

source: |result_node_color|
sv: |resultat_node_färg|

source: Changes on column names must be done after updating pgRouting.
sv: Ändringar av kolumnnamn måste göras efter uppdatering av pgRouting.

source: Migration from |result-old-closure|
sv: Migrering från |result-old-closure|

source: Migration to: |result-old-closure|
sv: Migrering till: |result-old-closure|

source: After update:
sv: Efter uppdatering:

source: Remove column ``seq``
sv: Ta bort kolumnen ``seq``

source: Rename ``vid`` to ``node`` and ``target_array`` to ``targets``
sv: Byt namn på ``vid`` till ``node`` och ``target_array`` till ``targets``

source: Migration from |result-toposort|
sv: Migrering från |result-toposort|

source: Migration to: |result-node-order|
sv: Migrering till: |result-node-order|

source: Rename ``sorted_v`` to ``node``
sv: Byt namn på ``sorted_v`` till ``node``

source: Migration from |old-edge-color|
sv: Migrering från |old-edge-color|

source: Migration to: |result_edge_color|
sv: Migration till: |resultat_kant_färg|

source: Rename ``edge_id`` to ``edge`` and ``color_id`` to ``color``.
sv: Byt namn på ``edge_id`` till ``edge`` och ``color_id`` till ``color``.

source: Migration from |old-node-color|
sv: Migrering från |old-node-color|

source: Migration to: |result_node_color|
sv: Migration till: |resultat_node_färg|

source: Rename ``vertex_id`` to ``node`` and ``color_id`` to ``color``.
sv: Byt namn på ``vertex_id`` till ``node`` och ``color_id`` till ``color``.

source: Migration of deleted functions
sv: Migrering av borttagna funktioner

source: Functions no longer on pgRouting
sv: Funktionerna finns inte längre på pgRouting

source: Migration of ``pgr_alphaShape``
sv: Migrering av ``pgr_alphaShape``

source: Deprecated
sv: Föråldrat

source: Removed
sv: Borttagen

source: **Before Deprecation:** The following was calculated:
sv: **För Deprecation:** Följande beräknades:

source: An alphaShape was calculated
sv: En alphaShape beräknades

source: **After Deprecation:**
sv: **Efter utfasning:**

source: PostGIS has two ways of generating alphaShape.
sv: PostGIS har två sätt att generera alphaShape.

source: If you have SFCGAL, which you can install using
sv: Om du har SFCGAL, som du kan installera med hjälp av

source: Since PostGIS 3.5+ use `CG_AlphaShape <https://postgis.net/docs/CG_AlphaShape.html>`__
sv: Sedan PostGIS 3.5+ används `CG_AlphaShape <https://postgis.net/docs/CG_AlphaShape.html>`__

source: For PostGIS 3.5+ use the old name ``ST_AlphaShape``
sv: För PostGIS 3.5+ använd det gamla namnet ``ST_AlphaShape``

source: Other PostGIS options are
sv: Andra PostGIS-alternativ är

source: `ST_ConvexHull <https://postgis.net/docs/ST_ConvexHull.html>`__
sv: `ST_ConvevexHull <https://postgis.net/docs/ST_ConvexHull.html>`__

source: Migration of ``pgr_nodeNetwork``
sv: Migrering av ``pgr_nodeNetwork``

source: **Before Deprecation:** A table with `<edges>_nodded` was created. with split edges.
sv: **Before Deprecation:** En tabell med `<edges>_nodded` skapades. med delade kanter.

source: Use :doc:`pgr_separateTouching` and/or use :doc:`pgr_separateCrossing`
sv: Använd :doc:`pgr_separateTouching` och/eller använd :doc:`pgr_separateCrossing`

source: Migration of ``pgr_createTopology``
sv: Migrering av ``pgr_createTopology``

source: A table with `<edges>_vertices_pgr` was created.
sv: En tabell med `<edges>_vertices_pgr` skapades.

source: **After Deprecation:** The user is responsible to create the complete topology.
sv: **Efter Deprecation:** Användaren är ansvarig för att skapa den kompletta topologin.

source: Build a routing topology
sv: Bygga upp en routingtopologi
zh_hans: 构建路由拓扑

source: The basic information to use the majority of the pgRouting functions ``id, source, target, cost, [reverse_cost]`` is what in pgRouting is called the routing topology.
sv: Den grundläggande informationen för att använda de flesta av pgRouting-funktionerna ``id, source, target, cost, [reverse_cost]`` är vad som i pgRouting kallas routingtopologin.
zh_hans: 使用大多数 pgRouting 函数的基本信息``id, source, target, cost, [reverse_cost]`` 在 pgRouting 中被称为路由拓扑。

source: ``reverse_cost`` is optional but strongly recommended to have in order to reduce the size of the database due to the size of the geometry columns. Having said that, in this documentation ``reverse_cost`` is used in this documentation.
sv: ``reverse_cost`` är valfritt men rekommenderas starkt för att minska databasens storlek på grund av storleken på geometrikolumnerna. I den här dokumentationen används dock ``reverse_cost`` i den här dokumentationen.
zh_hans: ``reverse_cost`` 是可选的，但强烈建议使用，以便由于几何列的大小而减小数据库的大小。 话虽如此，在本文档中使用了``reverse_cost`` 。

source: When the data comes with geometries and there is no routing topology, then this step is needed.
sv: När data levereras med geometrier och det inte finns någon routningstopologi behövs det här steget.
zh_hans: 当数据带有几何图形并且没有路由拓扑时，则需要此步骤。

source: All the start and end vertices of the geometries need an identifier that is to be stored in a ``source`` and ``target`` columns of the table of the data. Likewise, ``cost`` and ``reverse_cost`` need to have the value of traversing the edge in both directions.
sv: Alla geometriernas start- och slutpunkter behöver en identifierare som ska lagras i kolumnerna ``källa`` och ``mål`` i datatabellen. På samma sätt måste ``cost`` och ``reverse_cost`` ha värdet för att korsa kanten i båda riktningarna.
zh_hans: 几何图的所有开始和结束顶点都需要一个标识符，该标识符将存储在数据表的``source``列和``target``列中。 同样，``cost``和 ``reverse_cost``需要具有在两个方向上遍历边的值。

source: If the columns do not exist they need to be added to the table in question. (see `ALTER TABLE <https://www.postgresql.org/docs/current/sql-altertable.html>`__)
sv: Om kolumnerna inte finns måste de läggas till i tabellen i fråga. (se `ALTER TABLE <https://www.postgresql.org/docs/current/sql-altertable.html>`__)
zh_hans: 如果这些列不存在，则需要将它们添加到相关表中。 （参见`ALTER TABLE <https://www.postgresql.org/docs/current/sql-altertable.html>`__）

source: The function :doc:`pgr_extractVertices` is used to create a vertices table based on the edge identifier and the geometry of the edge of the graph.
sv: Funktionen :doc:`pgr_extractVertices` används för att skapa en vertices-tabell baserad på kantidentifieraren och geometrin för kanten i grafen.
zh_hans: 函数 :doc:`pgr_extractVertices` 用于根据边标识符和图边的几何形状创建顶点表。

source: Finally using the data stored on the vertices tables the ``source`` and ``target`` are filled up.
sv: Slutligen fylls ``källan`` och ``målet`` på med hjälp av de data som finns lagrade i topparnas tabeller.
zh_hans: 最后使用存储在顶点表上的数据填充 ``source``和``target`` 。

source: Migration of ``pgr_createVerticesTable``
sv: Migrering av ``pgr_createVerticesTable``

source: **After Deprecation:** The user is responsible to create the vertices table, indexes, etc. They may use :doc:`pgr_extractVertices` for that purpose.
sv: **Efter deprecation:** Användaren är ansvarig för att skapa vertices-tabellen, index, etc. De kan använda :doc:`pgr_extractVertices` för det ändamålet.

source: Migration of ``pgr_analyzeOneWay``
sv: Migrering av ``pgr_analyzeOneWay``

source: Number of potential problems in directionality
sv: Antal potentiella problem med riktverkan

source: WHERE
sv: VAR

source: Directionality problems were calculated based on codes.
sv: Riktningsproblem beräknades baserat på koder.

source: Dead ends.
sv: Dödlägen.

source: A routing problem can arise when from a vertex there is only a way on or a way out but not both:
sv: Ett routingproblem kan uppstå när det från ett toppunkt bara finns en väg in eller en väg ut, men inte båda:

source: Either saving or using directly :doc:`pgr_extractVertices` get the dead ends information and determine if the adjacent edge is one way or not.
sv: Antingen genom att spara eller direkt använda :doc:`pgr_extractVertices` får du information om återvändsgränder och avgör om den intilliggande kanten är enkelriktad eller inte.

source: In this example :doc:`pgr_extractVertices` has already been applied.
sv: I detta exempel har :doc:`pgr_extractVertices` redan tillämpats.

source: Bridges.
sv: Broar.

source: Another routing problem can arise when there is an edge of an undirected graph whose deletion increases its number of connected components, and the bridge is only one way.
sv: Ett annat routningsproblem kan uppstå när det finns en kant i en odelad graf vars borttagning ökar antalet anslutna komponenter, och bron bara går åt ett håll.

source: To determine if the bridges are or not one way.
sv: För att avgöra om broarna är enkelriktade eller inte.

source: Migration of ``pgr_analyzeGraph``
sv: Migrering av ``pgr_analyzeGraph``

source: Number of isolated segments.
sv: Antal isolerade segment.

source: Number of dead ends.
sv: Antal återvändsgränder.

source: Number of potential gaps found near dead ends.
sv: Antal potentiella luckor som hittats nära återvändsgränder.

source: Number of intersections. (between 2 edges)
sv: Antal skärningspunkter. (mellan 2 kanter)

source: Graph component
sv: Grafkomponent

source: A connected subgraph that is not part of any larger connected subgraph.
sv: En sammanhängande delgraf som inte är en del av någon större sammanhängande delgraf.

source: Isolated segment
sv: Isolerat segment

source: A graph component with only one segment.
sv: En grafkomponent med endast ett segment.

source: Dead ends
sv: Döda ändar
zh_hans: 死端

source: A vertex that participates in only one edge.
sv: En vertex som bara deltar i en kant.

source: gaps
sv: luckor

source: Space between two geometries.
sv: Utrymme mellan två geometrier.

source: Intersection
sv: Korsningar

source: Is a topological relationship between two geometries.
sv: Är ett topologiskt förhållande mellan två geometrier.

source: Components.
sv: Komponenter.

source: Instead of counting only isolated segments, determine all the components of the graph.
sv: Istället för att bara räkna isolerade segment kan du bestämma alla komponenter i grafen.

source: Depending of the final application requirements use:
sv: Beroende på de slutliga kraven för applikationen:

source: For example:
sv: Till exempel:

source: Instead of counting the dead ends, determine all the dead ends of the graph using :doc:`pgr_degree`.
sv: I stället för att räkna återvändsgränderna kan du bestämma alla återvändsgränder i grafen med hjälp av :doc:`pgr_degree`.

source: Potential gaps near dead ends.
sv: Potentiella luckor nära återvändsgränder.

source: Instead of counting potential gaps between geometries, determine the geometric gaps in the graph using :doc:`pgr_findCloseEdges`.
sv: Istället för att räkna potentiella mellanrum mellan geometrier, bestäm de geometriska mellanrummen i grafen med hjälp av :doc:`pgr_findCloseEdges`.

source: Topological relationships.
sv: Topologiska relationer.

source: Instead of counting intersections, determine topological relationships between geometries.
sv: Istället för att räkna korsningar, bestäm topologiska relationer mellan geometrier.

source: Several PostGIS functions can be used: `ST_Intersects <https://postgis.net/docs/ST_Intersects.html>`__, `ST_Crosses <https://postgis.net/docs/ST_Crosses.html>`__, `ST_Overlaps <https://postgis.net/docs/ST_Overlaps.html>`__, etc.
sv: Flera PostGIS-funktioner kan användas: `ST_Intersects <https://postgis.net/docs/ST_Intersects.html>`__, `ST_Crosses <https://postgis.net/docs/ST_Crosses.html>`__, `ST_Overlaps <https://postgis.net/docs/ST_Overlaps.html>`__, etc.

source: Migration of ``pgr_trsp`` (Vertices)
sv: Migrering av ``pgr_trsp`` (toppar)
zh_hans: 迁移``pgr_trsp``（顶点）

source: Signature:
sv: Underskrift:

source: `Migration of restrictions`_
sv: "Flyttning av restriktioner

source: Use ``pgr_dijkstra`` when there are no restrictions.
sv: Använd ``pgr_dijkstra`` när det inte finns några begränsningar.

source: Use :doc:`pgr_dijkstra` instead.
sv: Använd :doc:`pgr_dijkstra` istället.
zh_hans: 请改用 :doc:`pgr_dijkstra`。

source: To get the original column names:
sv: För att få de ursprungliga kolumnnamnen:

source: ``id1`` is the node
sv: ``id1`` är noden
zh_hans: ``id1``是节点

source: ``id2`` is the edge
sv: ``id2`` är kanten
zh_hans: ``id2``是边

source: Use ``pgr_trsp`` when there are restrictions.
sv: Använd ``pgr_trsp`` när det finns begränsningar.

source: Use :doc:`pgr_trsp` (One to One) instead.
sv: Använd :doc:`pgr_trsp` (One to One) istället.
zh_hans: 请改用:doc:`pgr_trsp` (一对一）。

source: Migration of ``pgr_trsp`` (Edges)
sv: Migrering av ``pgr_trsp`` (kanter)
zh_hans: 迁移``pgr_trsp``（边）

source: Migration of ``pgr_trspViaVertices``
sv: Migrering av ``pgr_trspViaVertices``
zh_hans: 迁移``pgr_trspViaVertices``

source: Use ``pgr_dijkstraVia`` when there are no restrictions
sv: Använd ``pgr_dijkstraVia`` när det inte finns några begränsningar

source: Use :doc:`pgr_dijkstraVia` instead.
sv: Använd :doc:`pgr_dijkstraVia` istället.
zh_hans: 请使用:doc:`pgr_dijkstraVia`。

source: ``id1`` is the path identifier
sv: ``id1`` är identifieraren för sökvägen
zh_hans: ``id1``是路径标识符

source: ``id2`` is the node
sv: ``id2`` är noden
zh_hans: ``id2``是节点

source: ``id3`` is the edge
sv: ``id3`` är kanten
zh_hans: ``id3``是边

source: Use ``pgr_trspVia`` when there are restrictions
sv: Använd ``pgr_trspVia`` när det finns begränsningar

source: Use :doc:`pgr_trspVia` instead.
sv: Använd :doc:`pgr_trspVia` istället.
zh_hans: 使用 :doc:`pgr_trspVia`。

source: Migration of ``pgr_trspViaEdges``
sv: Migrering av ``pgr_trspViaEdges``
zh_hans: 迁移``pgr_trspViaEdges``

source: Use ``pgr_withPointsVia`` when there are no restrictions
sv: Använd ``pgr_withPointsVia`` när det inte finns några begränsningar

source: Use :doc:`pgr_withPointsVia` instead.
sv: Använd :doc:`pgr_withPointsVia` istället.
zh_hans: 请使用 :doc:`pgr_withPointsVia`。

source: Use ``pgr_trspVia_withPoints`` when there are restrictions
sv: Använd ``pgr_trspVia_withPoints`` när det finns begränsningar

source: Use :doc:`pgr_trspVia_withPoints` instead.
sv: Använd :doc:`pgr_trspVia_withPoints` istället.
zh_hans: 使用 :doc:`pgr_trspVia_withPoints`代替。

source: Not yet classified migrations
sv: Ännu ej klassificerade migrationer

source: Migration of ``pgr_withPointsKSP``
sv: Migrering av ``pgr_withPointsKSP``
zh_hans: 迁移``pgr_withPointsKSP``

source: Starting from `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__ :doc:`pgr_withPointsKSP` result columns are being standardized.
sv: Från och med `v3.6.0 <https://docs.pgrouting.org/3.6/en/migration.html>`__ :doc:`pgr_withPointsKSP` standardiseras resultatkolumnerna.

source: |ksp-result|
sv: |ksp-resultat|

source: |generic-result|
sv: |generiskt resultat|

source: And ``driving side`` parameter changed from named optional to unnamed compulsory **driving side** and its validity differ for directed and undirected graphs.
sv: Parametern ``driving side`` ändrades från namngiven valfri till icke namngiven obligatorisk **driving side** och dess giltighet skiljer sig åt för riktade och oriktade grafer.
zh_hans: 而且 `driving side` 参数从命名的可选参数变为未命名的必选参数 **行驶方向**，其有效性对于有向图和无向图有所不同。

source: Before Migration
sv: Före migration
zh_hans: 迁移前

source: Output columns were |old-pid-result|
sv: Utgångskolumnerna var |old-pid-resultat|
zh_hans: 输出列是 |old-pid-result|

source: the columns ``start_vid`` and ``end_vid`` do not exist.
sv: kolumnerna ``start_vid`` och ``end_vid`` finns inte.
zh_hans: ``start_vid``和 ``end_vid``列不存在。

source: Migration
sv: Migrering
zh_hans: 迁移

source: Be aware of the existence of the additional result Columns.
sv: Var medveten om att det finns ytterligare resultat Kolumner.

source: New output columns are |generic-result|
sv: Nya utdatakolumner är |generiskt-resultat|

source: Using `this <https://docs.pgrouting.org/3.5/en/pgr_withPointsKSP.html#signatures>`__ example.
sv: Använda `det här <https://docs.pgrouting.org/3.5/en/pgr_withPointsKSP.html#signatures>`__ exemplet.
zh_hans: 使用 `这个 <https://docs.pgrouting.org/3.5/en/pgr_withPointsKSP.html#signatures>`__示例。

source: ``start_vid`` contains the **start vid** parameter value.
sv: ``start_vid`` innehåller parametervärdet **start vid**.
zh_hans: ``start_vid`` 包含**起始 vid **参数值。

source: ``end_vid`` contains the **end vid** parameter value.
sv: ``end_vid`` innehåller parametervärdet **end vid**.
zh_hans: ``end_vid`` 包含**结束 vid** 参数值。

source: If needed filter out the additional columns, for example, to return the original columns:
sv: Vid behov kan du filtrera bort de extra kolumnerna, t.ex. för att få tillbaka de ursprungliga kolumnerna:
zh_hans: 如果需要，过滤掉附加列，例如，返回原始列：

source: Use ``pgr_withPoints`` when there are no restrictions.
sv: Använd ``pgr_withPoints`` när det inte finns några begränsningar.
