Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: From **many** starting vertices
sv: Från **många** startpunkter
zh_hans: 从**多**起始顶点

source: From **many** different starting vertices
sv: Från **många** olika startpunkter
zh_hans: 从**多个**不同的起始顶点

source: to **many** different ending vertices
sv: till **många** olika slutpunkter
zh_hans: 到**多个**不同的结束顶点

source: Every tuple specifies a pair of a start vertex and an end vertex
sv: Varje tupel specificerar ett par av en startvertex och en slutvertex
zh_hans: 每个元组指定一对起始顶点和结束顶点

source: Users can define the combinations as desired.
sv: Användarna kan definiera kombinationerna som de vill.
zh_hans: 用户可以根据需要定义组合。

source: Needs a `Combinations SQL`_
sv: Behöver en `Combinations SQL`_
zh_hans: 需要`Combinations SQL`_

source: There are several kinds of valid inner queries and also the columns returned are depending of the function. Which kind of inner query will depend on the function's requirements. To simplify the variety of types, **ANY-INTEGER** and **ANY-NUMERICAL** is used.
sv: Det finns flera olika typer av giltiga inre frågor och de kolumner som returneras beror också på funktionen. Vilken typ av inner query som används beror på funktionens krav. För att förenkla de många olika typerna används **ANY-INTEGER** och **ANY-NUMERICAL**.

source: Edges SQL for
sv: Edges SQL för
zh_hans: 边 SQL

source: Some uncategorised functions
sv: Vissa okategoriserade funktioner
zh_hans: 一些未分类的函数

source: General without ``id``
sv: Allmänt utan ``id``
zh_hans: 一般没有``id``

source: General with (X,Y)
sv: Allmänt med (X,Y)
zh_hans: 通常带有（X,Y)

source: When negative: edge (``source``, ``target``) does not exist, therefore it's not part of the graph.
sv: När den är negativ: kanten (``källa``, ``mål``) existerar inte, därför är den inte en del av grafen.
zh_hans: 当为负时：边（``source``, ``target``）不存在，因此它不是图的一部分。

source: Weight of the edge (``target``, ``source``),
sv: Kantvikt (``mål``, ``källa``),
zh_hans: 边 (``target``, ``source``)的权重，

source: X coordinate of ``source`` vertex.
sv: X-koordinat för ``källans`` toppunkt.
zh_hans: ``source`` 顶点的X坐标。

source: Y coordinate of ``source`` vertex.
sv: Y-koordinat för ``källans`` toppunkt.
zh_hans: ``source``顶点的Y坐标。

source: X coordinate of ``target`` vertex.
sv: X-koordinat för ``mål`` vertex.
zh_hans: ``target``顶点的X坐标。

source: Y coordinate of ``target`` vertex.
sv: Y-koordinat för "målets" toppunkt.
zh_hans: ``target``顶点的Y坐标。

source: Flow
sv: Flöde
zh_hans: 流

source: Edges SQL for :doc:`flow-family`
sv: Edges SQL för :doc:`flow-family`
zh_hans: 用于流数据系列 ( :doc:`flow-family`) 的Edges SQL

source: Edges SQL for the following functions of :doc:`flow-family`
sv: Edges SQL för följande funktioner i :doc:`flow-family`
zh_hans: Edges SQL 适用于:doc:`flow-family`的以下函数

source: Used in combination signatures
sv: Används i kombinationssignaturer
zh_hans: 结合签名使用

source: Points SQL for
sv: Punkt SQL för
zh_hans: 用于Points SQL

source: The main parameter of the majority of the pgRouting functions is a query that selects the edges of the graph.
sv: Huvudparametern för de flesta pgRouting-funktioner är en fråga som väljer ut kanterna i grafen.
zh_hans: 大多数 pgRouting 函数的主要参数是选择图的边的查询。

source: Depending on the family or category of a function it will have additional parameters, some of them are compulsory and some are optional.
sv: Beroende på vilken familj eller kategori en funktion tillhör kommer den att ha ytterligare parametrar, varav vissa är obligatoriska och andra valfria.
zh_hans: 根据函数的族或类别，它将具有附加参数，其中一些是强制性的，一些是可选的。

source: The compulsory parameters are nameless and must be given in the required order. The optional parameters are named parameters and will have a default value.
sv: De obligatoriska parametrarna är namnlösa och måste anges i den ordning som krävs. De valfria parametrarna är namngivna parametrar och kommer att ha ett standardvärde.
zh_hans: 强制参数是无名的，并且必须按要求的顺序给出。 可选参数是命名参数，并且具有默认值。

source: Parameters for the Via functions
sv: Parametrar för Via-funktionerna
zh_hans: Via 函数的参数

source: SQL query as described.
sv: SQL-fråga enligt beskrivning.
zh_hans: 如所述的 SQL 查询。

source: When ``true`` Graph is considered `Directed`
sv: När en "sann" graf anses vara "riktad
zh_hans: 当为``true``时，图被视为`有向`图

source: When ``false`` the graph is considered as Undirected.
sv: När ``false`` betraktas grafen som Undirected.
zh_hans: 当为``false``时，图被视为无向图。

source: ``strict``
sv: ``strikt``

source: When ``true`` if a path is missing stops and returns **EMPTY SET**
sv: När ``true`` om en sökväg saknas stoppar och returnerar **EMPTY SET**
zh_hans: 当为 ``true`` 时，如果路径丢失，则停止并返回 **EMPTY SET**

source: When ``false`` ignores missing paths returning all paths found
sv: När ``false`` ignorerar saknade sökvägar returneras alla sökvägar som hittats
zh_hans: 当``false``忽略丢失的路径时，返回找到的所有路径

source: ``U_turn_on_edge``
sv: ``U_vändning_på_kanten``

source: When ``true`` departing from a visited vertex will not try to avoid using the edge used to reach it. In other words, U turn using the edge with same identifier is allowed.
sv: När ``true`` avgår från ett besökt toppunkt kommer inte att försöka undvika att använda den kant som användes för att nå det. Med andra ord är det tillåtet att använda kanten med samma identifierare i U-svängen.
zh_hans: 当 为``true``时，从已访问的顶点出发，不会试图避免使用用于到达它的边。换句话说，允许使用具有相同标识符的边来进行掉头。

source: When ``false`` when a departing from a visited vertex tries to avoid using the edge used to reach it. In other words, U turn using the edge with same identifier is used when no other path is found.
sv: När ``false`` när en avgång från en besökt topp försöker undvika att använda den kant som användes för att nå den. Med andra ord, U-sväng med kanten med samma identifierare används när ingen annan väg hittas.
zh_hans: 当为``false``时，从已访问的顶点出发，尝试避免使用用于到达它的边。换句话说，只有在找不到其他路径时才使用具有相同标识符的边来进行掉头。

source: For the TRSP functions
sv: För TRSP-funktionerna
zh_hans: 对于 TRSP 函数

source: Array of identifiers of destination vertices.
sv: Array med identifierare för målpunkter.
zh_hans: 目标顶点的标识符数组。

source: There are several kinds of columns returned are depending of the function.
sv: Det finns flera olika typer av kolonner som returneras beroende på funktion.
zh_hans: 根据函数的不同，返回的列有多种。

source: Result columns for single path functions
sv: Resultatkolumner för funktioner med enkel sökväg

source: Used in functions that return one path solution per departure and destination.
sv: Används i funktioner som returnerar en lösning per avgång och destination.

source: Returns |short-generic-result|
sv: Returnerar |kort-generiskt-resultat|

source: ``path_seq``
sv: ``väg_seq``

source: Relative position in the path. Has value **1** for the beginning of a path.
sv: Relativ position i tågläget. Har värdet **1** för början av ett tågläge.
zh_hans: 路径中的相对位置。 路径开头的值为 **1**。

source: Identifier of the starting vertex of the current path.
sv: Identifierar startpunkten för den aktuella banan.
zh_hans: 当前路径起始顶点的标识符。

source: Identifier of the ending vertex of the current path.
sv: Identifierare för den aktuella banans slutpunkt.
zh_hans: 当前路径结束顶点的标识符。

source: Identifier of the node in the path from ``start_vid`` to ``end_vid``.
sv: Identifierare av noden i sökvägen från ``start_vid`` till ``slut_vid``.
zh_hans: 从``start_vid``到 ``end_vid``路径中节点的标识符。

source: Identifier of the edge used to go from ``node`` to the next node in the path sequence. **-1** for the last node of the path.
sv: Identifierare av den kant som används för att gå från ``node`` till nästa nod i sökvägssekvensen. **-1** för den sista noden i sökvägen.
zh_hans: 用于从路径序列中的``node`` 到下一个节点的边的标识符。**-1** 表示路径的最后一个节点。

source: Cost to traverse from ``node`` using ``edge`` to the next node in the path sequence.
sv: Kostnad för att gå från ``nod`` med hjälp av ``edge`` till nästa nod i vägsekvensen.
zh_hans: 从使用``edge``的 ``node`` 遍历到路径序列中的下一个节点的成本。

source: When ``start_vid`` or ``end_vid`` columns have negative values, the identifier is for a Point.
sv: När kolumnerna ``start_vid`` eller ``end_vid`` har negativa värden är identifieraren för en Point.

source: Result columns for multiple paths functions
sv: Resultatkolumner för funktioner med flera sökvägar

source: Used in functions that return many paths solutions per departure and destination.
sv: Används i funktioner som returnerar många banlösningar per avgång och destination.

source: Returns set of |generic-result|
sv: Returnerar uppsättning av |generiskt-resultat|
zh_hans: 返回 |eneric-result| 的集合

source: ``path_id``
sv: ``Sökväg_id``

source: Path identifier.
sv: Identifierare för sökväg.
zh_hans: 路径标识符。

source: Has value **1** for the first of a path from ``start_vid`` to ``end_vid``.
sv: Har värdet **1** för den första i en sökväg från ``start_vid`` till ``slut_vid``.
zh_hans: 从``start_vid`` 到 ``end_vid``的第一个路径的值为** 1**。

source: Result columns for cost functions
sv: Resultatkolumner för kostnadsfunktioner
zh_hans: 成本函数结果列

source: Used by:
sv: Används av:

source: When start_vid or end_vid columns have negative values, the identifier is for a Point.
sv: När kolumnerna start_vid eller end_vid har negativa värden är identifieraren för en Point.
zh_hans: 当 start_vid 或 end_vid 列具有负值时，标识符用于点。

source: Result columns for flow functions
sv: Resultatkolumner för flödesfunktioner
zh_hans: 流量函数的结果列

source: Result columns for spanning tree functions
sv: Resultatkolumner för funktioner för spännträd
zh_hans: 生成树函数的结果列

source: Used in functions that return a tree solution per departure.
sv: Används i funktioner som returnerar en trädlösning per avgång.

source: Result columns for simple spanning tree functions
sv: Resultatkolumner för funktioner för enkla spännträd

source: Returns set of ``(edge, cost)``
sv: Returnerar uppsättning av ``(kant, kostnad)``

source: Cost to traverse the edge.
sv: Kostnad för att korsa kanten.
zh_hans: 穿越边的成本。

source: Performance Tips
sv: Tips om prestanda
zh_hans: 性能技巧

source: For the Routing functions
sv: För Routing-funktionerna
zh_hans: 对于路由功能

source: To get faster results bound the queries to an area of interest of routing.
sv: För att få snabbare resultat avgränsar du frågorna till ett intresseområde för routning.
zh_hans: 为了获得更快的结果，将查询绑定到路由感兴趣的区域。

source: In this example Use an inner query SQL that does not include some edges in the routing function and is within the area of the results.
sv: I det här exemplet Använd en inre fråga SQL som inte innehåller några kanter i routningsfunktionen och som ligger inom resultatområdet.
zh_hans: 在此示例中，使用内部查询 SQL，该 SQL 不包括路由函数中的某些边并且位于结果区域内。

source: Given this area:
sv: Med tanke på detta område:

source: Calculate a route:
sv: Beräkna en rutt:

source: How to contribute
sv: Hur du bidrar
zh_hans: 如何贡献

source: Edit an existing `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`__ page.
sv: Redigera en befintlig sida i `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`__.
zh_hans: 编辑现有的 `pgRouting 维基 <https://github.com/pgRouting/pgrouting/wiki>`__ 页面。

source: Or create a new Wiki page
sv: Eller skapa en ny Wiki-sida
zh_hans: 或者创建一个新的维基 页面

source: Create a page on the `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`__
sv: Skapa en sida på `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`__
zh_hans: 在 `pgRouting 维基<https://github.com/pgRouting/pgrouting/wiki>`__上创建页面

source: Give the title an appropriate name
sv: Ge titeln ett lämpligt namn
zh_hans: 给标题起一个合适的名称

source: `Example <https://github.com/pgRouting/pgrouting/wiki/How-to:-Handle-parallel-edges-(KSP)>`__
sv: exempel <https://github.com/pgRouting/pgrouting/wiki/How-to:-Handle-parallel-edges-(KSP)>`__
zh_hans: `示例 <https://github.com/pgRouting/pgrouting/wiki/How-to:-Handle-parallel-edges-(KSP)>`__

source: Adding Functionality to pgRouting
sv: Lägga till funktionalitet i pgRouting

source: Consult the `developer's documentation <https://docs.pgrouting.org/doxy/2.4/index.html>`__
sv: Se dokumentationen för utvecklare <https://docs.pgrouting.org/doxy/2.4/index.html>`__
zh_hans: 查阅`开发者文档 <https://docs.pgrouting.org/doxy/2.4/index.html>`__

source: See also
sv: Se även

source: Instructions for downloading and installing binaries for different operating systems, additional notes and corrections not included in this documentation can be found in `Installation wiki <https://github.com/pgRouting/pgrouting/wiki/Notes-on-Download%2C-Installation-and-building-pgRouting>`__
sv: Instruktioner för nedladdning och installation av binärfiler för olika operativsystem, ytterligare anmärkningar och korrigeringar som inte ingår i denna dokumentation finns i `Installation wiki <https://github.com/pgRouting/pgrouting/wiki/Notes-on-Download%2C-Installation-and-building-pgRouting>`__
zh_hans: 有关下载和安装适用于不同操作系统的二进制文件的说明、本文档中未包含的其他注释和更正，可以在 `安装维基<https://github.com/pgRouting/pgrouting/wiki/Notes-on-Download%2C-Installation-and-building-pgRouting>`__中找到

source: To use pgRouting PostGIS needs to be installed, please read the information about installation in this `Install Guide <https://www.postgis.us/presentations/postgis_install_guide_22.html>`__
sv: För att använda pgRouting måste PostGIS installeras, läs informationen om installation i denna `Installationsguide <https://www.postgis.us/presentations/postgis_install_guide_22.html>`__
zh_hans: 使用pgRouting需要安装PostGIS，请阅读本`安装指南 <https://www.postgis.us/presentations/postgis_install_guide_22.html>`__中有关安装的信息

source: Short Version
sv: Kort version
zh_hans: 简洁版本

source: Extracting the tar ball
sv: Extrahera tar-bollen
zh_hans: 解压 tar 压缩文件

source: To compile assuming you have all the dependencies in your search path:
sv: För att kompilera förutsatt att du har alla beroenden i din sökväg:
zh_hans: 假设您的搜索路径中有所有依赖项，则进行编译：

source: Once pgRouting is installed, it needs to be enabled in each individual database you want to use it in.
sv: När pgRouting har installerats måste det aktiveras i varje enskild databas som du vill använda det i.
zh_hans: 安装 pgRouting 后，需要在您想要使用它的每个数据库中启用它。

source: Get the sources
sv: Hämta källorna
zh_hans: 获取来源

source: The pgRouting latest release can be found in https://github.com/pgRouting/pgrouting/releases/latest
sv: Den senaste versionen av pgRouting finns på https://github.com/pgRouting/pgrouting/releases/latest
zh_hans: pgRouting 最新版本可以在 https://github.com/pgRouting/pgrouting/releases/latest 中找到

source: To download this release:
sv: För att ladda ner denna release:
zh_hans: 要下载此版本：

source: Go to :ref:`install-short` for more instructions on extracting tar ball and compiling pgRouting.
sv: Gå till :ref:`install-short` för mer instruktioner om hur du extraherar tar ball och kompilerar pgRouting.
zh_hans: 转到:ref:`install-short`以获取有关提取 tar 包和编译 pgRouting 的更多说明。

source: To download the repository
sv: Så här laddar du ner arkivet
zh_hans: 下载存储库

source: Go to :ref:`install-short` for more instructions on compiling pgRouting (there is no tar ball involved while downloading pgRouting repository from GitHub).
sv: Gå till :ref:`install-short` för mer instruktioner om hur du kompilerar pgRouting (det finns ingen tarball inblandad när du laddar ner pgRouting-arkivet från GitHub).
zh_hans: 请参阅 :ref:`install-short` 获取有关编译 pgRouting 的更多说明（从 GitHub 下载 pgRouting 存储库时不涉及 tar 文件）。

source: Enabling and upgrading in the database
sv: Aktivering och uppgradering i databasen
zh_hans: 在数据库中启用和升级

source: Enabling the database
sv: Aktivering av databasen
zh_hans: 启用数据库

source: pgRouting is a PostgreSQL extension and depends on PostGIS to provide functionalities to end user. Below given code demonstrates enabling PostGIS and pgRouting in the database.
sv: pgRouting är en PostgreSQL-förlängning och beror på PostGIS för att tillhandahålla funktioner till slutanvändaren. Nedanstående kod demonstrerar aktivering av PostGIS och pgRouting i databasen.
zh_hans: pgRouting 是 PostgreSQL 扩展，依赖 PostGIS 向最终用户提供功能。 下面给出的代码演示了在数据库中启用 PostGIS 和 pgRouting。

source: Checking PostGIS and pgRouting version after enabling them in the database.
sv: Kontroll av PostGIS- och pgRouting-version efter att de har aktiverats i databasen.
zh_hans: 在数据库中启用 PostGIS 和 pgRouting 后检查它们的版本。

source: Upgrading the database
sv: Uppgradering av databasen
zh_hans: 升级数据库

source: To upgrade pgRouting in the database to version 4.0.0 use the following command:
sv: Använd följande kommando för att uppgradera pgRouting i databasen till version 4.0.0:

source: More information can be found in https://www.postgresql.org/docs/current/sql-createextension.html
sv: Mer information finns på https://www.postgresql.org/docs/current/sql-createextension.html
zh_hans: 更多信息可以在 https://www.postgresql.org/docs/current/sql-createextension.html 中找到

source: Dependencies
sv: Beroenden
zh_hans: 依赖

source: Compilation Dependencies
sv: Beroenden för kompilering
zh_hans: 编译依赖

source: To be able to compile pgRouting, make sure that the following dependencies are met:
sv: För att kunna kompilera pgRouting måste du se till att följande beroenden är uppfyllda:
zh_hans: 为了能够编译 pgRouting，请确保满足以下依赖项：

source: C and C++0x compilers
sv: C- och C++0x-kompilatorer
zh_hans: C 和 C++0x编译器

source: Compiling with Boost 1.56 up to Boost 1.74 requires C++ Compiler with C++03 or C++11 standard support
sv: Kompilering med Boost 1.56 upp till Boost 1.74 kräver C++-kompilator med standardstöd för C++03 eller C++11
zh_hans: 使用 Boost 1.56 到 Boost 1.74 进行编译需要具有 C++03 或 C++ 11 标准支持的 C ++编译器

source: Compiling with Boost 1.75 requires C++ Compiler with C++14 standard support
sv: Kompilering med Boost 1.75 kräver C++-kompilator med stöd för C++14-standarden
zh_hans: 使用 Boost 1.75 进行编译需要具有 C++ 14 标准支持的 C++ 编译器

source: Postgresql version = Supported versions by PostgreSQL
sv: Postgresql-version = Versioner som stöds av PostgreSQL
zh_hans: Postgresql 版本 = PostgreSQL 支持的版本

source: The Boost Graph Library (BGL). Version >= 1.56
sv: Boost Graph Library (BGL). Version >= 1.56
zh_hans: Boost 图库 (BGL)。 版本 >= 1.56

source: optional dependencies
sv: valfria beroenden
zh_hans: 可选的依赖项

source: For user's documentation
sv: För användardokumentation
zh_hans: 用于用户文档

source: For developer's documentation
sv: För dokumentation för utvecklare
zh_hans: 对于开发者文档

source: For testing
sv: För testning
zh_hans: 供测试用

source: For using:
sv: För användning:
zh_hans: 用于使用：

source: Example: Installing dependencies on linux
sv: Exempel: Installera beroenden på Linux
zh_hans: 示例：在 Linux 上安装依赖项

source: Installing the compilation dependencies
sv: Installera kompileringsberoendena
zh_hans: 安装编译依赖项

source: Database dependencies
sv: Beroenden till databaser
zh_hans: 数据库依赖

source: Configuring PostgreSQL
sv: Konfigurera PostgreSQL
zh_hans: 配置 PostgreSQL

source: Entering psql console
sv: Gå in i psql-konsolen
zh_hans: 进入psql控制台

source: To exit psql console
sv: Så här avslutar du psql-konsolen
zh_hans: 退出 psql 控制台

source: Entering psql console directly without switching roles can be done by the following commands
sv: Du kan gå in i psql-konsolen direkt utan att byta roll med följande kommandon
zh_hans: 直接进入psql控制台，无需切换角色，可以通过以下命令完成

source: Then use the above given method to exit out of the psql console
sv: Använd sedan ovanstående metod för att avsluta psql-konsolen
zh_hans: 然后使用上面给出的方法退出psql控制台

source: Checking PostgreSQL version
sv: Kontrollera PostgreSQL-versionen
zh_hans: 检查 PostgreSQL 版本

source: or
sv: eller
zh_hans: 或者

source: Enter the psql console using above given method and then enter
sv: Gå in i psql-konsolen med hjälp av ovanstående metod och ange sedan
zh_hans: 使用上面给定的方法进入psql控制台，然后输入

source: Creating PostgreSQL role
sv: Skapa PostgreSQL-roll
zh_hans: 创建 PostgreSQL 角色

source: Default role provided by PostgreSQL is postgres. To create new roles you can use the above provided commands. The prompt will ask the user to type name of the role and then provide affirmation. Proceed with the steps and you will succeed in creating PostgreSQL role successfully.
sv: Standardrollen som tillhandahålls av PostgreSQL är postgres. För att skapa nya roller kan du använda ovanstående kommandon. Prompten kommer att be användaren att skriva namnet på rollen och sedan ge bekräftelse. Fortsätt med stegen så kommer du att lyckas skapa PostgreSQL-rollen framgångsrikt.
zh_hans: PostgreSQL 提供的默认角色是 postgres。 要创建新角色，您可以使用上面提供的命令。 提示将要求用户输入角色名称，然后提供确认。 继续执行这些步骤，您将成功创建 PostgreSQL 角色。

source: To add password to the role or change previously created password of the role use the following commands
sv: Använd följande kommandon om du vill lägga till ett lösenord för rollen eller ändra ett tidigare skapat lösenord för rollen
zh_hans: 要向角色添加密码或更改之前创建的角色密码，请使用以下命令

source: To get additional details on the flags associated with ``createuser`` below given command can be used
sv: För att få ytterligare information om de flaggor som är associerade med ``createuser`` kan nedanstående kommando användas
zh_hans: 要获取与下面的 ``createuser``相关的标志的更多详细信息，可以使用给定的命令

source: Creating Database in PostgreSQL
sv: Skapa databas i PostgreSQL
zh_hans: 在 PostgreSQL 中创建数据库

source: Connecting to a PostgreSQL Database
sv: Ansluta till en PostgreSQL-databas
zh_hans: 连接到 PostgreSQL 数据库

source: Enter the psql console and type the following commands
sv: Gå till psql-konsolen och skriv följande kommandon
zh_hans: 进入psql控制台，输入以下命令

source: Build dependencies
sv: Bygg beroenden
zh_hans: 构建依赖关系

source: Optional dependencies
sv: Valfria beroenden
zh_hans: 可选依赖项

source: For documentation and testing
sv: För dokumentation och testning
zh_hans: 用于文档和测试

source: Configuring
sv: Konfigurering
zh_hans: 配置

source: pgRouting uses the `cmake` system to do the configuration.
sv: pgRouting använder `cmake`-systemet för att göra konfigurationen.
zh_hans: pgRouting 使用 `cmake`系统进行配置。

source: The build directory is different from the source directory
sv: Byggkatalogen skiljer sig från källkatalogen
zh_hans: 构建目录与源目录不同

source: Create the build directory
sv: Skapa byggkatalogen
zh_hans: 创建构建目录

source: Configurable variables
sv: Konfigurerbara variabler
zh_hans: 可配置变量

source: To see the variables that can be configured
sv: För att se vilka variabler som kan konfigureras
zh_hans: 查看可以配置的变量

source: Configuring The Documentation
sv: Konfigurera dokumentationen
zh_hans: 配置文档

source: Most of the effort of the documentation has been on the HTML files. Some variables for building documentation:
sv: Det mesta av arbetet med dokumentationen har lagts på HTML-filerna. Några variabler för att bygga dokumentation:
zh_hans: 文档的大部分工作都集中在 HTML 文件上。 构建文档的一些变量：

source: Variable
sv: Variabel
zh_hans: 变量

source: Comment
sv: Kommentar
zh_hans: 解释

source: WITH_DOC
sv: MED_DOK

source: Turn on/off building the documentation
sv: Aktivera/avaktivera skapandet av dokumentation
zh_hans: 打开/关闭构建文档

source: If ON, turn on/off building HTML for user's documentation
sv: Om ON, aktivera/avaktivera HTML-skapande för användardokumentation
zh_hans: 如果打开，则打开/关闭为用户文档构建 HTML

source: BUILD_DOXY
sv: BYGG_DOXY

source: If ON, turn on/off building HTML for developer's documentation
sv: Om ON, aktivera/avaktivera HTML-skapande för utvecklarens dokumentation
zh_hans: 如果打开，则打开/关闭为开发人员文档构建 HTML

source: If ON, turn on/off building PDF
sv: Om ON, slå på/av byggnad PDF
zh_hans: 如果打开，则打开/关闭构建 PDF

source: BUILD_MAN
sv: BYGGHANDLARE

source: If ON, turn on/off building MAN pages
sv: Om ON, aktivera/avaktivera byggnadens MAN-sidor
zh_hans: 如果为 ON，则打开/关闭构建 MAN 页面

source: DOC_USE_BOOTSTRAP
sv: DOC_ANVÄNDA_BOOTSTRAP

source: If ON, use sphinx-bootstrap for HTML pages of the users documentation
sv: Om PÅ, använd sphinx-bootstrap för HTML-sidor i användardokumentationen
zh_hans: 如果打开，则对用户文档的 HTML 页面使用 sphinx-bootstrap

source: Configuring cmake to create documentation before building pgRouting
sv: Konfigurera cmake för att skapa dokumentation innan pgRouting byggs
zh_hans: 在构建 pgRouting 之前配置 cmake 创建文档
