Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Works for **directed** graphs.
sv: Fungerar för **riktade** grafer.
zh_hans: 适用于**有向**图。

source: Components are described by vertices identifiers.
sv: Komponenterna beskrivs med hjälp av identifierare för vertikalerna.
zh_hans: 组件由顶点标识符描述。

source: The strong components of the graph
sv: De starka komponenterna i grafen
zh_hans: 图的重要组成部分

source: `Boost: Strong components <https://www.boost.org/libs/graph/doc/strong_components.html>`__
sv: `Boost: Starka komponenter <https://www.boost.org/libs/graph/doc/strong_components.html>`__

source: wikipedia: `Strongly connected component <https://en.wikipedia.org/wiki/Strongly_connected_component>`__
sv: wikipedia: `Starkt ansluten komponent <https://en.wikipedia.org/wiki/Strongly_connected_component>`__
zh_hans: 维基百科: `强连通分量 <https://en.wikipedia.org/wiki/Strongly_connected_component>`__

source: ``pgr_topologicalSort`` - Experimental
sv: ``pgr_topologicalSort`` - Experimentell
zh_hans: ``pgr_topologicalSort`` - 实验

source: ``pgr_topologicalSort`` — Linear ordering of the vertices for directed acyclic graphs (DAG).
sv: ``pgr_topologicalSort`` - Linjär ordning av topparna för riktade acykliska grafer (DAG).
zh_hans: ``pgr_topologicalSort`` — 有向无环图 (DAG) 的顶点的线性排序。

source: The topological sort algorithm creates a linear ordering of the vertices such that if edge :math:`(u,v)` appears in the graph, then :math:`v` comes before :math:`u` in the ordering.
sv: Den topologiska sorteringsalgoritmen skapar en linjär ordning av hörnen så att om kanten :math:`(u,v)` förekommer i grafen, så kommer :math:`v` före :math:`u` i ordningen.
zh_hans: 拓扑排序算法创建了一个顶点的线性排序，使得如果图中存在边 :math:`(u,v)`，则在排序中 :math:`v` 出现在 :math:`u` 之前。

source: Process is valid for directed acyclic graphs only. otherwise it will throw warnings.
sv: Processen är endast giltig för riktade acykliska grafer. annars kommer den att ge varningar.
zh_hans: 该过程仅对有向无环图有效。 否则它会抛出警告。

source: For optimization purposes, if there are more than one answer, the function
sv: För optimeringsändamål, om det finns mer än ett svar, kan funktionen
zh_hans: 出于优化目的，如果有多个答案，则该函数

source: will return one of them.
sv: kommer att returnera en av dem.
zh_hans: 将返回其中之一。

source: The returned values are ordered in topological order:
sv: De returnerade värdena är ordnade i topologisk ordning:
zh_hans: 返回的值按拓扑顺序排序：

source: Topologically sorting the graph
sv: Topologisk sortering av grafen
zh_hans: 对图进行拓扑排序

source: Sequential value starting from :math:`1`
sv: Sekventiellt värde med början från :math:`1`
zh_hans: 从 :math:`1` 开始的连续数值

source: Linear topological ordering of the vertices
sv: Linjär topologisk ordning av hörnen
zh_hans: 顶点的线性拓扑排序

source: Additional examples
sv: Ytterligare exempel
zh_hans: 其他示例

source: Topologically sorting the one way segments
sv: Topologisk sortering av enkelriktade segment
zh_hans: 对单向段进行拓扑排序

source: Graph is not a DAG
sv: Grafen är inte en DAG
zh_hans: 图不是 DAG

source: `Boost: topological sort <https://www.boost.org/libs/graph/doc/topological_sort.html>`__
sv: `Boost: topologisk sortering <https://www.boost.org/libs/graph/doc/topological_sort.html>`__

source: ``pgr_transitiveClosure`` - Experimental
sv: ``pgr_transitiveClosure`` - Experimentell
zh_hans: ``pgr_transitiveClosure`` - 实验

source: ``pgr_transitiveClosure`` — Transitive closure graph of a directed graph.
sv: ``pgr_transitiveClosure`` - Transitiv stängningsgraf för en riktad graf.
zh_hans: ``pgr_transitiveClosure`` — 有向图的传递闭包图。

source: Transforms the input directed graph into the transitive closure of the graph.
sv: Transformerar den inmatade riktade grafen till grafens transitiva slutenhet.
zh_hans: 将输入有向图转换为图的传递闭包。

source: Process is valid for directed graphs.
sv: Processen är giltig för riktade grafer.
zh_hans: 过程对于有向图有效。

source: The transitive closure of an undirected graph produces a cluster graph
sv: Den transitiva stängningen av en odelad graf ger en klustergraf
zh_hans: 无向图的传递闭包产生簇图

source: Reachability between vertices on an undirected graph happens when they belong to the same connected component. (see :doc:`pgr_connectedComponents`)
sv: Nåbarhet mellan hörn i en odelad graf uppstår när de tillhör samma sammankopplade komponent. (se :doc:`pgr_connectedComponents`)
zh_hans: 当无向图上的顶点属于同一连通分量时，就会发生它们之间的可达性。（参阅:doc:`pgr_connectedComponents`）

source: The returned values are not ordered
sv: De returnerade värdena är inte ordnade
zh_hans: 返回值未排序

source: The returned graph is compressed
sv: Den returnerade grafen är komprimerad

source: Running time: :math:`O(|V||E|)`
sv: Speltid: :math:`O(|V||E|)`
zh_hans: 运行时间：:math:`O(|V||E|)`

source: The pgr_transitiveClosure function has the following signature:
sv: Funktionen pgr_transitiveClosure har följande signatur:
zh_hans: pgr_transitiveClosure 函数具有以下签名：

source: Returns set of |result-closure|
sv: Returnerar uppsättning av |result-closure|

source: Rechability of a subgraph
sv: Rechability av en delgraf
zh_hans: 子图的可达性

source: Identifier of the source of the edges
sv: Identifierare av källan till kanterna
zh_hans: 边来源的标识符

source: ``target_array``
sv: ``Målgrupp``

source: Identifiers of the targets of the edges
sv: Identifierare av målen för kanterna
zh_hans: 边目标的标识符

source: Identifiers of the vertices that are reachable from vertex v.
sv: Identifierare för de toppar som är nåbara från topp v.
zh_hans: 从顶点 v 可到达的顶点的标识符。

source: `Boost: transitive closure <https://www.boost.org/libs/graph/doc/transitive_closure.html>`__
sv: `Boost: transitiv stängning <https://www.boost.org/libs/graph/doc/transitive_closure.html>`__

source: ``pgr_trsp`` - routing vertices with restrictions.
sv: ``pgr_trsp`` - routing av toppar med restriktioner.
zh_hans: ``pgr_trsp`` -有限制的路由顶点。

source: Deprecated signatures
sv: Föråldrade signaturer

source: New prototypes
sv: Nya prototyper

source: Turn restricted shortest path (TRSP) is an algorithm that receives turn restrictions in form of a query like those found in real world navigable road networks.
sv: Turn restricted shortest path (TRSP) är en algoritm som tar emot svängrestriktioner i form av en fråga, liknande de som finns i verkliga vägnät.
zh_hans: 转弯限制最短路径 (TRSP) 是一种以查询形式接收转弯限制的算法，就像在现实世界的可通航道路网络中发现的那样。

source: It does no guarantee the shortest path as it might contain restriction paths.
sv: Den garanterar inte den kortaste vägen eftersom den kan innehålla begränsande vägar.
zh_hans: 它不保证最短路径，因为它可能包含限制路径。

source: The general algorithm is as follows:
sv: Den allmänna algoritmen är som följer:
zh_hans: 通用算法如下：

source: Execute a Dijkstra.
sv: Utför en Dijkstra.
zh_hans: 执行 Dijkstra。

source: If the solution passes thru a restriction then.
sv: Om lösningen passerar genom en begränsning då.
zh_hans: 如果解决方案通过了限制。

source: Execute the **TRSP** algorithm with restrictions.
sv: Utför **TRSP**-algoritmen med begränsningar.
zh_hans: 有限制地执行 **TRSP** 算法。

source: From vertex :math:`6` to vertex :math:`10` on an undirected graph.
sv: Från toppunkt :math:`6` till toppunkt :math:`10` i en odelad graf.
zh_hans: 从无向图上的顶点 :math:`6` 到顶点 :math:`10`.

source: From vertex :math:`6` to vertices :math:`\{10, 1\}` on an undirected graph.
sv: Från toppunkten :math:`6` till toppunkterna :math:`\{10, 1\}` i en odelad graf.
zh_hans: 无向图上从顶点:math:`6` 到顶点 :math:`\{10, 1\}` 。

source: From vertices :math:`\{6, 1\}` to vertex :math:`8` on a directed graph.
sv: Från topparna :math:`\{6, 1\}` till topparna :math:`8` i en riktad graf.
zh_hans: 有向图上从顶点 :math:`\{6, 1\}`到顶点 :math:`8`。

source: From vertices :math:`\{6, 1\}` to vertices :math:`\{10, 8\}` on an undirected graph.
sv: Från hörn :math:`\{6, 1\}` till hörn :math:`\{10, 8\}` i en odelad graf.
zh_hans: 无向图上从顶点 :math:`\{6, 1\}`到顶点 :math:`\{10, 8\}`。

source: Using a combinations table on an undirected graph.
sv: Använda en kombinationstabell på en ostyrd graf.
zh_hans: 在无向图上使用组合表。

source: `Deprecated documentation <https://docs.pgrouting.org/3.3/en/pgr_trsp.html>`_
sv: föråldrad dokumentation <https://docs.pgrouting.org/3.3/en/pgr_trsp.html>`_
zh_hans: `已弃用文档 <https://docs.pgrouting.org/3.3/en/pgr_trsp.html>`_

source: ``pgr_trspVia`` Route that goes through a list of vertices with restrictions.
sv: ``pgr_trspVia`` Rutt som går igenom en lista med toppar med restriktioner.
zh_hans: ``pgr_trspVia``穿过有限制的顶点列表的路线。

source: Given a list of vertices and a graph, this function is equivalent to finding the shortest path between :math:`vertex_i` and :math:`vertex_{i+1}` for all :math:`i < size\_of(via\;vertices)` trying not to use restricted paths.
sv: Givet en lista med toppar och en graf är denna funktion likvärdig med att hitta den kortaste vägen mellan :math:`vertex_i` och :math:`vertex_{i+1}` för alla :math:`i < size\_of(via\;toppar)` och försöker att inte använda begränsade vägar.
zh_hans: 给定一个顶点列表和一个图，这个函数等同于在所有:math:`i < size\_of(via\;vertices)`的情况下找到从 :math:`vertex_i`到 :math:`vertex_{i+1}`的最短路径，尽量避免使用受限路径。

source: The paths represents the sections of the route.
sv: Banorna representerar de olika delarna av rutten.
zh_hans: 路径代表路线的各个部分。

source: Execute a :doc:`pgr_dijkstraVia`.
sv: Exekvera en :doc:`pgr_dijkstraVia`.
zh_hans: 执行 :doc:`pgr_dijkstraVia`。

source: For the set of sub paths of the solution that pass through a restriction then
sv: För uppsättningen delvägar för lösningen som passerar genom en begränsning gäller följande
zh_hans: 对于通过限制的解决方案的子路径集，则

source: Execute the **TRSP** algorithm with restrictions for the paths.
sv: Utför **TRSP**-algoritmen med begränsningar för banorna.
zh_hans: 执行对路径有限制的 **TRSP** 算法。

source: **NOTE** when this is done, ``U_turn_on_edge`` flag is ignored.
sv: **NOTE** när detta görs ignoreras flaggan ``U_turn_on_edge``.
zh_hans: **注意**，完成此操作后， ``U_turn_on_edge``标志将被忽略。

source: All this examples are about the route that visits the vertices :math:`\{5, 7, 1, 8, 15\}` in that order on a directed graph.
sv: Alla dessa exempel handlar om den rutt som besöker topparna :math:`\{5, 7, 1, 8, 15\}` i den ordningen i en riktad graf.
zh_hans: 所有这些示例都是关于按有向图上的顺序访问顶点 :math:`\{5, 7, 1, 8, 15\}` 的路线。

source: Simulation of how algorithm works.
sv: Simulering av hur algoritmen fungerar.
zh_hans: 模拟算法的工作原理。

source: The algorithm performs a :doc:`pgr_dijkstraVia`
sv: Algoritmen utför en :doc:`pgr_dijkstraVia`
zh_hans: 该算法执行 :doc:`pgr_dijkstraVia`

source: Detects which of the sub paths pass through a restriction in this case is for the ``path_id = 5`` from ``6`` to ``3`` because the path :math:`15 \rightarrow 1` is restricted.
sv: Detekterar vilka av undervägarna som passerar genom en begränsning i det här fallet är för ``väg_id = 5`` från ``6`` till ``3`` eftersom vägen :math:`15 \rightarrow 1` är begränsad.
zh_hans: 检测哪些子路径通过了限制，本例中是针对``path_id = 5``从``6``到``3`` ，因为该路径 :math:`15 \rightarrow 1`受到限制。

source: Executes the :doc:`pgr_trsp` algorithm for the conflicting paths.
sv: Exekverar :doc:`pgr_trsp`-algoritmen för de motstridiga vägarna.
zh_hans: 执行 :doc:`pgr_trsp` 针对冲突路径建议的算法。

source: From the :doc:`pgr_dijkstraVia` result it removes the conflicting paths and builds the solution with the results of the :doc:`pgr_trsp` algorithm:
sv: Från :doc:`pgr_dijkstraVia`-resultatet tar den bort de motstridiga vägarna och bygger lösningen med resultaten från :doc:`pgr_trsp`-algoritmen:
zh_hans: 从 :doc:`pgr_dijkstraVia` 提议的结果中，它删除了冲突路径，并使用 :doc:`pgr_trsp` 提议的算法的结果构建解决方案：

source: Getting the same result as ``pgr_trspVia``:
sv: Får samma resultat som ``pgr_trspVia``:
zh_hans: 得到与 ``pgr_trspVia`` 相同的结果：

source: Example 8
sv: Exempel 8
zh_hans: 示例8

source: Sometimes ``U_turn_on_edge`` flag is ignored when is set to ``false``.
sv: Ibland ignoreras flaggan ``U_turn_on_edge`` när den är satt till ``false``.
zh_hans: 有时，当设置为 ``false`` 时，``U_turn_on_edge`` 标志会被忽略。

source: The first step, doing a :doc:`pgr_dijkstraVia` does consider not making a U turn on the same edge. But the path :math:`16 \rightarrow 13` (Rows 4 and 5) is restricted and the result is using it.
sv: Det första steget, att göra en :doc:`pgr_dijkstraVia` tar hänsyn till att inte göra en U-sväng på samma kant. Men sökvägen :math:`16 \rightarrow 13` (rad 4 och 5) är begränsad och resultatet använder den.
zh_hans: 第一步，进行 :doc:`pgr_dijkstraVia`不考虑在同一边上掉头。 但路径 :math:`16 \rightarrow 13`（第 4 行和第 5 行）受到限制，结果正在使用它。

source: When executing the :doc:`pgr_trsp` algorithm for the conflicting path, there is no ``U_turn_on_edge`` flag.
sv: När :doc:`pgr_trsp`-algoritmen körs för den konfliktfyllda banan finns det ingen flagga för ``U_turn_on_edge``.
zh_hans: 当执行 :doc:`pgr_trsp`针对冲突路径的拟议算法时，没有 ``U_turn_on_edge`` 标志。

source: Therefore the result ignores the ``U_turn_on_edge`` flag when set to ``false``.
sv: Därför ignorerar resultatet flaggan ``U_turn_on_edge`` när den är inställd på ``false``.
zh_hans: 因此，当设置为 ``false`` 时，结果会忽略 ``U_turn_on_edge`` 标志。

source: ``pgr_trspVia_withPoints``
sv: ``pgr_trspVia_medPunkter``

source: ``pgr_trspVia_withPoints`` - Route that goes through a list of vertices and/or points with restrictions.
sv: ``pgr_trspVia_withPoints`` - Rutt som går igenom en lista med toppar och/eller punkter med restriktioner.
zh_hans: ``pgr_trspVia_withPoints`` - 经过一系列具有限制的顶点和/或点的路线。

source: Given a graph, a set of restriction on the graph edges, a set of points on the graphs edges and a list of vertices, this function is equivalent to finding the shortest path between :math:`vertex_i` and :math:`vertex_{i+1}` (where :math:`vertex` can be a vertex or a point on the graph) for all :math:`i < size\_of(via\;vertices)` trying not to use restricted paths.
sv: Med tanke på en graf, en uppsättning begränsningar på grafens kanter, en uppsättning punkter på grafens kanter och en lista med vertexer, är denna funktion likvärdig med att hitta den kortaste vägen mellan :math:`vertex_i` och :math:`vertex_{i+1}` (där :math:`vertex` kan vara en vertex eller en punkt i grafen) för alla :math:`i < size\_of(via\;vertices)` och försöker att inte använda begränsade vägar.
zh_hans: 给定一个图、对图边的一组限制、图边上的一组点和一个顶点列表，该函数相当于查找 :math:`vertex_i` 和 :math:`vertex_{i+1}`之间的最短路径（其中 :math:`vertex` 可以是图上的顶点或点） ）对于所有 :math:`i < size\_of(via\;vertices)`尝试不使用受限路径的人。

source: is a sequence of paths
sv: är en sekvens av banor
zh_hans: 是一系列路径

source: Build the Graph with the new points.
sv: Bygg grafen med de nya punkterna.
zh_hans: 用新点构建图表。

source: The points identifiers will be converted to negative values.
sv: Punkternas identifierare kommer att omvandlas till negativa värden.
zh_hans: 点标识符将转换为负值。

source: The vertices identifiers will remain positive.
sv: Topparnas identifierare kommer att förbli positiva.
zh_hans: 顶点标识符将保持正值。

source: Execute a :doc:`pgr_withPointsVia`.
sv: Exekvera en :doc:`pgr_withPointsVia`.
zh_hans: 执行 :doc:`pgr_withPointsVia`。

source: For the set of paths of the solution that pass through a restriction then
sv: För uppsättningen av vägar för lösningen som passerar genom en restriktion gäller följande
zh_hans: 对于通过限制的解决方案的路径集合，则

source: Execute the **TRSP** algorithm with restrictions for the path.
sv: Utför **TRSP**-algoritmen med begränsningar för banan.
zh_hans: 执行对路径有限制的 **TRSP** 算法。

source: Do not use negative values on identifiers of the inner queries.
sv: Använd inte negativa värden på identifierare för de inre frågorna.
zh_hans: 不要在内部查询的标识符上使用负值。

source: Find the route that visits the vertices :math:`\{-6, 15, -5\}` in that order on an directed graph.
sv: Hitta den rutt som besöker topparna :math:`\{-6, 15, -5\\}` i den ordningen i en riktad graf.
zh_hans: 在有向图上查找按顺序访问顶点 :math:`\{-6, 15, -5\}`的路线。

source: When positive it is considered a vertex identifier
sv: När den är positiv betraktas den som en vertexidentifierare
zh_hans: 当为正时，它被视为顶点标识符

source: When negative it is considered a point identifier
sv: När den är negativ betraktas den som en punktidentifierare
zh_hans: 当负数时，它被认为是一个点标识符

source: **driving side**
sv: **körning på sidan**

source: Value in [``r``, ``R``, ``l``, ``L``, ``b``, ``B``] indicating if the driving side is:
sv: Värde i [``r``, ``R``, ``l``, ``L``, ``b``, ``B``] som anger om förarsidan är:
zh_hans: 值在 [``r``, ``R``, ``l``, ``L``, ``b``, ``B``] 中表示驾驶的一侧是：

source: [``r``, ``R``] for right driving side (for directed graph only)
sv: [``r``, ``R``] för höger körsida (endast för riktad graf)
zh_hans: [``r``, ``R``] 表示右侧驾驶（仅适用于有向图）

source: [``l``, ``L``] for left driving side (for directed graph only)
sv: [``l``, ``L``] för vänster körsida (endast för riktad graf)
zh_hans: [``l``, ``L``]表示左侧驾驶（仅适用有向图）

source: [``b``, ``B``] for both (only for undirected graph)
sv: [``b``, ``B``] för båda (endast för oriktad graf)
zh_hans: [``b``, ``B``] 表示两侧通行（仅适用于无向图）

source: With points optional parameters
sv: Med punkter valfria parametrar
zh_hans: 带点可选参数

source: ``details``
sv: ``detaljer``

source: For showing points stops.
sv: För att visa punkter stoppar.

source: When ``true`` the results will include the points that are in the path.
sv: När ``true`` visas kommer resultaten att inkludera de punkter som ligger i banan.
zh_hans: 如果为 ``true``，结果将包括路径中的点。

source: When ``false`` the results will not include the points that are in the path.
sv: När ``false`` visas kommer resultaten inte att omfatta de punkter som ligger i banan.
zh_hans: 如果为``false``，结果将不包括路径中的点。

source: When ``start_vid``, ``end_vid`` and ``node`` columns have negative values, the identifier is for a Point.
sv: När kolumnerna ``start_vid``, ``end_vid`` och ``node`` har negativa värden är identifieraren för en Point.
zh_hans: 当 ``start_vid``、 ``end_vid``和``node``列具有负值时，该标识符用于Point。

source: Use ``pgr_findCloseEdges`` for points on the fly
sv: Använd ``pgr_findCloseEdges`` för punkter i farten
zh_hans: 对动态点使用 ``pgr_findCloseEdges``

source: Using :doc:`pgr_findCloseEdges`:
sv: Använder :doc:`pgr_findCloseEdges`:
zh_hans: 使用:doc:`pgr_findCloseEdges`:

source: Visit from vertex :math:`1` to the two locations on the graph of point `(2.9, 1.8)` in order of closeness to the graph.
sv: Besök från toppunkten :math:`1` till de två platserna på grafen för punkten `(2,9, 1,8)` i ordning efter närhet till grafen.
zh_hans: 从顶点 :math:`1` 开始，按照距离图形最近的顺序访问点 `(2.9, 1.8)` 上的两个位置。

source: Point :math:`-1` corresponds to the closest edge from point `(2.9, 1.8)`.
sv: Punkten :math:`-1` motsvarar den närmaste kanten från punkten `(2,9, 1,8)`.
zh_hans: 点:math:`-1`对应于距离点`(2.9, 1.8)` 最近的边。

source: Point :math:`-2` corresponds to the next close edge from point `(2.9, 1.8)`.
sv: Punkten :math:`-2` motsvarar nästa nära kant från punkten `(2,9, 1,8)`.
zh_hans: 点 :math:`-2`对应于点`(2.9, 1.8)` 的下一个闭合边。

source: Point :math:`-2` is visited on the route to from vertex :math:`1` to Point :math:`-1` (See row where :math:`seq = 4`).
sv: Punkt :math:`-2` besöks på rutten till från toppunkt :math:`1` till punkt :math:`-1` (Se rad där :math:`seq = 4`).
zh_hans: 点 :math:`-2`在从顶点 :math:`1` 到点 :math:`-1`的路线上被访问（参见行 ，其中:math:`seq = 4`）。

source: Usage variations
sv: Variationer i användning
zh_hans: 用法变化

source: All this examples are about the route that visits the vertices :math:`\{-6, 7, -4, 8, -2\}` in that order on a directed graph.
sv: Alla dessa exempel handlar om den rutt som besöker topparna :math:`\{-6, 7, -4, 8, -2\\}` i den ordningen i en riktad graf.
zh_hans: 所有这些示例都是关于按有向图上的顺序访问顶点:math:`\{-6, 7, -4, 8, -2\}`的路线。

source: Status of "passes in front" or "visits" of the nodes and points.
sv: Status för "passeringar framför" eller "besök" av noder och punkter.
zh_hans: 节点、点的"通过"或"访问"状态。

source: The algorithm performs a :doc:`pgr_withPointsVia`
sv: Algoritmen utför en :doc:`pgr_withPointsVia`
zh_hans: 该算法执行:doc:`pgr_withPointsVia`

source: Detects which of the paths pass through a restriction in this case is for the ``path_id = 1`` from ``-6`` to ``15`` because the path :math:`9 \rightarrow 16` is restricted.
sv: Detekterar vilka av sökvägarna som passerar genom en begränsning i detta fall är för ``path_id = 1`` från ``-6`` till ``15`` eftersom sökvägen :math:`9 \rightarrow 16` är begränsad.
zh_hans: 检测哪些路径通过了限制，在本例中是针对从 ``-6``到``15`` 的 ``path_id = 1``，因为路径:math:`9 \rightarrow 16`受到限制。

source: Executes the :ref:`TRSP-family:TRSP algorithm` for the conflicting paths.
sv: Exekverar :ref:`TRSP-family:TRSP-algoritmen` för de motstridiga sökvägarna.
zh_hans: 对冲突路径执行 :ref:`TRSP-family:TRSP 算法`。

source: From the :doc:`pgr_withPointsVia` result it removes the conflicting paths and builds the solution with the results of the :doc:`pgr_trsp` algorithm:
sv: Från resultatet av :doc:`pgr_withPointsVia` tar den bort de motstridiga vägarna och bygger lösningen med resultaten av algoritmen :doc:`pgr_trsp`:
zh_hans: 从 :doc:`pgr_withPointsVia` 的结果中移除冲突的路径，并使用 :doc:`pgr_trsp` 算法的结果构建解决方案：

source: Getting the same result as ``pgr_trspVia_withPoints``:
sv: Får samma resultat som ``pgr_trspVia_withPoints``:
zh_hans: 得到与 ``pgr_trspVia_withPoints``相同的结果：

source: The first step, doing a :doc:`pgr_withPointsVia` does consider not making a U turn on the same edge. But the path :math:`9 \rightarrow 16` (Rows 4 and 5) is restricted and the result is using it.
sv: Det första steget, att göra en :doc:`pgr_withPointsVia` tar hänsyn till att inte göra en U-sväng på samma kant. Men banan :math:`9 \rightarrow 16` (rad 4 och 5) är begränsad och resultatet är att använda den.
zh_hans: 第一步，执行 :doc:`pgr_withPointsVia`不考虑在同一边上掉头。 但路径 :math:`9 \rightarrow 16`（第 4 行和第 5 行）受到限制，结果正在使用它。

source: When executing the :doc:`pgr_trsp_withPoints` algorithm for the conflicting path, there is no ``U_turn_on_edge`` flag.
sv: När algoritmen :doc:`pgr_trsp_withPoints` exekveras för den konfliktfyllda banan finns det ingen flagga ``U_turn_on_edge``.
zh_hans: 当执行 :doc:`pgr_trsp_withPoints` 针对冲突路径的算法时，没有 ``U_turn_on_edge`` 标志。

source: Therefore the result ignores the ``U_turn_on_edge`` flag when set to ``false``. From the :doc:`pgr_withPointsVia` result it removes the conflicting paths and builds the solution with the results of the :doc:`pgr_trsp` algorithm. In this case a U turn is been done using the same edge.
sv: Därför ignorerar resultatet flaggan ``U_turn_on_edge`` när den är inställd på ``false``. Från :doc:`pgr_withPointsVia`-resultatet tar den bort de motstridiga vägarna och bygger lösningen med resultaten från :doc:`pgr_trsp`-algoritmen. I det här fallet har en U-sväng gjorts med samma kant.
zh_hans: 因此，当设置为 ``false`` 时，结果会忽略 ``U_turn_on_edge`` 标志。 从 :doc:`pgr_withPointsVia`结果中，它删除了冲突路径，并使用 :doc:`pgr_trsp` 算法的结果构建解决方案。 在这种情况下，使用相同的边缘完成 U 形转弯。

source: ``pgr_trsp_withPoints``
sv: ``pgr_trsp_medPunkter``

source: ``pgr_trsp_withPoints`` Routing Vertex/Point with restrictions.
sv: ``pgr_trsp_withPoints`` Routing Vertex/Point med restriktioner.
zh_hans: ``pgr_trsp_withPoints``有限制的路由顶点/点。

source: Modify the graph to include points defined by `Points SQL`_. Consider the invalid paths on `Restrictions SQL`_. Using Dijkstra algorithm, find the shortest path.
sv: Modifiera grafen så att den innehåller punkter definierade av `Points SQL`_. Beakta de ogiltiga vägarna i `Restrictions SQL`_. Använd Dijkstra-algoritmen för att hitta den kortaste vägen.

source: Vertices of the graph are:
sv: Grafens hörn är:
zh_hans: 图的顶点是：

source: **positive** when it belongs to the `Edges SQL`_
sv: **positiv** när den tillhör `Edges SQL`__
zh_hans: 当它属于`Edges SQL`_ 时为**正**

source: **negative** when it belongs to the `Points SQL`_
sv: **negativ** när den tillhör `Points SQL`_
zh_hans: 当它属于 `Points SQL`_为**负**

source: The `agg_cost` in the non included values `(v, v)` is `0`
sv: "Agg_cost" i de icke inkluderade värdena "v, v" är "0"
zh_hans: 非包含值`(v, v)`中的`agg_cost`为`0`

source: The `agg_cost` in the non included values `(u, v)` is :math:`\infty`
sv: Agg_cost i de icke inkluderade värdena `(u, v)` är :math:`\infty`
zh_hans: 非包含值 `(u, v)`中的 `agg_cost`为:math:`\infty`
