Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: For optimization purposes, any duplicated value in the input arrays of **start vids** or **end vids** or are ignored.
sv: För optimeringsändamål ignoreras alla duplicerade värden i inmatningsmatriserna för **start vids** eller **end vids** eller.

source: Running time: :math:`O(|start\_vids|\times(V \log V + E))`
sv: Drifttid: :math:`O(|start\_vids|\times(V \log V + E))`
zh_hans: 运行时间： :math:`O(|start\_vids|\times(V \log V + E))`

source: From point :math:`1` to vertex :math:`10` with right driving side in directed graph. (with details)
sv: Från punkt :math:`1` till toppunkt :math:`10` med höger drivsida i riktad graf. (med detaljer)

source: From point :math:`1` to point :math:`3` and vertex :math:`7` on an undirected graph
sv: Från punkt :math:`1` till punkt :math:`3` och toppunkt :math:`7` på en odelad graf
zh_hans: 无向图上的点:math:`1`到点 :math:`3`和顶点 :math:`7`

source: From point :math:`1` and vertex :math:`6` to point :math:`3` with right driving side in directed graph. (without details)
sv: Från punkt :math:`1` och toppunkt :math:`6` till punkt :math:`3` med höger drivsida i riktad graf. (utan detaljer)

source: From point :math:`1` and vertex :math:`6` to point :math:`3` and vertex :math:`1` with left side driving.
sv: Från punkt :math:`1` och toppunkt :math:`6` till punkt :math:`3` och toppunkt :math:`1` med körning på vänster sida.

source: Two combinations
sv: Två kombinationer
zh_hans: 两种组合

source: From point :math:`1` to vertex :math:`10`, and from vertex :math:`6` to point :math:`3` with right side driving. (with details)
sv: Från punkt :math:`1` till toppunkt :math:`10`, och från toppunkt :math:`6` till punkt :math:`3` med högerkörning. (med detaljer)

source: Use :doc:`pgr_findCloseEdges` in the `Points SQL`_.
sv: Använd :doc:`pgr_findCloseEdges` i `Points SQL`_.
zh_hans: 在 `Points SQL`_ 中使用 :doc:`pgr_findCloseEdges` 。

source: Find the routes from vertex :math:`1` to the two closest locations on the graph of point `(2.9, 1.8)`.
sv: Hitta vägarna från toppunkten :math:`1` till de två närmaste platserna på grafen för punkten `(2,9, 1,8)`.
zh_hans: 找到从顶点 :math:`1` 到点 `(2.9, 1.8)` 图上两个最近位置的路线。

source: All the examples are about traveling from point :math:`1` and vertex :math:`5` to points :math:`\{2, 3, 6\}` and vertices :math:`\{10, 11\}` with restrictions
sv: Alla exempel handlar om att resa från punkt :math:`1` och toppunkt :math:`5` till punkter :math:`\{2, 3, 6\}` och toppunkter :math:`\{10, 11\}` med restriktioner

source: Passes in front or visits with right side driving.
sv: Passerar framför eller besöker med högerkörning.
zh_hans: 从前方超车或右侧行驶来访。

source: For point :math:`6` and vertex :math:`11`.
sv: För punkt :math:`6` och toppunkt :math:`11`.
zh_hans: 对于点 :math:`6`和顶点 :math:`11`。

source: Passes in front or visits with left side driving.
sv: Passerar framför eller besöker med vänsterkörning.
zh_hans: 从前方超车或以左侧驾驶方式行驶。

source: ``pgr_turnRestrictedPath`` - Experimental
sv: ``pgr_turnRestrictedPath`` - Experimentell

source: ``pgr_turnRestrictedPath`` Using Yen's algorithm Vertex - Vertex routing with restrictions
sv: ``pgr_turnRestrictedPath`` Använd Yen's algoritm Vertex - Vertex routing med restriktioner

source: Using Yen's algorithm to obtain K shortest paths and analyze the paths to select the paths that do not use the restrictions
sv: Använd Yen's algoritm för att få K kortaste vägar och analysera vägarna för att välja de vägar som inte använder begränsningarna
zh_hans: 利用Yen算法获得K条最短路径并对路径进行分析以选择不使用限制的路径

source: From vertex :math:`3` to vertex :math:`8` on a directed graph
sv: Från toppunkt :math:`3` till toppunkt :math:`8` på en riktad graf
zh_hans: 从有向图上的顶点 :math:`3` 到顶点 :math:`8`

source: Special optional parameters
sv: Särskilda valfria parametrar
zh_hans: 特殊可选参数

source: ``stop_on_first``
sv: ``stopp_på_första``

source: When ``true`` stops on first path found that dos not violate restrictions
sv: När ``true`` stannar på första bästa väg som inte bryter mot restriktioner
zh_hans: 当 ``true`` 停止在发现不违反限制的第一条路径上时

source: When ``false`` returns at most K paths
sv: När ``false`` returnerar högst K sökvägar
zh_hans: 当 ``false``时返回最多 K 条路径

source: When ``true`` returns only paths that do not violate restrictions
sv: När ``true`` returnerar endast sökvägar som inte bryter mot begränsningar
zh_hans: 当 ``true`` 时仅返回不违反限制的路径

source: When ``false`` returns the paths found
sv: När ``false`` returneras de hittade sökvägarna
zh_hans: 当 ``false`` 返回找到的路径

source: From vertex :math:`3` to :math:`8` with ``strict`` flag on.
sv: Från toppunkt :math:`3` till :math:`8` med flaggan ``strict`` på.
zh_hans: 从顶点 :math:`3` 到:math:`8`，并启用 ``strict`` 标志。

source: No results because the only path available follows a restriction.
sv: Inga resultat eftersom den enda tillgängliga vägen följer en begränsning.
zh_hans: 没有结果，因为唯一可用的路径受到限制。

source: From vertex :math:`3` to vertex :math:`8` on an undirected graph
sv: Från toppunkt :math:`3` till toppunkt :math:`8` i en odelad graf
zh_hans: 从无向图上的顶点 :math:`3` 到顶点 :math:`8`

source: From vertex :math:`3` to vertex :math:`8` with more alternatives
sv: Från toppunkt :math:`3` till toppunkt :math:`8` med fler alternativ
zh_hans: 从顶点 :math:`3` 到顶点 :math:`8` 更多选择

source: ``pgr_version`` — Query for pgRouting version information.
sv: ``pgr_version`` - Fråga efter versionsinformation för pgRouting.
zh_hans: ``pgr_version`` —查询pgRouting版本信息。

source: Breaking change on result columns
sv: Förändring i resultatkolumnerna
zh_hans: 结果列的重大变化

source: Support for old signature ends
sv: Stöd för gamla signaturer slutar
zh_hans: 对旧签名的支持结束

source: Returns pgRouting version information.
sv: Returnerar versionsinformation för pgRouting.
zh_hans: 返回 pgRouting 版本信息。

source: RETURNS ``TEXT``
sv: RETURNERAR ``TEXT``

source: pgRouting Version for this documentation
sv: pgRouting Version för denna dokumentation
zh_hans: 本文档的 pgRouting 版本

source: ``pgr_vrpOneDepot`` - Experimental
sv: ``pgr_vrpOneDepot`` - Experimentell

source: **No documentation available**
sv: **Ingen dokumentation tillgänglig**
zh_hans: **无可用文档**

source: ``pgr_withPoints`` - Returns the shortest path in a graph with additional temporary vertices.
sv: ``pgr_withPoints`` - Returnerar den kortaste vägen i en graf med ytterligare tillfälliga toppar.
zh_hans: ``pgr_withPoints`` - 返回图中带有附加临时顶点的最短路径。

source: Modify the graph to include points defined by `Points SQL`_. Using Dijkstra algorithm, find the shortest path.
sv: Modifiera grafen så att den innehåller punkter definierade av `Points SQL`_. Använd Dijkstra-algoritmen för att hitta den kortaste vägen.

source: From point :math:`1` to vertex :math:`10` with right driving side in directed graph. (without details)
sv: Från punkt :math:`1` till toppunkt :math:`10` med höger drivsida i riktad graf. (utan detaljer)

source: Identifier of the starting vertex of the path. Negative value is for point’s identifier.
sv: Identifierare för banans startvertex. Negativt värde är för punktens identifierare.
zh_hans: 路径起始顶点的标识符。 负值用于点的标识符。

source: Array of identifiers of starting vertices. Negative values are for point’s identifiers.
sv: Array med identifierare för startpunkter. Negativa värden är för punktens identifierare.
zh_hans: 起始顶点的标识符数组。 负值用于点的标识符。

source: Identifier of the ending vertex of the path. Negative value is for point’s identifier.
sv: Identifierare för banans slutpunkt. Negativt värde är för punktens identifierare.
zh_hans: 路径结束顶点的标识符。 负值用于点的标识符。

source: Array of identifiers of ending vertices. Negative values are for point’s identifiers.
sv: Array med identifierare för ändpunkter. Negativa värden är för punktens identifierare.
zh_hans: 结束顶点的标识符数组。 负值用于点的标识符。

source: All the examples are about traveling from point :math:`1` and vertex :math:`5` to points :math:`\{2, 3, 6\}` and vertices :math:`\{10, 11\}`
sv: Alla exempel handlar om att resa från punkten :math:`1` och toppunkten :math:`5` till punkterna :math:`\{2, 3, 6\}` och toppunkterna :math:`\{10, 11\}`
zh_hans: 所有示例都是关于从点:math:`1`和顶点 :math:`5`到点:math:`\{2, 3, 6\}`和顶点 :math:`\{10, 11\}`的旅行

source: ``pgr_withPointsCost`` - Calculates the shortest path and returns only the aggregate cost of the shortest path found, for the combination of points given.
sv: ``pgr_withPointsCost`` - Beräknar den kortaste vägen och returnerar endast den sammanlagda kostnaden för den kortaste vägen som hittats, för den kombination av punkter som anges.

source: Modify the graph to include points defined by points_sql. Using Dijkstra algorithm, return only the aggregate cost of the shortest path found.
sv: Modifiera grafen så att den innehåller punkter definierade av points_sql. Använd Dijkstra-algoritmen och returnera endast den sammanlagda kostnaden för den kortaste vägen som hittats.

source: Returns the sum of the costs of the shortest path for pair combination of vertices in the modified graph.
sv: Returnerar summan av kostnaderna för den kortaste vägen för parkombinationer av toppar i den modifierade grafen.
zh_hans: 返回修改图中顶点对组合的最短路径成本之和。

source: The returned values are in the form of a set of |matrix-result|.
sv: De returnerade värdena är i form av en uppsättning |matrix-result|.

source: **positive** when it belongs to the edges_sql
sv: **positiv** när den hör till kanterna_sql
zh_hans: 当它属于edges_sql时为**正**

source: **negative** when it belongs to the points_sql
sv: **negativ** när den hör till punktsql
zh_hans: 当它属于 points_sql时为**负**

source: If the values returned are stored in a table, the unique index would be the pair: `(start_vid, end_vid)`.
sv: Om de värden som returneras lagras i en tabell skulle det unika indexet vara paret: `(start_vid, end_vid)`.
zh_hans: 如果返回的值存储在表中，则唯一索引将是这一对：`(start_vid, end_vid)`.。

source: For **undirected** graphs, the results are **symmetric**.
sv: För **ej riktade** grafer är resultaten **symmetriska**.
zh_hans: 对于**无向**图，结果是**对称**的。

source: There is no **details** flag, unlike the other members of the withPoints family of functions.
sv: Det finns ingen **details**-flagga, till skillnad från de andra medlemmarna i withPoints-familjen av funktioner.
zh_hans: 与 withPoints 函数系列的其他成员不同，没有**详细信息**标志。

source: From point :math:`1` to vertex :math:`10` with right driving side in directed graph.
sv: Från punkt :math:`1` till toppunkt :math:`10` med höger drivsida i riktad graf.

source: From point :math:`1` and vertex :math:`6` to point :math:`3` with right driving side in directed graph.
sv: Från punkt :math:`1` och toppunkt :math:`6` till punkt :math:`3` med höger drivsida i riktad graf.

source: From point :math:`1` to vertex :math:`10`, and from vertex :math:`6` to point :math:`3` with right side driving.
sv: Från punkt :math:`1` till toppunkt :math:`10`, och från toppunkt :math:`6` till punkt :math:`3` med körning på höger sida.

source: Find the cost of the routes from vertex :math:`1` to the two closest locations on the graph of point `(2.9, 1.8)`.
sv: Beräkna kostnaden för rutterna från toppunkten :math:`1` till de två närmaste platserna på grafen för punkten `(2,9, 1,8)`.
zh_hans: 求从顶点 :math:`1` 到图中点 `(2.9, 1.8)` 的两个最近位置的路线成本。

source: Being close to the graph does not mean have a shorter route.
sv: Att vara nära grafen betyder inte att man har en kortare väg.
zh_hans: 靠近图表并不意味着路线更短。

source: Right side driving topology
sv: Topologi för drivning av höger sida
zh_hans: 右侧驾驶拓扑

source: Traveling from point :math:`1` and vertex :math:`5` to points :math:`\{2, 3, 6\}` and vertices :math:`\{10, 11\}`
sv: Reser från punkt :math:`1` och toppunkt :math:`5` till punkterna :math:`\{2, 3, 6\}` och toppunkterna :math:`\{10, 11\}`
zh_hans: 从点 :math:`1` 和顶点 :math:`5` 出发，前往点 :math:`\{2, 3, 6\}` 和顶点 :math:`\{10, 11\}`

source: Left side driving topology
sv: Topologi för drivning av vänster sida
zh_hans: 左侧驾驶拓扑

source: Does not matter driving side driving topology
sv: Spelar ingen roll drivsida drivtopologi
zh_hans: 与驱动端驱动拓扑无关

source: ``pgr_withPointsCostMatrix`` - Calculates a cost matrix using :doc:`pgr_withPoints`.
sv: ``pgr_withPointsCostMatrix`` - Beräknar en kostnadsmatris med hjälp av :doc:`pgr_withPoints`.
zh_hans: ``pgr_withPointsCostMatrix`` - 使用 :doc:`pgr_withPoints`计算成本矩阵.

source: Cost matrix for points :math:`\{1, 6\}` and vertices :math:`\{10, 11\}` on an **undirected** graph
sv: Kostnadsmatris för punkterna :math:`\{1, 6\}` och hörnen :math:`\{10, 11\}` i en **omdirigerad** graf
zh_hans: **无向**图上的点 :math:`\{1, 6\}`和顶点:math:`\{10, 11\}`的成本矩阵

source: Returning a **symmetrical** cost matrix
sv: Returnerar en **symmetrisk** kostnadsmatris
zh_hans: 返回**对称**成本矩阵

source: Using the default ``side`` value on the **points_sql** query
sv: Använda standardvärdet ``side`` på **points_sql**-frågan
zh_hans: 在**points_sql**查询上使用默认``side``值

source: Using the default ``driving_side`` value
sv: Använda standardvärdet för ``driving_side``
zh_hans: 使用默认``driving_side``值

source: Find the matrix cost of the routes from vertex :math:`1` and the two closest locations on the graph of point `(2.9, 1.8)`.
sv: Hitta matriskostnaden för rutterna från toppunkten :math:`1` och de två närmaste platserna på grafen för punkten `(2,9, 1,8)`.
zh_hans: 求从顶点:math:`1`到图上点 `(2.9, 1.8)` 的两个最近位置的路线的矩阵成本。

source: ``pgr_withPointsDD`` - Returns the driving **distance** from a starting point.
sv: ``pgr_withPointsDD`` - Returnerar köravståndet **från en startpunkt.
zh_hans: ``pgr_withPointsDD`` -返回从起点开始的行驶**距离**。

source: Output columns standardized to |result-spantree|
sv: Utgångskolumner standardiserade till |result-spantree|

source: When ``details`` is ``false``:
sv: När ``details`` är ``false``:

source: Points reached within the distance are not included.
sv: Punkter som nås inom avståndet ingår inte.

source: Deprecated signatures:
sv: Föråldrade signaturer:
zh_hans: 弃用签名：

source: Modify the graph to include points and using Dijkstra algorithm, extracts all the nodes and points that have costs less than or equal to the value ``**distance**`` from the starting point. The edges extracted will conform the corresponding spanning tree.
sv: Modifiera grafen så att den inkluderar punkter och använd Dijkstra-algoritmen för att extrahera alla noder och punkter som har kostnader som är mindre än eller lika med värdet ``**avstånd**`` från startpunkten. De extraherade kanterna kommer att överensstämma med motsvarande spännträd.
zh_hans: 修改图以包含点，并使用 Dijkstra 算法，提取成本小于或等于距起点``**距离**``值的所有节点和点。 提取的边将符合相应的生成树。

source: Right side driving topology, from point :math:`1` within a distance of :math:`3.3` with details.
sv: Höger sida körtopologi, från punkt :math:`1` inom ett avstånd av :math:`3.3` med detaljer.
zh_hans: 右侧驾驶拓扑，从点 :math:`1` 开始，距离不超过 :math:`3.3`，并提供详细信息。

source: From point :math:`1` and vertex :math:`16` within a distance of :math:`3.3` with ``equicost`` on a directed graph
sv: Från punkt :math:`1` och toppunkt :math:`16` inom ett avstånd av :math:`3.3` med ``equicost`` på en riktad graf
zh_hans: 从点 :math:`1` 和顶点 :math:`16` 出发，在有向图上以 ``equicost`` 模式，在距离不超过 :math:`3.3` 的范围内

source: Negative values represent a point
sv: Negativa värden representerar en punkt
zh_hans: 负值代表一个点

source: ``r``, ``R`` for right driving side,
sv: ``R``, ``R`` för höger körsida,
zh_hans: ``r``, ``R`` 表示右侧驾驶，

source: ``l``, ``L`` for left driving side.
sv: ``L``, ``L`` för vänster körsida.
zh_hans: ``l``, ``L`` 表示左侧驾驶。

source: ``b``, ``B`` for both.
sv: ``B``, ``B`` för båda.
zh_hans: ``b``, ``B`` 表示两侧通行（不限制驾驶方向）。

source: Valid values differ for directed and undirected graphs:
sv: Giltiga värden skiljer sig åt för riktade och oriktade grafer:
zh_hans: 有效值因有向图和无向图而异：

source: In directed graphs: [``r``, ``R``, ``l``, ``L``].
sv: I riktade grafer: [``r``, ``R``, ``l``, ``L``].
zh_hans: 有向图中：[``r``, ``R``, ``l``, ``L``]。

source: In undirected graphs: [``b``, ``B``].
sv: I oriktade grafer: [``b``, ``B``].
zh_hans: 无向图中：[``b``, ``B``]。

source: Find the driving distance from the two closest locations on the graph of point `(2.9, 1.8)`.
sv: Hitta köravståndet från de två närmaste platserna på grafen för punkten `(2,9, 1,8)`.
zh_hans: 求图上点 `(2.9, 1.8)` 距离最近的两个位置的行驶距离。

source: Point :math:`-1` corresponds to the closest edge from point :math:`(2.9, 1.8)`.
sv: Punkt :math:`-1` motsvarar den närmaste kanten från punkt :math:`(2,9, 1,8)`.
zh_hans: 点 :math:`-1` 对应距离点 :math:`(2.9, 1.8)` 最近的边。

source: Point :math:`-2` corresponds to the next close edge from point :math:`(2.9, 1.8)`.
sv: Punkt :math:`-2` motsvarar nästa nära kant från punkt :math:`(2,9, 1,8)`.
zh_hans: 点 :math:`-2` 对应于点 :math:`(2.9, 1.8)` 的下一条近边。

source: Driving side does not matter
sv: Körsidan spelar ingen roll
zh_hans: 驾驶侧并不重要

source: From point :math:`1` within a distance of :math:`3.3`, does not matter driving side, with details.
sv: Från punkt :math:`1` inom ett avstånd av :math:`3.3`, spelar ingen roll körsida, med detaljer.
zh_hans: 从点 :math:`1` 开始，在距离不超过 :math:`3.3` 的范围内，无论驾驶方向如何，提供详细信息。

source: ``pgr_withPointsKSP``
sv: ``pgr_medPunkterKSP``

source: ``pgr_withPointsKSP`` — Yen's algorithm for K shortest paths using Dijkstra.
sv: ``pgr_withPointsKSP`` - Yen's algoritm för K kortaste vägar med hjälp av Dijkstra.
zh_hans: ``pgr_withPointsKSP`` — Yen 使用 Dijkstra 计算 K 最短路径的算法。

source: Modifies the graph to include the points defined in the `Points SQL`_ and using Yen algorithm, finds the :math:`K` shortest paths.
sv: Modifierar grafen så att den innehåller de punkter som definieras i `Points SQL`_ och använder Yen-algoritmen för att hitta de :math:`K` kortaste vägarna.
zh_hans: 修改图以包括`Points SQL`_ 中定义的点并使用 Yen 算法查找 :math:`K`最短路径。

source: Get 2 paths from Point :math:`1` to point :math:`2` on a directed graph with **left** side driving.
sv: Få 2 vägar från punkt :math:`1` till punkt :math:`2` på en riktad graf med **vänster** sida som kör.
zh_hans: 在具有**左侧**驾驶的有向图上，从点 :math:`1` 到点 :math:`2` 获取两条路径。

source: For a directed graph.
sv: För en riktad graf.
zh_hans: 有向图。

source: No details are given about distance of other points of the query.
sv: Inga detaljer ges om avståndet till andra punkter i frågan.
zh_hans: 没有给出有关查询的其他点的距离的详细信息。

source: No heap paths are returned.
sv: Inga heap-sökvägar returneras.
zh_hans: 不返回堆路径。

source: Get 2 paths from point :math:`1` to point :math:`3` and vertex :math:`7` on an undirected graph
sv: Hämta 2 vägar från punkt :math:`1` till punkt :math:`3` och toppunkt :math:`7` i en ostyrd graf
zh_hans: 在无向图上从点 :math:`1` 到点 :math:`3` 和顶点 :math:`7` 获取两条路径

source: Get a path from point :math:`1` and vertex :math:`6` to point :math:`3` on a **directed** graph with **right** side driving and **details** set to **True**
sv: Hämta en väg från punkt :math:`1` och vertex :math:`6` till punkt :math:`3` i en **riktad** graf med **höger** sida och **detaljer** inställt på **True**
zh_hans: 在具有**右侧**驾驶的**有向**图上，从点 :math:`1` 和顶点 :math:`6` 到点 :math:`3` 获取一条路径，且**details** 设置为 **True**

source: Get a path from point :math:`1` and vertex :math:`6` to point :math:`3` and vertex :math:`1` on a **directed** graph with **left** side driving and **heap_paths** set to **True**
sv: Hämta en väg från punkt :math:`1` och toppunkt :math:`6` till punkt :math:`3` och toppunkt :math:`1` i en **directed** graf med **left** side driving och **heap_paths** satt till **True**
zh_hans: 在具有**左侧**驾驶的**有向**图上，从点 :math:`1` 和顶点 :math:`6` 到点 :math:`3` 和顶点 :math:`1` 获取一条路径，且**heap_paths** 设置为 **True**

source: Using a combinations table on an **directed** graph
sv: Använda en kombinationstabell på en **riktad** graf
zh_hans: 在**有向**图上使用组合表

source: Number of required paths
sv: Antal nödvändiga sökvägar
zh_hans: 所需路径的数量

source: withPointsKSP optional parameters
sv: withPointsKSP valfria parametrar
zh_hans: withPointsKSP可选参数

source: Get :math:`2` paths using left side driving topology, from vertex :math:`1` to the closest location on the graph of point `(2.9, 1.8)`.
sv: Skaffa :math:`2` banor med hjälp av vänstersidig körtopologi, från toppunkten :math:`1` till den närmaste platsen på grafen för punkten `(2,9, 1,8)`.
zh_hans: 使用左侧驾驶拓扑，从顶点 :math:`1` 到离点 `(2.9, 1.8)` 最近的位置获取 :math:`2` 条路径。

source: Left driving side
sv: Vänster körsida
zh_hans: 左驾驶侧

source: Get :math:`2` paths using left side driving topology, from point :math:`1` to point :math:`3` with details.
sv: Få :math:`2` banor med hjälp av vänstersidig drivtopologi, från punkt :math:`1` till punkt :math:`3` med detaljer.
zh_hans: 使用左侧驾驶拓扑，从点 :math:`1` 到点 :math:`3` 获取 :math:`2` 条路径，并包含详细信息。

source: Right driving side
sv: Höger körsida
zh_hans: 右驾驶侧

source: Get :math:`2` paths using right side driving topology from, point :math:`1` to point :math:`2` with heap paths and details.
sv: Få :math:`2` banor med hjälp av höger sidas drivande topologi från, punkt :math:`1` till punkt :math:`2` med högbanor och detaljer.
zh_hans: 使用右侧驾驶拓扑，从点 :math:`1` 到点 :math:`2` 获取 :math:`2` 条路径，同时使用堆路径（heap paths）并包含详细信息。

source: ``pgr_withPointsVia``
sv: ``pgr_medPointsVia``

source: ``pgr_withPointsVia`` - Route that goes through a list of vertices and/or points.
sv: ``pgr_withPointsVia`` - Rutt som går genom en lista med toppar och/eller punkter.
zh_hans: ``pgr_withPointsVia`` - 经过一系列顶点和/或点的路线。

source: Given a graph, a set of points on the graphs edges and a list of vertices, this function is equivalent to finding the shortest path between :math:`vertex_i` and :math:`vertex_{i+1}` (where :math:`vertex` can be a vertex or a point on the graph) for all :math:`i < size\_of(via\;vertices)`.
sv: Med tanke på en graf, en uppsättning punkter på grafens kanter och en lista med hörnpunkter är denna funktion likvärdig med att hitta den kortaste vägen mellan :math:`vertex_i` och :math:`vertex_{i+1}` (där :math:`vertex` kan vara en hörnpunkt eller en punkt i grafen) för alla :math:`i < size\_of(via\;vertices)`.
zh_hans: 给定一个图、图上边缘的一组点以及一个顶点列表，此函数相当于找到 :math:`vertex_i` 和 :math:`vertex_{i+1}` 之间的最短路径（其中 :math:`vertex` 可以是一个顶点或图上的一个点），对于所有的 :math:`i`，满足 :math:`i < size\_of(via\;vertices)`。

source: Find the route that visits the vertices :math:`\{ -6, 15, -1\}` in that order with right driving side in directed graph..
sv: Hitta rutten som besöker topparna :math:`\{ -6, 15, -1\\}` i den ordningen med höger körsida i riktad graf...

source: Use :doc:`pgr_findCloseEdges` in the `Points SQL`_
sv: Använd :doc:`pgr_findCloseEdges` i `Points SQL`_
zh_hans: 在 `Points SQL`_ 中使用 :doc:`pgr_findCloseEdges` 函数

source: All this examples are about the route that visits the vertices :math:`\{-1, 7, -3, 16, 15\}` in that order on a **directed** graph.
sv: Alla dessa exempel handlar om den rutt som besöker topparna :math:`\{-1, 7, -3, 16, 15\}` i den ordningen i en **riktad** graf.
zh_hans: 所有这些示例都是关于在**有向**图上按顺序访问顶点 :math:`\{-1, 7, -3, 16, 15\}` 的路线。

source: Prim - Family of functions
sv: Prim - Familj av funktioner
zh_hans: Prim - 函数族
