Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: The prim algorithm was developed in 1930 by Czech mathematician Vojtěch Jarník. It is a greedy algorithm that finds a minimum spanning tree for a weighted undirected graph. This means it finds a subset of the edges that forms a tree that includes every vertex, where the total weight of all the edges in the tree is minimized. The algorithm operates by building this tree one vertex at a time, from an arbitrary starting vertex, at each step adding the cheapest possible connection from the tree to another vertex.
sv: Prim-algoritmen utvecklades 1930 av den tjeckiske matematikern Vojtěch Jarník. Det är en girig algoritm som hittar ett träd med minsta spännvidd för en viktad oiktad graf. Detta innebär att den hittar en delmängd av kanterna som bildar ett träd som inkluderar varje vertex, där den totala vikten av alla kanter i trädet minimeras. Algoritmen bygger trädet ett vertex i taget, från ett godtyckligt startvertex, och lägger i varje steg till den billigaste möjliga förbindelsen från trädet till ett annat vertex.
zh_hans: prim 算法由捷克数学家 Vojtěch Jarník 于 1930 年开发。 它是一种贪心算法，为带权无向图找到最小生成树。 这意味着它找到形成包含每个顶点的树的边的子集，其中树中所有边的总权重最小化。 该算法的运行方式是从任意起始顶点一次构建一个顶点，在每一步添加从树到另一个顶点的最便宜的可能连接。

source: This algorithms find the minimum spanning forest in a possibly disconnected graph; in contrast, the most basic form of Prim's algorithm only finds minimum spanning trees in connected graphs. However, running Prim's algorithm separately for each connected component of the graph, then it is called minimum spanning forest.
sv: Den här algoritmen hittar den minsta överspännande skogen i en eventuellt frånkopplad graf; däremot hittar den mest grundläggande formen av Prims algoritm bara minsta överspännande träd i sammanhängande grafer. Men om man kör Prims algoritm separat för varje ansluten komponent i grafen kallas den minsta spännvidden för skog.
zh_hans: 该算法在可能不连通的图中找到最小生成森林； 相反，Prim 算法的最基本形式只能在连通图中找到最小生成树。 然而，对图的每个连通分量分别运行Prim算法，则称为最小生成森林。

source: From boost Graph: "The algorithm as implemented in Boost.Graph does not produce correct results on graphs with parallel edges."
sv: Från Boost Graph: "Algoritmen som den implementeras i Boost.Graph ger inte korrekta resultat på grafer med parallella kanter."
zh_hans: 来自 boost Graph：“Boost.Graph 中实现的算法不会在具有平行边的图上产生正确的结果。”

source: Boost: `Prim's algorithm <https://www.boost.org/libs/graph/doc/prim_minimum_spanning_tree.html>`__
sv: Boost: `Prims algoritm <https://www.boost.org/libs/graph/doc/prim_minimum_spanning_tree.html>`__
zh_hans: Boost: `Prim算法 <https://www.boost.org/libs/graph/doc/prim_minimum_spanning_tree.html>`__

source: Wikipedia: `Prim's algorithm <https://en.wikipedia.org/wiki/Prim%27s_algorithm>`__
sv: Wikipedia: `Prims algoritm <https://en.wikipedia.org/wiki/Prim%27s_algoritm>`__
zh_hans: 维基百科: `Prim算法 <https://en.wikipedia.org/wiki/Prim%27s_algorithm>`__

source: Proposed Functions
sv: Föreslagna funktioner
zh_hans: 拟议的功能

source: Reference
sv: Referens
zh_hans: 参考

source: Release Notes
sv: Anteckningar för release
zh_hans: 发行说明

source: To see the full list of changes check the list of `Git commits <https://github.com/pgRouting/pgrouting/commits>`_ on Github.
sv: För att se den fullständiga listan över ändringar, se listan över `Git commits <https://github.com/pgRouting/pgrouting/commits>`_ på Github.
zh_hans: 要查看完整的更改列表，请检查 Github 上的 `Git提交列表 <https://github.com/pgRouting/pgrouting/commits>`_。

source: Mayors
sv: Borgmästare

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.8.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.8.0%22>`__
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.8.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.8.0%22>`__

source: Promotion to official function of pgRouting.
sv: Befordran till officiell funktion för pgRouting.

source: Metric
sv: Metriska

source: `#2760 <https://github.com/pgRouting/pgrouting/issues/2760>`__: Promoted to official pgr_degree in version 3.8
sv: `#2760 <https://github.com/pgRouting/pgrouting/issues/2760>`__: Befordrad till officiell pgr_grad i version 3.8

source: Utilities
sv: Verktyg
zh_hans: 实用程序

source: `#2772 <https://github.com/pgRouting/pgrouting/issues/2772>`__: Promoted to official pgr_extractVertices in version 3.8
sv: `#2772 <https://github.com/pgRouting/pgrouting/issues/2772>`__: Befordrad till officiell pgr_extractVertices i version 3.8

source: `#2774 <https://github.com/pgRouting/pgrouting/issues/2774>`__: Promoted to official pgr_findCloseEdges in version 3.8
sv: `#2774 <https://github.com/pgRouting/pgrouting/issues/2774>`__: Befordrad till officiell pgr_findCloseEdges i version 3.8

source: `#2873 <https://github.com/pgRouting/pgrouting/issues/2873>`__: Promoted to official pgr_separateCrossing in version 3.8
sv: `#2873 <https://github.com/pgRouting/pgrouting/issues/2873>`__: Befordrad till officiell pgr_separateCrossing i version 3.8

source: `#2874 <https://github.com/pgRouting/pgrouting/issues/2874>`__: Promoted to official pgr_separateTouching in version 3.8
sv: `#2874 <https://github.com/pgRouting/pgrouting/issues/2874>`__: Befordrad till officiell pgr_separateTouching i version 3.8

source: Proposed functions
sv: Föreslagna funktioner

source: Contraction
sv: Sammandragning

source: `#2790 <https://github.com/pgRouting/pgrouting/issues/2790>`__: pgr_contractionDeadEnd new contraction function
sv: `#2790 <https://github.com/pgRouting/pgrouting/issues/2790>`__: pgr_contractionDeadEnd ny funktion för sammandragning

source: `#2791 <https://github.com/pgRouting/pgrouting/issues/2791>`__: pgr_contractionLinear new contraction function
sv: `#2791 <https://github.com/pgRouting/pgrouting/issues/2791>`__: pgr_contractionLinear ny funktion för sammandragning

source: `#2536 <https://github.com/pgRouting/pgrouting/issues/2536>`__: Support for contraction hierarchies (pgr_contractionHierarchies)
sv: `#2536 <https://github.com/pgRouting/pgrouting/issues/2536>`__: Stöd för sammandragningshierarkier (pgr_contractionHierarchies)

source: `#2848 <https://github.com/pgRouting/pgrouting/issues/2848>`__: Create pgr_separateCrossing new utility function
sv: `#2848 <https://github.com/pgRouting/pgrouting/issues/2848>`__: Skapa pgr_separateCrossing ny verktygsfunktion

source: `#2849 <https://github.com/pgRouting/pgrouting/issues/2849>`__: Create of pgr_separateTouching new utility function
sv: `#2849 <https://github.com/pgRouting/pgrouting/issues/2849>`__: Skapande av pgr_separateTouching ny verktygsfunktion

source: Official functions changes
sv: Förändringar i officiella funktioner
zh_hans: 官方功能变更

source: `#2786 <https://github.com/pgRouting/pgrouting/issues/2786>`__: pgr_contraction(edges) new signature
sv: `#2786 <https://github.com/pgRouting/pgrouting/issues/2786>`__: pgr_contraction(edges) ny signatur

source: C/C++ code enhancements
sv: Förbättringar av C/C++-kod

source: `#2802 <https://github.com/pgRouting/pgrouting/issues/2802>`__: Code reorganization on pgr_contraction
sv: `#2802 <https://github.com/pgRouting/pgrouting/issues/2802>`__: Omorganisering av kod för pgr_contraction

source: Other enhancements: `#2869 <https://github.com/pgRouting/pgrouting/issues/2869>`__
sv: Andra förbättringar: `#2869 <https://github.com/pgRouting/pgrouting/issues/2869>`__

source: SQL code enhancements
sv: Förbättringar av SQL-kod

source: `#2850 <https://github.com/pgRouting/pgrouting/issues/2850>`__: Rewrite pgr_nodeNetwork
sv: `#2850 <https://github.com/pgRouting/pgrouting/issues/2850>`__: Skriv om pgr_nodeNetwork

source: Deprecation of SQL functions
sv: Utfasning av SQL-funktioner

source: `#2749 <https://github.com/pgRouting/pgrouting/issues/2749>`__: Deprecate pgr_AlphaShape in 3.8
sv: `#2749 <https://github.com/pgRouting/pgrouting/issues/2749>`__: Avveckla pgr_AlphaShape i 3.8

source: `#2750 <https://github.com/pgRouting/pgrouting/issues/2750>`__: Deprecate pgr_CreateTopology in 3.8
sv: `#2750 <https://github.com/pgRouting/pgrouting/issues/2750>`__: Avveckla pgr_CreateTopology i 3.8

source: `#2753 <https://github.com/pgRouting/pgrouting/issues/2753>`__: Deprecate pgr_analyzeGraph in 3.8
sv: `#2753 <https://github.com/pgRouting/pgrouting/issues/2753>`__: Avveckla pgr_analyzeGraph i 3.8

source: `#2754 <https://github.com/pgRouting/pgrouting/issues/2754>`__: Deprecate pgr_analyzeOneWay in 3.8
sv: `#2754 <https://github.com/pgRouting/pgrouting/issues/2754>`__: Avveckla pgr_analyzeOneWay i 3.8

source: `#2826 <https://github.com/pgRouting/pgrouting/issues/2826>`__: Deprecate pgr_createVerticesTable in 3.8
sv: `#2826 <https://github.com/pgRouting/pgrouting/issues/2826>`__: Avveckla pgr_createVerticesTable i 3.8

source: In the deprecated functions:
sv: I de föråldrade funktionerna:

source: Migration section is created.
sv: Migrationsavsnittet skapas.

source: The use of the functions is removed in the documentation.
sv: Användningen av funktionerna har tagits bort i dokumentationen.

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.7.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.7.3%22>`__
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.7.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.7.3%22>`__

source: `#2731 <https://github.com/pgRouting/pgrouting/pull/2731>`__ Build Failure on Ubuntu 22
sv: `#2731 <https://github.com/pgRouting/pgrouting/pull/2731>`__ Byggfel på Ubuntu 22

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.7.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.7.2%22>`__
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git-stängd milstolpe för 3.7.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.7.2%22>`__

source: Build
sv: Skapa

source: `#2713 <https://github.com/pgRouting/pgrouting/pull/2713>`__ cmake missing some policies and min version
sv: `#2713 <https://github.com/pgRouting/pgrouting/pull/2713>`__ cmake saknar vissa policyer och min-version

source: Using OLD policies: CMP0148, CMP0144, CMP0167
sv: Använda gamla policyer: CMP0148, CMP0144, CMP0167

source: Minimum cmake version 3.12
sv: Minsta cmake-version 3.12

source: `#2707 <https://github.com/pgRouting/pgrouting/pull/2707>`__ Build failure in pgRouting 3.7.1 on Alpine
sv: `#2707 <https://github.com/pgRouting/pgrouting/pull/2707>`__ Byggfel i pgRouting 3.7.1 på Alpine

source: `#2706 <https://github.com/pgRouting/pgrouting/pull/2706>`__ winnie crashing on pgr_betweennessCentrality
sv: `#2706 <https://github.com/pgRouting/pgrouting/pull/2706>`__ winnie kraschar på pgr_betweennessCentrality

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.7.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.7.1%22>`__
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git-stängd milstolpe för 3.7.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.7.1%22>`__

source: `#2680 <https://github.com/pgRouting/pgrouting/pull/2680>`__ fails to compile under mingw64 gcc 13.2
sv: `#2680 <https://github.com/pgRouting/pgrouting/pull/2680>`__ kan inte kompileras under mingw64 gcc 13.2

source: `#2689 <https://github.com/pgRouting/pgrouting/pull/2689>`__ When point is a vertex, the withPoints family do not return results.
sv: `#2689 <https://github.com/pgRouting/pgrouting/pull/2689>`__ När punkten är en vertex ger inte withPoints-familjen några resultat.

source: C/C++ code enhancemet
sv: Förbättring av C/C++-kod

source: TRSP family
sv: TRSP-familjen

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.7.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.7.0%22>`__
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.7.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.7.0%22>`__

source: `#2656 <https://github.com/pgRouting/pgrouting/pull/2656>`__ Stop support of PostgreSQL12 on pgrouting v3.7
sv: `#2656 <https://github.com/pgRouting/pgrouting/pull/2656>`__ Stoppa stöd för PostgreSQL12 på pgrouting v3.7

source: Stopping support of PostgreSQL 12
sv: Stoppa stöd för PostgreSQL 12

source: CI does not test for PostgreSQL 12
sv: CI testar inte för PostgreSQL 12

source: New experimental functions
sv: Nya experimentella funktioner

source: Metrics
sv: Mätvärde

source: `#2605 <https://github.com/pgRouting/pgrouting/pull/2605>`__ Standardize spanning tree functions output
sv: `#2605 <https://github.com/pgRouting/pgrouting/pull/2605>`__ Standardisera utdata för funktioner för spänningsträd

source: Functions:
sv: Funktioner:

source: Experimental promoted to proposed.
sv: Experimentell befordrad till föreslagen.

source: `#2635 <https://github.com/pgRouting/pgrouting/pull/2635>`__ pgr_LineGraph ignores directed flag and use negative values for identifiers.
sv: `#2635 <https://github.com/pgRouting/pgrouting/pull/2635>`__ pgr_LineGraph ignorerar directed flag och använder negativa värden för identifierare.

source: Code enhancement
sv: Förbättring av kod

source: `#2599 <https://github.com/pgRouting/pgrouting/pull/2599>`__ Driving distance cleanup
sv: `#2599 <https://github.com/pgRouting/pgrouting/pull/2599>`__ Körsträcka uppstädning

source: `#2607 <https://github.com/pgRouting/pgrouting/pull/2607>`__ Read postgresql data on C++
sv: `#2607 <https://github.com/pgRouting/pgrouting/pull/2607>`__ Läsa postgresql-data på C++

source: `#2614 <https://github.com/pgRouting/pgrouting/pull/2614>`__ Clang tidy does not work
sv: `#2614 <https://github.com/pgRouting/pgrouting/pull/2614>`__ Clang tidy fungerar inte

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.6.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.3%22>`__
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.6.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.3%22>`__

source: Explicit minimum requirements:
sv: Uttryckliga minimikrav:

source: g++ 13+ is supported
sv: g++ 13+ stöds

source: Code fixes
sv: Kodkorrigeringar

source: Fix warnings from cpplint.
sv: Fixa varningar från cpplint.

source: Fix warnings from clang 18.
sv: Fixa varningar från clang 18.

source: CI tests
sv: CI-test

source: Add a clang tidy test on changed files.
sv: Lägg till ett clang tidy-test på ändrade filer.

source: Update test not done on versions: 3.0.1, 3.0.2, 3.0.3, 3.0.4, 3.1.0, 3.1.1, 3.1.2
sv: Uppdateringstest inte gjort på versioner: 3.0.1, 3.0.2, 3.0.3, 3.0.4, 3.1.0, 3.1.1, 3.1.2

source: Documentation
sv: Dokumentation

source: Results of documentation queries adujsted to boost 1.83.0 version:
sv: Resultat av dokumentationsförfrågningar adujsted till boost 1.83.0 version:

source: pgtap tests
sv: pgtap-test

source: bug fixes
sv: buggfixar

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.6.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.2%22>`__
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git-stängd milstolpe för 3.6.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.2%22>`__

source: Upgrade fix
sv: Fix för uppgradering

source: The upgrade was failing for same minor
sv: Uppgraderingen misslyckades på grund av samma mindre

source: Fix warnings from cpplint
sv: Fixa varningar från cpplint

source: Others
sv: Andra

source: Adjust NEWS generator
sv: Justera NEWS-generatorn

source: Name change to `NEWS.md` for better visualization on GitHub
sv: Namnändring till `NEWS.md` för bättre visualisering på GitHub

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.6.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.1%22>`_
sv: För att se alla problem och pull requests som stängts av denna release, se `Git stängd milstolpe för 3.6.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.1%22>`_

source: `#2588 <https://github.com/pgRouting/pgrouting/pull/2588>`__ pgrouting 3.6.0 fails to build on OSX
sv: `#2588 <https://github.com/pgRouting/pgrouting/pull/2588>`__ pgrouting 3.6.0 går inte att bygga under OSX

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.6.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.0%22>`_
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.6.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.0%22>`_
zh_hans: 要查看此版本关闭的所有问题和拉取请求，请访问 `Git 3.6.0 里程碑的已关闭问题和拉取请求 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.6.0%22>`_

source: `#2516 <https://github.com/pgRouting/pgrouting/pull/2516>`__ Standardize output pgr_aStar
sv: `#2516 <https://github.com/pgRouting/pgrouting/pull/2516>`__ Standardisera utdata pgr_aStar

source: Standardize output columns to |short-generic-result|
sv: Standardisera utdatakolumner till |short-generic-result|

source: `#2523 <https://github.com/pgRouting/pgrouting/pull/2523>`__ Standardize output pgr_bdAstar
sv: `#2523 <https://github.com/pgRouting/pgrouting/pull/2523>`__ Standardisera utdata pgr_bdAstar

source: `#2547 <https://github.com/pgRouting/pgrouting/pull/2547>`__ Standardize output and modifying signature pgr_KSP
sv: `#2547 <https://github.com/pgRouting/pgrouting/pull/2547>`__ Standardisera utdata och ändra signatur pgr_KSP

source: `#2548 <https://github.com/pgRouting/pgrouting/pull/2548>`__ Standardize output pgr_drivingDistance
sv: `#2548 <https://github.com/pgRouting/pgrouting/pull/2548>`__ Standardisera utdata pgr_drivingDistance

source: Proposed functions changes
sv: Föreslagna ändringar av funktioner

source: `#2544 <https://github.com/pgRouting/pgrouting/pull/2544>`__ Standardize output and modifying signature pgr_withPointsDD
sv: `#2544 <https://github.com/pgRouting/pgrouting/pull/2544>`__ Standardisera utdata och ändra signaturen pgr_withPointsDD

source: `#2546 <https://github.com/pgRouting/pgrouting/pull/2546>`__ Standardize output and modifying signature pgr_withPointsKSP
sv: `#2546 <https://github.com/pgRouting/pgrouting/pull/2546>`__ Standardisera utdata och ändra signaturen pgr_withPointsKSP

source: `#2504 <https://github.com/pgRouting/pgrouting/pull/2504>`__ To C++ pg data get, fetch and check.
sv: `#2504 <https://github.com/pgRouting/pgrouting/pull/2504>`__ Till C++ pg-data hämta, hämta och kontrollera.

source: Stopping support for compilation with MSVC.
sv: Stoppar stöd för kompilering med MSVC.

source: `#2505 <https://github.com/pgRouting/pgrouting/pull/2505>`__ Using namespace.
sv: `#2505 <https://github.com/pgRouting/pgrouting/pull/2505>`__ Använder namnområde.

source: `#2512 <https://github.com/pgRouting/pgrouting/pull/2512>`__ [Dijkstra] Removing duplicate code on Dijkstra.
sv: `#2512 <https://github.com/pgRouting/pgrouting/pull/2512>`__ [Dijkstra] Borttagning av duplicerad kod på Dijkstra.

source: `#2517 <https://github.com/pgRouting/pgrouting/pull/2517>`__ Astar code simplification.
sv: `#2517 <https://github.com/pgRouting/pgrouting/pull/2517>`__ Förenkling av Astar-koden.

source: `#2521 <https://github.com/pgRouting/pgrouting/pull/2521>`__ Dijkstra code simplification.
sv: `#2521 <https://github.com/pgRouting/pgrouting/pull/2521>`__ Dijkstra kodförenkling.

source: `#2522 <https://github.com/pgRouting/pgrouting/pull/2522>`__ bdAstar code simplification.
sv: `#2522 <https://github.com/pgRouting/pgrouting/pull/2522>`__ bdAstar kodförenkling.

source: `#2490 <https://github.com/pgRouting/pgrouting/pull/2490>`__ Automatic page history links.
sv: `#2490 <https://github.com/pgRouting/pgrouting/pull/2490>`__ Automatiska länkar till sidans historik.

source: `#2555 <https://github.com/pgRouting/pgrouting/pull/2555>`__ Standardize deprecated messages
sv: `#2555 <https://github.com/pgRouting/pgrouting/pull/2555>`__ Standardisera föråldrade meddelanden

source: On new internal function: do not use named parameters and default parameters.
sv: För nya interna funktioner: använd inte namngivna parametrar och standardparametrar.

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.5.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.5.1%22>`_
sv: För att se alla problem och pull requests som stängts av den här versionen, se `Git stängd milstolpe för 3.5.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.5.1%22>`_

source: Documentation fixes
sv: Dokumentationsfixar

source: Changes on the documentation to the following:
sv: Ändringar i dokumentationen till följande:

source: Automatic page history links
sv: Automatiska länkar till sidhistorik

source: using bootstrap_version 2 because 3+ does not do dropdowns
sv: använder bootstrap_version 2 eftersom 3+ inte gör dropdowns

source: Issue fixes
sv: Problemkorrigeringar

source: `#2565 <https://github.com/pgRouting/pgrouting/issues/2565>`__ pgr_lengauerTarjanDominatorTree triggers an assertion
sv: `#2565 <https://github.com/pgRouting/pgrouting/issues/2565>`__ pgr_lengauerTarjanDominatorTree utlöser ett påstående

source: SQL enhancements
sv: Förbättringar av SQL

source: `#2561 <https://github.com/pgRouting/pgrouting/issues/2561>`__ Not use wildcards on SQL
sv: `#2561 <https://github.com/pgRouting/pgrouting/issues/2561>`__ Använd inte jokertecken i SQL

source: `#2559 <https://github.com/pgRouting/pgrouting/issues/2559>`__ pgtap test using sampledata
sv: `#2559 <https://github.com/pgRouting/pgrouting/issues/2559>`__ pgtap-test med sampledata

source: Build fixes
sv: Byggfixar

source: Fix winnie build
sv: Fixa winnie build

source: Fix clang warnings
sv: Fixa clang-varningar

source: Grouping headers of postgres readers
sv: Gruppering av rubriker för postgres-läsare

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.5.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.5.0%22>`_
sv: För att se alla problem och pull requests som stängts av denna release, se `Git stängd milstolpe för 3.5.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.5.0%22>`_

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.4.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.4.2%22>`_
sv: För att se alla problem och pull requests som stängts av denna release, se `Git stängd milstolpe för 3.4.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.4.2%22>`_

source: `#2394 <https://github.com/pgRouting/pgrouting/issues/2394>`__: pgr_bdAstar accumulates heuristic cost in visited node cost.
sv: `#2394 <https://github.com/pgRouting/pgrouting/issues/2394>`__: pgr_bdAstar ackumulerar heuristisk kostnad i besökt nodkostnad.
