Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: **value**
sv: **värde**

source: Identifier of the point.
sv: Identifierare av punkten.
zh_hans: 点的标识符。

source: Use with positive value, as internally will be converted to negative value
sv: Använd med positivt värde, eftersom det internt kommer att omvandlas till negativt värde
zh_hans: 使用正值，因为内部将转换为负值

source: If column is present, it can not be NULL.
sv: Om kolumnen finns med kan den inte vara NULL.
zh_hans: 如果列存在，则它不能为 NULL。

source: If column is not present, a sequential negative **value** will be given automatically.
sv: Om kolumnen inte finns med kommer ett negativt **värde** att anges automatiskt i ordningsföljd.
zh_hans: 如果列不存在，将自动给出连续的负**值**。

source: ``edge_id``
sv: ``Kedge_id``

source: Identifier of the "closest" edge to the point.
sv: Identifierar den kant som ligger "närmast" punkten.
zh_hans: 距离该点“最近”的边的标识符。

source: ``fraction``
sv: ``fraktion``

source: Value in <0,1> that indicates the relative position from the first end point of the edge.
sv: Värde i <0,1> som anger den relativa positionen från kantens första ändpunkt.

source: ``side``
sv: ``sida``

source: Value in [``b``, ``r``, ``l``, ``NULL``] indicating if the point is:
sv: Värde i [``b``, ``r``, ``l``, ``NULL``] som anger om punkten är:
zh_hans: [``b``, ``r``, ``l``, ``NULL``] 中的值指示该点是否为：

source: In the right ``r``,
sv: I rätt "r",
zh_hans: ``r``在右边，

source: In the left ``l``,
sv: I vänster "l",
zh_hans: ``l``在左边，

source: In both sides ``b``, ``NULL``
sv: I båda sidor ``b``, ``NULL``
zh_hans: ``b``, ``NULL``在两边

source: Dijkstra - Family of functions
sv: Dijkstra - Familj av funktioner
zh_hans: Dijkstra - 函数族

source: Dijkstra's algorithm, conceived by Dutch computer scientist Edsger Dijkstra in 1956. It is a graph search algorithm that solves the shortest path problem for a graph with non-negative edge path costs, producing a shortest path from a starting vertex to an ending vertex. This implementation can be used with a directed graph and an undirected graph.
sv: Dijkstras algoritm, skapad av den holländske datavetaren Edsger Dijkstra 1956. Det är en algoritm för grafsökning som löser problemet med kortaste vägen för en graf med icke-negativa kantvägskostnader, vilket ger en kortaste väg från ett startvertex till ett slutvertex. Den här implementationen kan användas med en riktad graf och en oriktad graf.
zh_hans: Dijkstra算法，由荷兰计算机科学家Edsger Dijkstra于1956年提出。它是一种图搜索算法，解决具有非负边路径成本的图的最短路径问题，产生从起始顶点到结束顶点的最短路径。 该实现可以与有向图和无向图一起使用。

source: Running time: :math:`O(| start\ vids | * (V \log V + E))`
sv: Drifttid: :math:`O(| start\ vids | * (V \log V + E))`
zh_hans: 运行时间：:math:`O(| start\ vids | * (V \log V + E))`

source: The Dijkstra family functions are based on the Dijkstra algorithm.
sv: Dijkstra-familjens funktioner är baserade på Dijkstra-algoritmen.
zh_hans: Dijkstra 系列函数基于 Dijkstra 算法。

source: `Combinations SQL`_
sv: `Kombinationer SQL`_

source: `Combinations SQL`_ as described below
sv: `Combinations SQL`_ enligt beskrivningen nedan
zh_hans: `Combinations SQL`_如下所述

source: **start vid**
sv: **starta vid**

source: Identifier of the starting vertex of the path.
sv: Identifierare för stigens startvertex.
zh_hans: 路径起始顶点的标识符。

source: **end vid**
sv: **sluta vid**

source: Identifier of the ending vertex of the path.
sv: Identifierare för banans slutpunkt.
zh_hans: 路径结束顶点的标识符。

source: **end vids**
sv: **sluta vids**

source: Array of identifiers of ending vertices.
sv: Array med identifierare för slutpunkter.
zh_hans: 结束顶点的标识符数组。

source: Combinations SQL
sv: Kombinationer SQL
zh_hans: 分量 SQL

source: Identifier of the departure vertex.
sv: Identifierare för avgångsvertexen.
zh_hans: 出发顶点的标识符。

source: Identifier of the arrival vertex.
sv: Identifierare för ankomstvertexet.
zh_hans: 到达顶点的标识符。

source: The problem definition (Advanced documentation)
sv: Problemdefinition (avancerad dokumentation)
zh_hans: 问题定义（高级文档）

source: Given the following query:
sv: Givet följande frågeställning:
zh_hans: 给出以下查询：

source: where :math:`sql = \{(id_i, source_i, target_i, cost_i, reverse\_cost_i)\}`
sv: där :math:`sql = \{(id_i, source_i, target_i, cost_i, reverse\_cost_i)\}``
zh_hans: 其中 :math:`sql =\{(id_i, source_i, target_i, cost_i, reverse\_cost_i)\}`

source: and
sv: och
zh_hans: 和

source: The graphs are defined as follows:
sv: Graferna definieras på följande sätt:
zh_hans: 图定义如下：

source: Directed graph
sv: Riktad graf
zh_hans: 有向图

source: The weighted directed graph, :math:`G_d(V,E)`, is defined by:
sv: Den viktade riktade grafen, :math:`G_d(V,E)`, definieras av:
zh_hans: 加权有向图， :math:`G_d(V,E)`， 定义如下：

source: the set of vertices :math:`V`
sv: uppsättningen av hörn :math:`V`
zh_hans: 顶点集:math:`V`

source: the set of edges :math:`E`
sv: uppsättningen kanter :math:`E`
zh_hans: 边集:math:`E`

source: Undirected graph
sv: Oriktad graf
zh_hans: 无向图

source: The weighted undirected graph, :math:`G_u(V,E)`, is defined by:
sv: Den viktade oavledda grafen, :math:`G_u(V,E)`, definieras av:

source: The problem
sv: Problemet
zh_hans: 问题

source: Given:
sv: Givetvis:
zh_hans: 给定：

source: Then:
sv: Då så:
zh_hans: 然后：

source: where:
sv: var:
zh_hans: 其中：

source: In other words: The algorithm returns a the shortest path between :math:`start_{vid}` and :math:`end_{vid}`, if it exists, in terms of a sequence of nodes and of edges,
sv: Eller med andra ord Algoritmen returnerar den kortaste vägen mellan :math:`start_{vid}` och :math:`slut_{vid}`, om den finns, i form av en sekvens av noder och kanter,
zh_hans: 换句话说：如果:math:`start_{vid}`和:math:`end_{vid}`之间存在最短路径，算法会根据节点和边的序列返回该路径、

source: If there is no path, the resulting set is empty.
sv: Om det inte finns någon väg är den resulterande uppsättningen tom.
zh_hans: 如果没有路径，则结果集为空。

source: Driving Distance - Category
sv: Köravstånd - Kategori
zh_hans: 驾驶距离 - 类别

source: Calculate nodes that are within a distance.
sv: Beräkna noder som ligger inom ett visst avstånd.
zh_hans: 计算一定距离内的节点。

source: Extracts all the nodes that have costs less than or equal to the value distance.
sv: Extraherar alla noder som har kostnader som är mindre än eller lika med värdeavståndet.
zh_hans: 提取成本小于或等于距离值的所有节点。

source: The edges extracted will conform to the corresponding spanning tree.
sv: De kanter som extraheras kommer att överensstämma med motsvarande spännträd.
zh_hans: 提取的边将符合相应的生成树。

source: Edge :math:`(u, v)` will not be included when:
sv: Edge :math:`(u, v)` kommer inte att inkluderas när:
zh_hans: 在以下情况下，边:math:`(u, v)`将不包括在内：

source: The distance from the **root** to :math:`u` > limit distance.
sv: Avståndet från **roten** till :math:`u` > gränsavstånd.
zh_hans: 从 **root**到 :math:`u`的距离>限制距离。

source: The distance from the **root** to :math:`v` > limit distance.
sv: Avståndet från **roten** till :math:`v` > gränsavstånd.
zh_hans: 从 **root**到 :math:`v`的距离>限制距离。

source: No new nodes are created on the graph, so when is within the limit and is not within the limit, the edge is not included.
sv: Inga nya noder skapas i grafen, så när är inom gränsen och är inte inom gränsen, är kanten inte inkluderad.
zh_hans: 图上不会创建新的节点，因此当 位于限制内和不在限制内时，不包含边。

source: Edges SQL as described below.
sv: Kanter SQL enligt beskrivningen nedan.
zh_hans: Edges SQL如下所述。

source: ``ARRAY[ANY-INTEGER]``
sv: ``ARRAY[VALFRITT HELTAL]``

source: **distance**
sv: **Distans**

source: Upper limit for the inclusion of a node in the result.
sv: Övre gräns för när en nod ska inkluderas i resultatet.
zh_hans: 结果中包含节点的上限。

source: Returns set of |result-spantree|
sv: Returnerar uppsättning av |resultat-spantree|
zh_hans: Returns set of |result-spantree| 返回结果树集

source: Predecessor of ``node``.
sv: Föregångare till ``node``.
zh_hans: ``node``的前驱。

source: When ``node`` = ``start_vid`` then has the value ``node``.
sv: När ``node`` = ``start_vid`` så har värdet ``node``.
zh_hans: 当 `node` 等于 `start_vid` 时，它的值就是 `node`。

source: Identifier of the ``edge`` used to arrive from ``pred`` to ``node``.
sv: Identifierare av den ``edge`` som används för att komma från ``pred`` till ``node``.
zh_hans: 从``pred`` 到达``node``所使用的 ``edge``的标识符。

source: Experimental Functions
sv: Experimentella funktioner
zh_hans: 实验函数

source: Families
sv: Familjer
zh_hans: 族

source: categories
sv: kategorier
zh_hans: 类别

source: Shortest Path Category
sv: Kortaste vägen Kategori

source: Planar Family
sv: Planar familj

source: Miscellaneous Algorithms
sv: Diverse algoritmer

source: Flow - Family of functions
sv: Flow - Familj av funktioner
zh_hans: Flow - 函数族

source: Applications
sv: Ansökningar
zh_hans: 应用

source: Flow Functions General Information
sv: Flödesfunktioner Allmän information
zh_hans: 流函数一般信息

source: The graph is **directed**.
sv: Grafen är **riktad**.
zh_hans: 该图是**有向**的。

source: Process is done only on edges with positive capacities.
sv: Processen utförs endast på kanter med positiva kapaciteter.
zh_hans: 仅在具有正容量的边缘上进行处理。

source: When the maximum flow is 0 then there is no flow and **EMPTY SET** is returned.
sv: När det maximala flödet är 0 finns det inget flöde och **EMPTY SET** returneras.
zh_hans: 当最大流量为0时则没有流量并返回**EMPTY SET**。

source: There is no flow when source has the same value as target.
sv: Det finns inget flöde när källan har samma värde som målet.

source: Any duplicated values in source or target are ignored.
sv: Alla duplicerade värden i källan eller målet ignoreras.

source: Calculates the flow/residual capacity for each edge. In the output
sv: Beräknar flödet/resterande kapacitet för varje kant. I utmatningen
zh_hans: 计算每条边的流量/剩余容量。 在输出中

source: Edges with zero flow are omitted.
sv: Kanter med nollflöde utelämnas.
zh_hans: 流量为零的边被忽略。

source: Creates
sv: Skapar

source: a **super source** and edges from it to all the sources,
sv: en **superkälla** och kanter från den till alla källor,

source: a **super target** and edges from it to all the targetss.
sv: ett **supermål** och kanter från det till alla mål.

source: The maximum flow through the graph is guaranteed to be the value returned by :doc:`pgr_maxFlow <pgr_maxFlow>` when executed with the same parameters and can be calculated:
sv: Det maximala flödet genom grafen är garanterat det värde som returneras av :doc:`pgr_maxFlow <pgr_maxFlow>` när det körs med samma parametrar och kan beräknas:
zh_hans: 当使用相同参数执行时，通过图表的最大流量保证是:doc:`pgr_maxFlow <pgr_maxFlow>` 返回的值，并且可以计算：

source: By aggregation of the outgoing flow from the sources
sv: Genom aggregering av det utgående flödet från källorna
zh_hans: 通过聚合来自源的传出流量

source: By aggregation of the incoming flow to the targets
sv: Genom aggregering av det inkommande flödet till målen
zh_hans: 通过聚合到达目标的传入流量

source: Capacity edges
sv: Kapacitet kanter
zh_hans: 容量边缘

source: ``reverse_capacity``
sv: ``omvänd_kapacitet``

source: Capacity-Cost edges
sv: Kanter mellan kapacitet och kostnad
zh_hans: 容量-成本边

source: Capacity of the edge (``source``, ``target``)
sv: Kapacitet för kanten (``källa``, ``mål``)
zh_hans: 边 (``source``, ``target``)的容量

source: Capacity of the edge (``target``, ``source``)
sv: Kapacitet för kanten (``mål``, ``källa``)
zh_hans: 边 (``target``, ``source``)的容量

source: Weight of the edge (``source``, ``target``) if it exist
sv: Vikt för kanten (``källa``, ``mål``) om den finns
zh_hans: 边 (``source``, ``target``)的权重（如果存在）

source: Weight of the edge (``target``, ``source``) if it exist
sv: Vikt för kanten (``mål``, ``källa``) om den finns
zh_hans: 边(``target``, ``source``)的权重（如果存在）

source: Cost edges
sv: Kostnad kanter
zh_hans: 成本边

source: Used in
sv: Använd i
zh_hans: 用于

source: **edge**
sv: **kant**

source: Identifier of the edge in the original query (edges_sql).
sv: Identifierare av kanten i den ursprungliga frågan (edges_sql).
zh_hans: 原始查询中边的标识符 (edges_sql)。

source: **end_vid**
sv: **slut_vid**

source: **flow**
sv: **flöde**

source: Flow through the edge in the direction (``start_vid``, ``end_vid``).
sv: Flöde genom kanten i riktning (``start_vid``, ``slut_vid``).
zh_hans: 沿 (``start_vid``, ``end_vid``)方向流经边缘。

source: **residual_capacity**
sv: **återstående_kapacitet**

source: Residual capacity of the edge in the direction (``start_vid``, ``end_vid``).
sv: Restkapacitet för kanten i riktningen (``start_vid``, ``slut_vid``).
zh_hans: (``start_vid``, ``end_vid``)方向上边缘的剩余容量。

source: For :doc:`pgr_maxFlowMinCost`
sv: För :doc:`pgr_maxFlowMinCost`
zh_hans: 对于 :doc:`pgr_maxFlowMinCost`

source: **source**
sv: **källa**

source: **target**
sv: **målgrupp**

source: Flow through the edge in the direction (source, target).
sv: Flöde genom kanten i riktning (källa, mål).
zh_hans: 沿方向 (source, target)流经边缘。

source: Residual capacity of the edge in the direction (source, target).
sv: Restkapacitet för kanten i riktningen (källa, mål).
zh_hans: 方向 (source, target)上边缘的剩余容量。

source: **cost**
sv: **kostnad**

source: The cost of sending this flow through the edge in the direction (source, target).
sv: Kostnaden för att skicka detta flöde genom kanten i riktningen (källa, mål).
zh_hans: 在方向 (source, target)上通过边缘发送此流的成本。

source: **agg_cost**
sv: **agg_kostnad**

source: The aggregate cost.
sv: Den sammanlagda kostnaden.
zh_hans: 总成本。

source: Advanced Documentation
sv: Avancerad dokumentation
zh_hans: 高级文档

source: A flow network is a directed graph where each edge has a capacity and a flow. The flow through an edge must not exceed the capacity of the edge. Additionally, the incoming and outgoing flow of a node must be equal except for source which only has outgoing flow, and the destination(sink) which only has incoming flow.
sv: Ett flödesnät är en riktad graf där varje kant har en kapacitet och ett flöde. Flödet genom en kant får inte överstiga kapaciteten i kanten. Dessutom måste det inkommande och utgående flödet för en nod vara lika med undantag för källan som bara har utgående flöde och destinationen (sink) som bara har inkommande flöde.
zh_hans: 流网络是一个有向图，其中每条边都有容量和流量。通过一条边的流量不能超过边的容量。此外，节点的流入流出必须相等，除了源节点只有流出流量，以及目标（汇点）节点只有流入流量。

source: Maximum flow algorithms calculate the maximum flow through the graph and the flow of each edge.
sv: Algoritmer för maximalt flöde beräknar det maximala flödet genom grafen och flödet för varje kant.
zh_hans: 最大流量算法计算通过图的最大流量以及每条边的流量。

source: The maximum flow through the graph is guaranteed to be the same with all implementations, but the actual flow through each edge may vary.
sv: Det maximala flödet genom grafen är garanterat detsamma för alla implementeringar, men det faktiska flödet genom varje kant kan variera.
zh_hans: 所有实现中通过图表的最大流量保证相同，但通过每条边的实际流量可能会有所不同。

source: where :math:`edges\_sql = \{(id_i, source_i, target_i, capacity_i, reverse\_capacity_i)\}`
sv: där :math:`edges\_sql = \{(id_i, source_i, target_i, capacity_i, reverse\_capacity_i)\}``
zh_hans: 其中:math:`edges\_sql = \{(id_i, source_i, target_i, capacity_i, reverse\_capacity_i)\}`

source: Graph definition
sv: Definition av graf
zh_hans: 图定义

source: The weighted directed graph, :math:`G(V,E)`, is defined as:
sv: Den viktade riktade grafen, :math:`G(V,E)`, definieras som:
zh_hans: 加权有向图， :math:`G(V,E)` 定义为：

source: the set of vertices :math:`V`
sv: uppsättningen av hörn :math:`V`
zh_hans: 顶点集:math:`V`

source: Maximum flow problem
sv: Problem med maximalt flöde
zh_hans: 最大流量问题

source: pgRouting extends the `PostGIS <https://postgis.net>`__/`PostgreSQL <https://www.postgresql.org>`__ geospatial database to provide geospatial routing and other network analysis functionality.
sv: pgRouting utökar `PostGIS <https://postgis.net>`__/`PostgreSQL <https://www.postgresql.org>`__ geospatial databas för att tillhandahålla geospatial routing och annan nätverksanalysfunktionalitet.
zh_hans: pgRouting 扩展了 `PostGIS <https://postgis.net>`__/`PostgreSQL <https://www.postgresql.org>`__ 地理空间数据库，以提供地理空间路由和其他网络分析功能。

source: This is the manual for pgRouting |release|.
sv: Detta är manualen för pgRouting |release|.
zh_hans: 这是pgRouting|release|的手册

source: Creative Commons Attribution-Share Alike 3.0 License
sv: Creative Commons Erkännande-Dela Lika 3.0-licens
zh_hans: 知识共享署名 - 相同方式共享 3.0 许可证。

source: The pgRouting Manual is licensed under a `Creative Commons Attribution-Share Alike 3.0 License <https://creativecommons.org/licenses/by-sa/3.0/>`_. Feel free to use this material any way you like, but we ask that you attribute credit to the pgRouting Project and wherever possible, a link back to https://pgrouting.org. For other licenses used in pgRouting see the :ref:`license` page.
sv: Manualen för pgRouting är licensierad under en `Creative Commons Attribution-Share Alike 3.0 License <https://creativecommons.org/licenses/by-sa/3.0/>`_. Du är välkommen att använda detta material på vilket sätt du vill, men vi ber dig att ange pgRouting-projektet som källa och om möjligt en länk tillbaka till https://pgrouting.org. För andra licenser som används i pgRouting, se sidan :ref:`license`.
zh_hans: pgRouting 手册根据`知识共享署名-相同方式共享3.0许可证 <https://creativecommons.org/licenses/by-sa/3.0/>`_。 您可以随意使用本材料，但我们要求您将功劳归功于 pgRouting 项目，并尽可能提供返回 https://pgrouting.org 的链接。 有关 pgRouting 中使用的其他许可证，请参阅:ref:`license` page.。

source: General
sv: Allmänt
zh_hans: 常规

source: Pgrouting Concepts
sv: Koncept för injektering
zh_hans: Pgrouting概念

source: Functions by categories
sv: Funktioner per kategori
zh_hans: 按类别划分的函数

source: From the :doc:`TRSP-family`:
sv: Från :doc:`TRSP-familjen`:
zh_hans: 来自 :doc:`TRSP-family`:

source: Available Functions but not official pgRouting functions
sv: Tillgängliga funktioner men inte officiella pgRouting-funktioner
zh_hans: 可用函数，但不是官方 pgRouting 函数

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 4.0.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%204.0.0%22>`__
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 4.0.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%204.0.0%22>`__

source: Summary of changes by function
sv: Sammanfattning av förändringar per funktion

source: Combinations signature promoted to official.
sv: Kombinationer signatur befordrad till tjänsteman.

source: Output columns standardized to |short-generic-result|
sv: Utdatakolumner standardiserade till |kort-generiskt-resultat|

source: Output columns standardized to |result_node_color|
sv: Utdatakolumner standardiserade till |result_node_color|

source: Standardizing output columns to |result-spantree|
sv: Standardisering av utdatakolumner till |resultat-spantree|

source: Breaking change, signatures no longer available:
sv: Förändring på gång, signaturer inte längre tillgängliga:

source: Output columns standardized to |result_edge_color|
sv: Utgångskolumner standardiserade till |result_edge_color|

source: Output columns standardized to |generic-result|
sv: Utdatakolumner standardiserade till |generiskt resultat

source: All signatures promoted to official.
sv: Alla signaturer har uppgraderats till officiella.

source: Standardize output to |result-node-order|
sv: Standardisera utdata till |result-node-order|

source: Standardized output to |result-closure|
sv: Standardisera utdata till |result-closure|

source: Function promoted to official.
sv: Funktion befordrad till tjänsteman.

source: **Driving side** parameter is positional unnamed and compulsory.
sv: **Driving side** parametern är positionell, namnlös och obligatorisk.

source: Valid values depend on kind of graph
sv: Giltiga värden beror på typ av graf

source: Output columns standardized to |nksp-result|
sv: Utdatakolumner standardiserade till |nksp-resultat|

source: **Driving side** parameter is unnamed and compulsory.
sv: *parametern *Driving side** är inte namngiven och är obligatorisk.

source: Output columns standardized to |matrix-result|
sv: Utmatningskolumner standardiserade till |matris-resultat

source: Functions promoted to official
sv: Funktioner som befordrats till tjänsteman

source: `#2700 <https://github.com/pgRouting/pgrouting/issues/2700>`__ pgr_withPointsCost
sv: `#2700 <https://github.com/pgRouting/pgrouting/issues/2700>`__ pgr_medPointsCost

source: `#2700 <https://github.com/pgRouting/pgrouting/issues/2700>`__ pgr_withPointsDD
sv: `#2700 <https://github.com/pgRouting/pgrouting/issues/2700>`__ pgr_medPointsDD

source: Signatures promoted to official
sv: Underskrifter befordrade till officiella

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_aStar(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_aStar(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_aStarCost(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_aStarCost(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_bdAstar(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_bdAstar(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_bdAstarCost(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_bdAstarCost(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_bdDijkstra(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_bdDijkstra(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_bdDijkstraCost(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_bdDijkstraCost(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_dijkstra(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_dijkstra(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_dijkstraCost(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_dijkstraCost(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_KSP(All signatures)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_KSP(Alla signaturer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_boykovKolmogorov(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_boykovKolmogorov(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_edmondsKarp(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_edmondsKarp(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_maxFlow(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_maxFlow(Kombinationer)

source: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_pushRelabel(Combinations)
sv: `#2718 <https://github.com/pgRouting/pgrouting/issues/2918>`__ pgr_pushRelabel(Kombinationer)

source: SQL signatures and output standardization
sv: SQL-signaturer och standardisering av utdata

source: `#2904 <https://github.com/pgRouting/pgrouting/issues/2904>`__ Standardize output columns of functions with different output columns within overloads
sv: `#2904 <https://github.com/pgRouting/pgrouting/issues/2904>`__ Standardisera utdatakolumner för funktioner med olika utdatakolumner inom överbelastningar

source: Standardized to |short-generic-result|
sv: Standardiserad till |short-generic-result|

source: Standardized to |matrix-result|
sv: Standardiserat till |matris-resultat

source: Standardized to |generic-result|
sv: Standardiserat till |generiskt-resultat|

source: Standardized to |result_edge_color|
sv: Standardiserad till |result_edge_color|

source: Standardized to |result_node_color|
sv: Standardiserad till |result_node_color|

source: Standardized to |result-spantree|
sv: Standardiserad till |resultat-spantree|
