Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: ``pgr_lineGraph`` - Proposed
sv: ``pgr_lineGraph`` - Föreslagen

source: ``pgr_lineGraph`` — Transforms the given graph into its corresponding edge-based graph.
sv: ``pgr_lineGraph`` - Transformerar den givna grafen till dess motsvarande kantbaserade graf.
zh_hans: ``pgr_lineGraph`` — 将给定图转换为其相应的基于边的图。

source: Works for directed and undirected graphs.
sv: Fungerar för riktade och oriktade grafer.

source: Given a graph :math:`G`, its line graph :math:`L(G)` is a graph such that:
sv: Givet en graf :math:`G`, är dess linjegraf :math:`L(G)` en sådan graf att:

source: Each vertex of :math:`L(G)` represents an edge of :math:`G`.
sv: Varje toppunkt i :math:`L(G)` representerar en kant i :math:`G`.

source: Two vertices of :math:`L(G)` are adjacent if and only if their corresponding edges share a common endpoint in :math:`G`
sv: Två hörn i :math:`L(G)` är angränsande om och endast om deras motsvarande kanter har en gemensam ändpunkt i :math:`G`

source: The ``cost`` and ``reverse_cost`` columns of the result represent existence of the edge.
sv: Kolumnerna ``cost`` och ``reverse_cost`` i resultatet representerar existensen av kanten.

source: When the graph is directed the result is directed.
sv: När grafen är riktad är resultatet riktat.

source: To get the complete Line Graph use unique identifiers on the double way edges (See `Additional Examples`_).
sv: För att få en komplett linjediagram används unika identifierare på dubbelvägskanterna (se "Ytterligare exempel").

source: When the graph is undirected the result is undirected.
sv: När grafen är odränerad är resultatet odränerat.

source: The ``reverse_cost`` is always :math:`-1`.
sv: Den ``omvända_kostnaden`` är alltid :math:`-1`.

source: Returns set of |result-lineg|
sv: Returnerar uppsättning av |result-lineg|

source: For an undirected graph with edges :math:'{2,4,5,8}'
sv: För en enkelriktad graf med kanter :math:'{2,4,5,8}'

source: Gives a local identifier for the edge
sv: Ger en lokal identifierare för kanten
zh_hans: 给出边的本地标识符

source: When `negative`: the source is the reverse edge in the original graph.
sv: När `negativ`: källan är den omvända kanten i den ursprungliga grafen.
zh_hans: 为负时：源是原始图中的反向边。

source: When `negative`: the target is the reverse edge in the original graph.
sv: När `negativ`: målet är den omvända kanten i den ursprungliga grafen.
zh_hans: 为负时：目标是原始图中的反向边。

source: Weight of the edge (``source``, ``target``).
sv: Kantvikt (``källa``, ``mål``).
zh_hans: 边 (``source``, ``target``)的权重。

source: When `negative`: edge (``source``, ``target``) does not exist, therefore it’s not part of the graph.
sv: När `negativ`: kanten (``källa``, ``mål``) existerar inte, därför är den inte en del av grafen.
zh_hans: 当为负时：边(``source``, ``target``)不存在，因此它不是图的一部分。

source: Weight of the edge (``target``, ``source``).
sv: Kantvikt (``mål``, ``källa``).
zh_hans: 边 (``target``, ``source``)的权重。

source: When `negative`: edge (``target``, ``source``) does not exist, therefore it’s not part of the graph.
sv: När `negativ`: kant (``mål``, ``källa``) finns inte, därför är den inte en del av grafen.
zh_hans: 当为负时：边(``target``, ``source``)不存在，因此它不是图的一部分。

source: Given the following directed graph
sv: Givet följande riktade graf

source: Representation as directed with shared edge identifiers
sv: Representation som riktad med delade kantidentifierare

source: For the simplicity, the design of the edges table on the database, has the edge's identifiers are represented with 3 digits:
sv: För enkelhetens skull har utformningen av kanttabellen i databasen, att kanternas identifierare representeras med 3 siffror:

source: hundreds
sv: hundratals

source: the source vertex
sv: källvertexen

source: tens
sv: tiotals

source: always 0, acts as a separator
sv: alltid 0, fungerar som en separator

source: units
sv: enheter

source: the target vertex
sv: målvertexen

source: In this image,
sv: I den här bilden,

source: Single or double head arrows represent one edge (row) on the edges table.
sv: Pilarna med enkelt eller dubbelt huvud representerar en kant (rad) på kanttabellen.

source: The numbers in the yellow shadow are the edge identifiers.
sv: Siffrorna i den gula skuggan är kantidentifierare.

source: Two pair of edges share the same identifier when the ``reverse_cost`` column is used.
sv: Två par kanter delar samma identifierare när kolumnen ``reverse_cost`` används.

source: Edges :math:`{2 \rightarrow 3, 3 \rightarrow 2}` are represented with one edge row with :math:`id=203`.
sv: Kanterna :math:`{2 \rightarrow 3, 3 \rightarrow 2}` representeras av en kantrad med :math:`id=203`.

source: Edges :math:`{3 \rightarrow 4, 4 \rightarrow 3}` are represented with one edge row with :math:`id=304`.
sv: Kanterna :math:`{3 \rightarrow 4, 4 \rightarrow 3}` representeras av en kantrad med :math:`id=304`.

source: The graph can be created as follows:
sv: Grafen kan skapas på följande sätt:

source: Line Graph of a directed graph represented with shared edges
sv: Linjediagram över en riktad graf som representeras med delade kanter

source: The result is a directed graph.
sv: Resultatet är en riktad graf.

source: For :math:`seq=4` from :math:`203 \leftrightarrow 304` represent two edges
sv: För :math:`seq=4` från :math:`203 \vänster höger pil 304` representerar två kanter

source: For all the other values of ``seq`` represent one edge.
sv: För alla andra värden av ``seq`` representerar en kant.

source: The ``cost`` and ``reverse_cost`` values represent the existence of the edge.
sv: Värdena ``cost`` och ``reverse_cost`` anger om kanten existerar.

source: When positive: the edge exists.
sv: När den är positiv: kanten finns.

source: When negative: the edge does not exist.
sv: När den är negativ: kanten existerar inte.

source: Representation as directed with unique edge identifiers
sv: Representation som riktad med unika kantidentifierare

source: Single head arrows represent one edge (row) on the edges table.
sv: Pilarna med ett huvud representerar en kant (rad) i tabellen över kanter.

source: There are no double head arrows
sv: Det finns inga pilar med dubbla huvuden

source: Two pair of edges share the same ending nodes and the ``reverse_cost`` column is not used.
sv: Två par kanter har samma slutnoder och kolumnen ``reverse_cost`` används inte.

source: Edges :math:`{2 \rightarrow 3, 3 \rightarrow 2}` are represented with two edges :math:`id=203` and :math:`id=302` respectively.
sv: Kanterna :math:`{2 \rightarrow 3, 3 \rightarrow 2}` representeras med två kanter :math:`id=203` respektive :math:`id=302`.

source: Edges :math:`{3 \rightarrow 4, 4 \rightarrow 3}` are represented with two edges :math:`id=304` and :math:`id=403` respectively.
sv: Kanterna :math:`{3 \rightarrow 4, 4 \rightarrow 3}` representeras med två kanter :math:`id=304` respektive :math:`id=403`.

source: Line Graph of a directed graph represented with unique edges
sv: Linjediagram över en riktad graf som representeras med unika kanter

source: For :math:`seq=7` from :math:`203 \leftrightarrow 302` represent two edges.
sv: För :math:`seq=7` från :math:`203 \leftrightarrow 302` representerar två kanter.

source: For :math:`seq=8` from :math:`304 \leftrightarrow 403` represent two edges.
sv: För :math:`seq=8` från :math:`304 \vänster höger pil 403` representerar två kanter.

source: wikipedia: `Line Graph <https://en.wikipedia.org/wiki/Line_graph>`__
sv: wikipedia: `Linjediagram <https://en.wikipedia.org/wiki/Line_graph>`__

source: mathworld: `Line Graph <https://mathworld.wolfram.com/LineGraph.html>`__
sv: mathworld: `Linjegraf <https://mathworld.wolfram.com/LineGraph.html>`__

source: ``pgr_lineGraphFull`` - Experimental
sv: ``pgr_lineGraphFull`` - Experimentell
zh_hans: ``pgr_lineGraphFull`` - 实验

source: ``pgr_lineGraphFull`` — Transforms a given graph into a new graph where all of the vertices from the original graph are converted to line graphs.
sv: ``pgr_lineGraphFull`` - Transformerar en given graf till en ny graf där alla hörn från den ursprungliga grafen konverteras till linjegrafer.
zh_hans: ``pgr_lineGraphFull`` —将给定图转换为新图，其中原始图的所有顶点都转换为线图。

source: ``pgr_lineGraphFull``, converts original directed graph to a directed line graph by converting each vertex to a complete graph and keeping all the original edges. The new connecting edges have a cost 0 and go between the adjacent original edges, respecting the directionality.
sv: ``pgr_lineGraphFull``, konverterar en ursprunglig riktad graf till en riktad linjegraf genom att konvertera varje vertex till en komplett graf och behålla alla ursprungliga kanter. De nya anslutande kanterna har en kostnad på 0 och går mellan de intilliggande ursprungliga kanterna, med respekt för riktningen.
zh_hans: ``pgr_lineGraphFull``, 通过将每个顶点转换为完全图并保留所有原始边，将原始有向图转换为有向线图。 新的连接边的成本为 0，并位于相邻的原始边之间，尊重方向性。

source: A possible application of the resulting graph is **"routing with two edge restrictions"**:
sv: En möjlig tillämpning av den resulterande grafen är **"routing med två kantbegränsningar"**:
zh_hans: 结果图的一个可能的应用是 **"具有两个边限制的路由"**：

source: Setting a cost of using the vertex when routing between edges on the connecting edge
sv: Ställer in en kostnad för att använda vertexen vid routing mellan kanter på den anslutande kanten
zh_hans: 设置在连接边上的边之间布线时使用顶点的成本

source: Forbid the routing between two edges by removing the connecting edge
sv: Förbjud routing mellan två kanter genom att ta bort den anslutande kanten
zh_hans: 通过删除连接边来禁止两条边之间的布线

source: This is possible because each of the intersections (vertices) in the original graph are now complete graphs that have a new edge for each possible turn across that intersection.
sv: Detta är möjligt eftersom alla korsningar (hörnpunkter) i den ursprungliga grafen nu är kompletta grafer som har en ny kant för varje möjlig sväng över korsningen.
zh_hans: 这是可能的，因为原始图中的每个交叉点（顶点）现在都是完整的图，对于穿过该交叉点的每个可能的转弯都有一条新边。

source: This function is for **directed** graphs.
sv: Denna funktion är avsedd för **riktade** grafer.
zh_hans: 该函数适用于**有向**图。

source: Results are undefined when a negative vertex id is used in the input graph.
sv: Resultaten är odefinierade när ett negativt vertex-id används i indatagrafen.
zh_hans: 当输入图中使用负顶点 id 时，结果是不确定的。

source: Results are undefined when a duplicated edge id is used in the input graph.
sv: Resultaten är odefinierade när ett duplicerat kant-ID används i indatagrafen.
zh_hans: 当输入图中使用重复的边 id 时，结果是不确定的。

source: Running time: TBD
sv: Löptid: TBD
zh_hans: 运行时间：TBD（待定）

source: Returns set of |result-linegf|
sv: Returnerar uppsättning av |result-linegf|
zh_hans: 返回 |result-linegf| 的集合

source: Full line graph of subgraph of edges :math:`\{4, 7, 8, 10\}`
sv: Fullständig linjegraf av delgraf av kanter :math:`{\4, 7, 8, 10\}`
zh_hans: 边:math:`\{4, 7, 8, 10\}`子图的全线图

source: The examples include the subgraph including edges 4, 7, 8, and 10 with ``reverse_cost``.
sv: Exemplen inkluderar delgrafen som innehåller kanterna 4, 7, 8 och 10 med ``reverse_cost``.

source: The data
sv: Uppgifterna
zh_hans: 数据

source: This example displays how this graph transformation works to create additional edges for each possible turn in a graph.
sv: Detta exempel visar hur denna grafomvandling fungerar för att skapa ytterligare kanter för varje möjlig vändning i en graf.
zh_hans: 此示例显示此图形转换如何为图形中的每个可能的转弯创建附加边。

source: |first|
sv: |första|

source: first
sv: första
zh_hans: 首先

source: The transformation
sv: Omvandlingen
zh_hans: 转变

source: |second|
sv: |sekund|

source: second
sv: sekund
zh_hans: 第二

source: In the transformed graph, all of the edges from the original graph are still present (yellow), but we now have additional edges for every turn that could be made across vertex 7 (orange).
sv: I den transformerade grafen finns alla kanter från den ursprungliga grafen kvar (gult), men vi har nu ytterligare kanter för varje sväng som skulle kunna göras över toppunkt 7 (orange).
zh_hans: 在转换后的图中，原始图中的所有边仍然存在（黄色），但现在我们为跨顶点 7 的每个转弯提供了额外的边（橙色）。

source: Creating table that identifies transformed vertices
sv: Skapa tabell som identifierar transformerade toppar
zh_hans: 创建标识变换顶点的表

source: The vertices in the transformed graph are each created by splitting up the vertices in the original graph. Unless a vertex in the original graph is a leaf vertex, it will generate more than one vertex in the transformed graph. One of the newly created vertices in the transformed graph will be given the same vertex identifier as the vertex that it was created from in the original graph, but the rest of the newly created vertices will have negative vertex ids.
sv: Varje toppunkt i den transformerade grafen skapas genom att dela upp toppunkterna i den ursprungliga grafen. Om inte en vertex i den ursprungliga grafen är en bladvertex kommer den att generera mer än en vertex i den transformerade grafen. Ett av de nyskapade vertexen i den transformerade grafen får samma vertexidentifierare som det vertex som det skapades från i den ursprungliga grafen, men resten av de nyskapade vertexen får negativa vertexidentifierare.
zh_hans: 变换后的图中的每个顶点都是通过分割原始图中的顶点而创建的。 除非原始图中的某个顶点是叶顶点，否则它将在变换后的图中生成多个顶点。 转换后的图中新创建的顶点之一将被赋予与原始图中创建它的顶点相同的顶点标识符，但新创建的其余顶点将具有负顶点 id。

source: Following is an example of how to generate a table that maps the ids of the newly created vertices with the original vertex that they were created from
sv: Här följer ett exempel på hur man genererar en tabell som mappar id:n för de nyskapade topparna med den ursprungliga topp som de skapades från
zh_hans: 以下是如何生成一个表的示例，该表将新创建的顶点的 id 与创建它们的原始顶点进行映射

source: Store edge results
sv: Förvara kantresultat
zh_hans: 存储边结果

source: The first step is to store the results of the ``pgr_lineGraphFull`` call into a table
sv: Det första steget är att lagra resultatet av anropet ``pgr_lineGraphFull`` i en tabell
zh_hans: 第一步是将 ``pgr_lineGraphFull``调用的结果存储到表中

source: Create the mapping table
sv: Skapa mappningstabellen
zh_hans: 创建映射表

source: From the original graph's vertex information
sv: Från den ursprungliga grafens toppunktsinformation
zh_hans: 从原始图的顶点信息

source: Add the new vertices
sv: Lägg till de nya hörnen
zh_hans: 增加新的顶点

source: Filling the mapping table
sv: Fylla kartläggningstabellen
zh_hans: 填写映射表

source: The positive vertex identifiers are the original identifiers
sv: De positiva vertexidentifierarna är de ursprungliga identifierarna
zh_hans: 正的顶点标识符是原始标识符

source: Inspecting the vertices map
sv: Inspektion av kartan över hörnpunkter
zh_hans: 检查顶点图

source: The self loops happen when there is no cost traveling to the ``target`` and the source has an original value.
sv: Självslingorna uppstår när det inte kostar något att resa till "målet" och källan har ett ursprungligt värde.
zh_hans: 当没有成本到达目标并且源具有原始值时，就会发生自循环。

source: Updating values from self loops
sv: Uppdatering av värden från självloopar
zh_hans: 从自循环更新值

source: Inspecting the vertices table
sv: Inspektera tabellen över hörnpunkter
zh_hans: 检查顶点表

source: Updating from inner self loops
sv: Uppdatering från inre självloopar
zh_hans: 从内部自我循环更新

source: Adding a soft restriction
sv: Lägga till en mjuk begränsning
zh_hans: 添加软限制

source: A soft restriction going from vertex 6 to vertex 3 using edges 4 -> 7 is wanted.
sv: En mjuk begränsning som går från toppunkt 6 till toppunkt 3 med hjälp av kanterna 4 -> 7 önskas.
zh_hans: 需要使用边 4 -> 7 从顶点 6 到顶点 3 的软限制。

source: Identifying the restriction
sv: Identifiering av begränsningen

source: Running a :doc:`pgr_dijkstraNear` the edge with cost 0, edge 8, is where the cost will be increased
sv: Kör en :doc:`pgr_dijkstraNear` kanten med kostnad 0, kant 8, är där kostnaden kommer att ökas
zh_hans: 运行 :doc:`pgr_dijkstraNear` 时，成本将会增加的地方是边 8，其成本为 0

source: The edge to be altered is ``WHERE cost = 0 AND seq != 1 AND edge != -1`` from the previous query:
sv: Kanten som ska ändras är ``WHERE cost = 0 AND seq != 1 AND edge != -1`` från den föregående frågan:

source: Adding a value to the restriction
sv: Lägga till ett värde till begränsningen
zh_hans: 向限制添加值

source: Updating the cost to the edge:
sv: Uppdatering av kostnaden till kanten:
zh_hans: 将成本更新到边：

source: Routing from :math:`6` to :math:`3`
sv: Omdirigering från :math:`6` till :math:`3`
zh_hans: 路由从 :math:`6`到 :math:`3`

source: Now the route does not use edge 8 and does a U turn on a leaf vertex.
sv: Nu använder rutten inte kant 8 och gör en U-sväng på en bladvertex.
zh_hans: 现在，该路线不使用边 8，而是在叶顶点上进行 U 形转弯。

source: Simplifying leaf vertices
sv: Förenkling av bladhörnpunkter
zh_hans: 简化叶顶点

source: In this example, there is no additional cost for traversing a leaf vertex.
sv: I det här exemplet tillkommer ingen extra kostnad för att passera en bladvertex.
zh_hans: 在这个例子中，遍历叶顶点没有额外的成本。

source: Using the vertex map give the leaf verices their original value.
sv: Med hjälp av vertexkartan ger du bladvertices deras ursprungliga värde.
zh_hans: 使用顶点图赋予叶顶点其原始值。

source: On the source column
sv: På källkolumnen
zh_hans: 在source 列

source: On the target column
sv: På målkolumnen
zh_hans: 在target列

source: Removing self loops on leaf nodes
sv: Ta bort självloopar på bladnoder
zh_hans: 删除叶节点上的自循环

source: The self loops of the leaf nodes are
sv: Bladnodernas självslingor är
zh_hans: 叶节点的自循环为

source: Which can be removed
sv: Som kan tas bort
zh_hans: 哪些可以删除

source: Routing can be done now using the original vertices id using :doc:`pgr_dijkstra`
sv: Routing kan nu göras med hjälp av originalvertices id med :doc:`pgr_dijkstra`
zh_hans: 现在可以使用 :doc:`pgr_dijkstra` 使用原始顶点 id 来完成路由

source: Complete routing graph
sv: Komplett routningsgraf
zh_hans: 完整的路由图

source: Add edges from the original graph
sv: Lägg till kanter från den ursprungliga grafen
zh_hans: 从原始图中添加边

source: Add all the edges that are not involved in the line graph process to the new table
sv: Lägg till alla kanter som inte är involverade i linjediagramprocessen i den nya tabellen
zh_hans: 将所有不参与折线图过程的边添加到新表中

source: Some administrative tasks to get new identifiers for the edges
sv: Vissa administrativa uppgifter för att få nya identifierare för kanterna
zh_hans: 一些获取边新标识符的管理任务

source: Add the newly calculated edges
sv: Lägg till de nyligen beräknade kanterna
zh_hans: 添加新计算的边

source: Using the routing graph
sv: Använda routningsgrafen
zh_hans: 使用路由图

source: When using this method for routing with soft restrictions there will be uturns
sv: När du använder den här metoden för routning med mjuka begränsningar kommer det att finnas uturns
zh_hans: 当使用这种方法进行具有软限制的路由时，将会出现 uturn

source: Routing from :math:`5` to :math:`1`
sv: Routning från :math:`5` till :math:`1`
zh_hans: 路由从 :math:`5` 到:math:`1`

source: ``pgr_makeConnected`` - Experimental
sv: ``pgr_makeConnected`` - Experimentell
zh_hans: ``pgr_makeConnected`` - 实验

source: ``pgr_makeConnected`` — Set of edges that will connect the graph.
sv: ``pgr_makeConnected`` - Uppsättning kanter som kommer att ansluta grafen.
zh_hans: ``pgr_makeConnected`` — 连接图的边集。

source: Adds the minimum number of edges needed to make the input graph connected. The algorithm first identifies all of the connected components in the graph, then adds edges to connect those components together in a path. For example, if a graph contains three connected components A, B, and C, make_connected will add two edges. The two edges added might consist of one connecting a vertex in A with a vertex in B and one connecting a vertex in B with a vertex in C.
sv: Lägger till det minsta antal kanter som behövs för att göra indatagrafen ansluten. Algoritmen identifierar först alla anslutna komponenter i grafen och lägger sedan till kanter för att ansluta dessa komponenter till varandra i en väg. Om en graf t.ex. innehåller tre anslutna komponenter A, B och C lägger make_connected till två kanter. De två kanterna som läggs till kan bestå av en som förbinder ett toppunkt i A med ett toppunkt i B och en som förbinder ett toppunkt i B med ett toppunkt i C.
zh_hans: 添加使输入图连接所需的最小边数。 该算法首先识别图中的所有连接组件，然后添加边以将这些组件在路径中连接在一起。 例如，如果一个图包含三个连通分量 A、B 和 C，则 make_connected 将添加两条边。 添加的两条边可能包括一条连接 A 中的顶点与 B 中的顶点的边，以及一条连接 B 中的顶点与 C 中的顶点的边。

source: It will give a minimum list of all edges which are needed in the graph to make connect it.
sv: Det kommer att ge en minimilista över alla kanter som behövs i grafen för att ansluta den.
zh_hans: 它将给出图中连接它所需的所有边的最小列表。

source: The algorithm does not considers geometric topology in the calculations.
sv: Algoritmen tar inte hänsyn till geometrisk topologi i beräkningarna.
zh_hans: 该算法在计算中不考虑遍历成本。

source: Returns set of |result-component-make|
sv: Returnerar uppsättning av |resultat-komponent-make|

source: List of edges that are needed to connect the graph.
sv: Lista över kanter som behövs för att koppla ihop grafen.

source: `Boost: make connected <https://www.boost.org/libs/graph/doc/make_connected.html>`__
sv: `Boost: skapa anslutning <https://www.boost.org/libs/graph/doc/make_connected.html>`__

source: ``pgr_maxCardinalityMatch`` — Calculates a maximum cardinality matching in a graph.
sv: ``pgr_maxCardinalityMatch`` - Beräknar en matchning med maximal kardinalitet i en graf.
zh_hans: ``pgr_maxCardinalityMatch`` — 计算图中的最大基数匹配。.

source: Deprecated signature
sv: Föråldrad signatur
zh_hans: 已弃用的签名

source: directed => ``false`` when used.
sv: riktad => ``false`` när den används.

source: Renamed from ``pgr_maximumCardinalityMatching``
sv: Omdöpta från ``pgr_maximumCardinalityMatching``
zh_hans: 从 ``pgr_maximumCardinalityMatching`` 重命名

source: A matching or independent edge set in a graph is a set of edges without common vertices.
sv: En matchande eller oberoende kantuppsättning i en graf är en uppsättning kanter utan gemensamma toppar.
zh_hans: 图中的匹配或独立边集是一组没有公共顶点的边。

source: A maximum matching is a matching that contains the largest possible number of edges.
sv: En maximal matchning är en matchning som innehåller största möjliga antal kanter.
zh_hans: 最大匹配是包含尽可能多的边的匹配。

source: There may be many maximum matchings.
sv: Det kan finnas många maximala matchningar.
zh_hans: 可能有很多最大匹配。

source: Calculates one possible maximum cardinality matching in a graph.
sv: Beräknar en möjlig matchning med maximal kardinalitet i en graf.
zh_hans: 计算图中一种可能的最大基数匹配。

source: Running time: :math:`O( E*V * \alpha(E,V))`
sv: Speltid: :math:`O( E*V * \alpha(E,V))`
zh_hans: 运行时间： :math:`O( E*V * \alpha(E,V))`

source: Using all edges.
sv: Använd alla kanter.
zh_hans: 使用所有边。

source: SQL query, which should return a set of rows with the following columns:
sv: SQL-fråga, som ska returnera en uppsättning rader med följande kolumner:
zh_hans: SQL 查询，应返回一组包含以下列的行：

source: A positive value represents the existence of the edge (``source``, ``target``).
sv: Ett positivt värde representerar existensen av kanten (``källa``, ``mål``).
zh_hans: 正值表示存在边(``source``, ``target``)。

source: A positive value represents the existence of the edge (``target``, ``source``)
sv: Ett positivt värde representerar existensen av kanten (``target``, ``source``)
zh_hans: 正值表示存在边(``target``, ``source``)

source: Identifier of the edge in the original query.
sv: Identifierare av kanten i den ursprungliga frågan.
zh_hans: 原始查询中边的标识符。

source: ``pgr_maxFlow`` — Calculates the maximum flow in a directed graph from the source(s) to the targets(s) using the Push Relabel algorithm.
sv: ``pgr_maxFlow`` - Beräknar det maximala flödet i en riktad graf från källorna till målen med hjälp av Push Relabel-algoritmen.
zh_hans: ``pgr_maxFlow`` —使用 Push Relabel 算法计算有向图中从源到目标的最大流量。

source: Calculates the maximum flow from the sources to the targets.
sv: Beräknar det maximala flödet från källorna till målen.

source: When the maximum flow is **0** then there is no flow and **0** is returned.
sv: När det maximala flödet är **0** finns det inget flöde och **0** returneras.
zh_hans: 当最大流量为**0**时则没有流量，返回**0**。
