Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Most of the effort of the documentation has been on the html files.
sv: Det mesta av arbetet med dokumentationen har lagts på html-filerna.
zh_hans: 文档的大部分工作都集中在 html 文件上。

source: Building
sv: Byggnad
zh_hans: 构建

source: Using ``make`` to build the code and the documentation
sv: Använda ``make`` för att bygga koden och dokumentationen
zh_hans: 使用 ``make`` 构建代码和文档

source: The following instructions start from *path/to/pgrouting/build*
sv: Följande instruktioner startar från *stig/till/pgrouting/build*
zh_hans: 以下说明从*path/to/pgrouting/build*开始

source: We have tested on several platforms, For installing or reinstalling all the steps are needed.
sv: Vi har testat på flera plattformar, För installation eller ominstallation behövs alla steg.
zh_hans: 我们已经在多个平台上进行了测试，安装或重新安装需要所有步骤。

source: The sql signatures are configured and build in the ``cmake`` command.
sv: Sql-signaturerna konfigureras och byggs i kommandot ``cmake``.
zh_hans: SQL签名是在``cmake``命令中配置和构建的。

source: MinGW on Windows
sv: MinGW på Windows
zh_hans: Windows 上的 MinGW

source: The following instructions start from *path/to/pgrouting*
sv: Följande instruktioner börjar från *väg/till/grouting*
zh_hans: 以下说明从 *path/to/pgrouting*开始

source: To remove the build when the configuration changes, use the following code:
sv: Använd följande kod för att ta bort build när konfigurationen ändras:
zh_hans: 要在配置更改时删除构建，请使用以下代码：

source: and start the build process as mentioned previously.
sv: och starta byggprocessen som tidigare nämnts.
zh_hans: 并开始前面提到的构建过程。

source: Testing
sv: Testar
zh_hans: 测试

source: Currently there is no :code:`make test` and testing is done as follows
sv: För närvarande finns det ingen :code:`make test` och testning görs på följande sätt
zh_hans: 目前没有:code:`make test`，测试如下

source: The following instructions start from *path/to/pgrouting/*
sv: Följande instruktioner startar från *stig/till/pgrouting/*
zh_hans: 以下指令从*path/to/pgrouting/*开始

source: pgRouting is an extension of `PostGIS <https://postgis.net>`__ and `PostgreSQL <https://www.postgresql.org>`__ geospatial database and adds routing and other network analysis functionality. A predecessor of pgRouting – pgDijkstra, written by Sylvain Pasche from `Camptocamp <https://camptocamp.com>`__, was later extended by Orkney and renamed to pgRouting. The project is now supported and maintained by `Georepublic <https://georepublic.info>`__, `Paragon Corporation <https://www.paragoncorporation.com/>`__ and a broad user community.
sv: pgRouting är en förlängning av `PostGIS <https://postgis.net>`__ och `PostgreSQL <https://www.postgresql.org>`__ geospatial databas och lägger till routing och annan nätverksanalysfunktionalitet. En föregångare till pgRouting - pgDijkstra, skriven av Sylvain Pasche från `Camptocamp <https://camptocamp.com>`__, utökades senare av Orkney och döptes om till pgRouting. Projektet stöds och underhålls nu av `Georepublic <https://georepublic.info>`__, `Paragon Corporation <https://www.paragoncorporation.com/>`__ och en bred användargrupp.
zh_hans: pgRouting 是 `PostGIS <https://postgis.net>`__ 和 `PostgreSQL <https://www.postgresql.org>`__ 地理空间数据库的扩展，并添加了路由和其他网络分析功能。 pgRouting的前身——pgDijkstra，由`Camptocamp <https://camptocamp.com>`__的Sylvain Pasche编写，后来被Orkney扩展并更名为pgRouting。 该项目现在得到了 `Georepublic <https://georepublic.info>`__、`Paragon Corporation <https://www.paragoncorporation.com/>`__ 和广大用户社区的支持和维护。

source: pgRouting is part of `OSGeo Community Projects <https://wiki.osgeo.org/wiki/OSGeo_Community_Projects>`__ from the `OSGeo Foundation <https://www.osgeo.org>`__ and included on `OSGeoLive <http://live.osgeo.org/>`__.
sv: pgRouting är en del av `OSGeo Community Projects <https://wiki.osgeo.org/wiki/OSGeo_Community_Projects>`__ från `OSGeo Foundation <https://www.osgeo.org>`__ och ingår i `OSGeoLive <http://live.osgeo.org/>`__.
zh_hans: pgRouting 是 `OSGeo 基金会 <https://www.osgeo.org>`__ `OSGeo 社区项目 <https://wiki.osgeo.org/wiki/OSGeo_Community_Projects>`__ 的一部分，并包含在 `OSGeoLive <http://live.osgeo.org/>`__中。

source: Licensing
sv: Licens
zh_hans: 许可

source: The following licenses can be found in pgRouting:
sv: Följande licenser finns i pgRouting:
zh_hans: 可以在 pgRouting 中找到以下许可证：

source: **License**
sv: **Licens**
zh_hans: **许可**

source: GNU General Public License v2.0 or later
sv: GNU General Public License v2.0 eller senare
zh_hans: GNU 通用公共许可证 v2.0 或更高版本

source: Most features of pgRouting are available under `GNU General Public License v2.0 or later <https://spdx.org/licenses/GPL-2.0-or-later.html>`_.
sv: De flesta funktioner i pgRouting är tillgängliga under `GNU General Public License v2.0 eller senare <https://spdx.org/licenses/GPL-2.0-or-later.html>`_.
zh_hans: pgRouting 的大多数功能都可以在` GNU 通用公共许可证 v2.0 或更高版本<https://spdx.org/licenses/GPL-2.0-or-later.html>`_下使用。

source: Boost Software License - Version 1.0
sv: Licens för Boost-programvara - Version 1.0
zh_hans: Boost 软件许可证 - 版本 1.0

source: Some Boost extensions are available under `Boost Software License - Version 1.0 <https://www.boost.org/LICENSE_1_0.txt>`_.
sv: Vissa Boost-tillägg är tillgängliga under `Boost Software License - Version 1.0 <https://www.boost.org/LICENSE_1_0.txt>`_.
zh_hans: 一些 Boost 扩展可根据` Boost 软件许可证 - 版本 1.0 获得<https://www.boost.org/LICENSE_1_0.txt>`_。

source: MIT-X License
sv: MIT-X-licens

source: Some code contributed by iMaptools.com is available under MIT-X license.
sv: Viss kod som tillhandahålls av iMaptools.com är tillgänglig under MIT-X-licens.
zh_hans: iMaptools.com 贡献的一些代码可在 MIT-X 许可证下使用。

source: The pgRouting Manual is licensed under a `Creative Commons Attribution-Share Alike 3.0 License <https://creativecommons.org/licenses/by-sa/3.0/>`_.
sv: Manualen för pgRouting är licensierad under en `Creative Commons Attribution-Share Alike 3.0 License <https://creativecommons.org/licenses/by-sa/3.0/>`_.
zh_hans: pgRouting 手册根据`知识共享署名-相同方式共享 3.0 许可证获得许可 <https://creativecommons.org/licenses/by-sa/3.0/>`_。

source: In general license information should be included in the header of each source file.
sv: I allmänhet bör licensinformation inkluderas i sidhuvudet för varje källfil.
zh_hans: 一般来说，许可证信息应包含在每个源文件的标头中。

source: Contributors
sv: Medverkande
zh_hans: 贡献者

source: This Release Contributors
sv: Medverkande i denna utgåva
zh_hans: 此版本贡献者

source: Individuals in this release v3.8.x (in alphabetical order)
sv: Individer i denna utgåva v3.8.x (i alfabetisk ordning)

source: And all the people that give us a little of their time making comments, finding issues, making pull requests etc. in any of our products: osm2pgrouting, pgRouting, pgRoutingLayer, workshop.
sv: Och alla de människor som ger oss lite av sin tid genom att kommentera, hitta problem, göra pull requests etc. i någon av våra produkter: osm2pgrouting, pgRouting, pgRoutingLayer, workshop.
zh_hans: 还有所有为我们的产品（osm2pgrouting、pgRouting、pgRoutingLayer、workshop）提供意见、发现问题、提出拉取请求等的人们。

source: Translators (in alphabetical order)
sv: Översättare (i alfabetisk ordning)

source: Corporate Sponsors in this release (in alphabetical order)
sv: Företagssponsorer i denna utgåva (i alfabetisk ordning)
zh_hans: 本次发布中的企业赞助商（按字母顺序排列）

source: These are corporate entities that have contributed developer time, hosting, or direct monetary funding to the pgRouting project:
sv: Dessa är företagsenheter som har bidragit med utvecklingstid, hosting eller direkt monetär finansiering till pgRouting-projektet:
zh_hans: 这些是为 pgRouting 项目贡献了开发人员时间、托管或直接货币资金的公司实体：

source: `OSGeo UK <https://uk.osgeo.org>`__
sv: oSGeo Storbritannien <https://uk.osgeo.org>`__

source: `Google Summer of Code <https://summerofcode.withgoogle.com>`__
sv: googles sommarprogram för kodning <https://summerofcode.withgoogle.com>`__

source: `HighGo Software <https://www.highgo.com/>`__
sv: `HighGo-programvara <https://www.highgo.com/>`__

source: Contributors Past & Present:
sv: Tidigare och nuvarande bidragsgivare:
zh_hans: 过去与现在的贡献者：

source: Individuals (in alphabetical order)
sv: Enskilda personer (i alfabetisk ordning)
zh_hans: 个人贡献者（按字母排序）

source: Corporate Sponsors (in alphabetical order)
sv: Företagssponsorer (i alfabetisk ordning)
zh_hans: 企业赞助商（按字母顺序排列）

source: CSIS (University of Tokyo)
sv: CSIS (Universitetet i Tokyo)

source: Georepublic
sv: Georepublik

source: HighGo Software
sv: HighGo programvara

source: OSGeo UK
sv: OSGeo Storbritannien

source: More Information
sv: Mer information
zh_hans: 更多信息

source: The latest software, documentation and news items are available at the pgRouting web site https://pgrouting.org.
sv: Den senaste programvaran, dokumentationen och nyheter finns tillgängliga på pgRoutings webbplats https://pgrouting.org.
zh_hans: 最新的软件、文档和新闻可在 pgRouting 网站 https://pgrouting.org 上获取。

source: PostgreSQL database server at the PostgreSQL main site https://www.postgresql.org.
sv: PostgreSQL-databasserver på PostgreSQL-huvudwebbplatsen https://www.postgresql.org.
zh_hans: PostgreSQL 数据库服务器位于 PostgreSQL 主站点 https://www.postgresql.org。

source: PostGIS extension at the PostGIS project web site https://postgis.net.
sv: PostGIS-tillägg på PostGIS-projektets webbplats https://postgis.net.
zh_hans: PostGIS 项目网站 https://postgis.net 上的 PostGIS 扩展。

source: Boost C++ source libraries at https://www.boost.org.
sv: Boost C++-källbibliotek på https://www.boost.org.
zh_hans: Boost C++ 源库位于 https://www.boost.org。

source: ``pgr_KSP`` — Yen's algorithm for K shortest paths using Dijkstra.
sv: ``pgr_KSP`` - Yen's algoritm för K kortaste vägar med hjälp av Dijkstra.
zh_hans: ``pgr_KSP`` — Yen 使用 Dijkstra 计算 K 最短路径的算法。

source: Availability
sv: Tillgänglighet
zh_hans: 可用性

source: Standardizing output columns to |nksp-result|
sv: Standardisering av utdatakolumner till |nksp-result|

source: Added ``start_vid`` and ``end_vid`` result columns.
sv: Lagt till resultatkolumnerna ``start_vid`` och ``end_vid``.
zh_hans: 增加``start_vid``和``end_vid``结果列。

source: New proposed signatures:
sv: Nya föreslagna signaturer:
zh_hans: 新拟议的签名：

source: Signature change
sv: Ändring av signatur
zh_hans: 签名变更

source: Old signature no longer supported
sv: Gammal signatur stöds inte längre
zh_hans: 不再支持旧签名

source: Official function.
sv: Officiell funktion.

source: The K shortest path routing algorithm based on Yen's algorithm. "K" is the number of shortest paths desired.
sv: Algoritmen K för kortaste vägen baseras på Yens algoritm. "K" är antalet önskade kortaste vägar.
zh_hans: 基于Yen算法的K最短路径路由算法。 “K”是所需的最短路径的数量。

source: |Boost| Boost Graph Inside
sv: |Boost-graf inuti

source: Boost Graph inside
sv: Öka grafen inuti

source: Signatures
sv: Underskrifter
zh_hans: 签名

source: Summary
sv: Sammanfattning
zh_hans: 总结

source: Returns set of |nksp-result|
sv: Returnerar uppsättning av |nksp-resultat|
zh_hans: 返回集合|nksp-result|

source: OR EMPTY SET
sv: ELLER TOM UPPSÄTTNING

source: Example
sv: Exempel
zh_hans: 示例

source: Get 2 paths from :math:`6` to :math:`17` on a directed graph.
sv: Hämta 2 vägar från :math:`6` till :math:`17` på en riktad graf.
zh_hans: 在有向图上获取从 :math:`6` 到 :math:`17`的 2 条路径。

source: Get 2 paths from vertex :math:`6` to vertices :math:`\{10, 17\}` on a directed graph.
sv: Hämta 2 vägar från toppunkten :math:`6` till toppunkterna :math:`\{10, 17\}` i en riktad graf.
zh_hans: 获取有向图上从顶点:math:`6`到顶点 :math:`\{10, 17\}`的 2 条路径。

source: Get 2 paths from vertices :math:`\{6, 1\}` to vertex :math:`17` on a directed graph.
sv: Hämta 2 vägar från topparna :math:`\{6, 1\}` till toppunkten :math:`17` i en riktad graf.
zh_hans: 在有向图中得到从顶点 :math:`\{6, 1\}`到顶点 :math:`17`的2条路经。

source: Get 2 paths vertices :math:`\{6, 1\}` to vertices :math:`\{10, 17\}` on a directed graph.
sv: Hämta 2 vägar från topparna :math:`\{6, 1\}` till topparna :math:`\{10, 17\}` i en riktad graf.
zh_hans: 在有向图中得到从顶点 :math:`\{6, 1\}`到顶点 :math:`\{10, 17\}`的2条路经。

source: Using a combinations table on an directed graph
sv: Använda en kombinationstabell på en riktad graf
zh_hans: 在有向图上使用组合表

source: The combinations table:
sv: Kombinationsbordet:
zh_hans: 组合表：

source: The query:
sv: Frågeställningen:
zh_hans: 查询：

source: Identifier of the destination vertex.
sv: Identifierare för målvertexen.
zh_hans: 目标顶点的标识符。

source: Number of required paths.
sv: Antal nödvändiga sökvägar.
zh_hans: 所需路径的数量。

source: KSP Optional parameters
sv: KSP Valfria parametrar
zh_hans: KSP 可选参数

source: When ``false`` Returns at most K paths.
sv: När ``false`` Returnerar högst K sökvägar.
zh_hans: 当``false``时返回最多 K 条路径。

source: When ``true`` all the calculated paths while processing are returned.
sv: När ``true`` returneras alla beräknade banor under bearbetningen.
zh_hans: 当 ``true`` 时，返回处理时的所有计算路径。

source: Roughly, when the shortest path has ``N`` edges, the heap will contain about than ``N * K`` paths for small value of ``K`` and ``K > 5``.
sv: Grovt sett, när den kortaste vägen har ``N`` kanter, kommer högen att innehålla ungefär än ``N * K`` vägar för litet värde av ``K`` och ``K > 5``.
zh_hans: 粗略地说，当最短路径有 ``N`` 个边时，对于``K``值较小且``K > 5``，堆将包含大约 ``N * K`` 条路径。

source: Additional Examples
sv: Ytterligare exempel
zh_hans: 其他示例

source: Get 2 paths from :math:`6` to :math:`17` on an undirected graph
sv: Hämta 2 vägar från :math:`6` till :math:`17` på en odelad graf
zh_hans: 在无向图中获取从 :math:`6`到:math:`17`的2条路径

source: Also get the paths in the heap.
sv: Hämta även sökvägarna i högen.
zh_hans: 还获取堆中的路径。

source: Get 2 paths using combinations table on an undirected graph
sv: Få 2 vägar med hjälp av kombinationstabell på en oriktad graf
zh_hans: 使用无向图上的组合表获取 2 条路径

source: Get 2 paths from vertices :math:`\{6, 1\}` to vertex :math:`17` on a undirected graph.
sv: Hämta 2 vägar från topparna :math:`\{6, 1\}` till toppunkten :math:`17` i en odelad graf.
zh_hans: 在无向图中获取从顶点 :math:`\{6, 1\}`到顶点:math:`17`的2条路径。

source: ``pgr_TSP`` - Approximation using *metric* algorithm.
sv: ``pgr_TSP`` - Approximation med hjälp av *metrisk* algoritm.

source: Availability:
sv: Tillgänglighet:
zh_hans: 可用性：

source: Results change depending on input order
sv: Resultaten ändras beroende på inmatningsordning

source: Only for undirected graphs
sv: Endast för odelade grafer

source: Metric Algorithm from `Boost library <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__
sv: Metrisk algoritm från `Boost-biblioteket <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__
zh_hans: `Boost库 <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__中的度量算法

source: Simulated Annealing Algorithm no longer supported
sv: Simulated Annealing Algorithm stöds inte längre
zh_hans: Simulated Annealing算法不再受支持

source: The Simulated Annealing Algorithm related parameters are ignored: `max_processing_time`, `tries_per_temperature`, `max_changes_per_temperature`, `max_consecutive_non_changes`, `initial_temperature`, `final_temperature`, `cooling_factor`, `randomize`
sv: Parametrar relaterade till Simulated Annealing Algorithm ignoreras: `max_processing_time`, `tries_per_temperature`, `max_changes_per_temperature`, `max_consecutive_non_changes`, `initial_temperature`, `final_temperature`, `cooling_factor`, `randomize`
zh_hans: Simulated Annealing 算法相关参数被忽略： `max_processing_time`, `tries_per_temperature`, `max_changes_per_temperature`, `max_consecutive_non_changes`, `initial_temperature`, `final_temperature`, `cooling_factor`, `randomize`

source: Results change depending on input order of the `Matrix SQL`_
sv: Resultaten ändras beroende på inmatningsordningen för `Matrix SQL`_

source: Negative costs are ignored.
sv: Negativa kostnader ignoreras.

source: Can be Used with :doc:`costMatrix-category` functions preferably with `directed => false`.
sv: Kan användas med :doc:`costMatrix-category` funktioner helst med `directed => false`.
zh_hans: 可以与:doc:`costMatrix-category` 函数一起使用，最好使用 `directed => false`。

source: With ``directed => false``
sv: Med ``riktad => falsk``
zh_hans: 使用``directed => false``

source: Will generate a graph that:
sv: Kommer att generera en graf som:
zh_hans: 将生成一个图：

source: is undirected
sv: är ostyrd
zh_hans: 是无向的

source: is fully connected (As long as the graph has one component)
sv: är helt sammanhängande (så länge grafen har en komponent)
zh_hans: 是完全连接的（只要图有一个分量）

source: all traveling costs on edges obey the triangle inequality.
sv: alla resekostnader på kanter följer triangelolikheten.
zh_hans: 所有边上的旅行成本都遵循三角不等式。

source: When ``start_vid = 0 OR end_vid = 0``
sv: När ``start_vid = 0 OR end_vid = 0``
zh_hans: 当``start_vid = 0 OR end_vid = 0``

source: The solutions generated are guaranteed to be *twice as long as the optimal tour in the worst case*
sv: De lösningar som genereras är garanterat * dubbelt så långa som den optimala turen i värsta fall*

source: When ``start_vid != 0 AND end_vid != 0 AND start_vid != end_vid``
sv: När ``start_vid != 0 AND end_vid != 0 AND start_vid != end_vid``
zh_hans: 当 ``start_vid != 0 AND end_vid != 0 AND start_vid != end_vid``

source: It is **not guaranteed** that the solution will be, in the worst case, twice as long as the optimal tour, due to the fact that `end_vid` is forced to be in a fixed position.
sv: Det är **inte garanterat** att lösningen i värsta fall kommer att vara dubbelt så lång som den optimala turen, eftersom `end_vid` tvingas vara i en fast position.

source: With ``directed => true``
sv: Med ``riktad => sann``
zh_hans: 当``directed => true``

source: It is **not guaranteed** that the solution will be, in the worst case, twice as long as the optimal tour
sv: Det är **inte garanterat** att lösningen i värsta fall kommer att vara dubbelt så lång som den optimala turen

source: is directed
sv: är riktad
zh_hans: 有向

source: some (or all) traveling costs on edges might not obey the triangle inequality.
sv: vissa (eller alla) resekostnader på kanter kanske inte följer triangelolikheten.
zh_hans: 某些（或全部）边上的旅行成本可能不满足三角不等式。

source: As an undirected graph is required, the directed graph is transformed as follows:
sv: Eftersom det krävs en oriktad graf, omvandlas den riktade grafen enligt följande:
zh_hans: 由于需要无向图，有向图变换如下：

source: edges `(u, v)` and `(v, u)` is considered to be the same edge (denoted `(u, v)`
sv: kanterna `(u, v)` och `(v, u)` anses vara samma kant (betecknas `(u, v)`)
zh_hans: 边 `(u, v)`和 `(v, u)`被认为是相同的边（表示为 `(u, v)`

source: if ``agg_cost`` differs between one or more instances of edge `(u, v)`
sv: om ``agg_cost`` skiljer sig mellan en eller flera instanser av kant `(u, v)``
zh_hans: 如果 ``agg_cost`` 在边`(u, v)` 的一个或多个实例之间不同

source: The minimum value of the ``agg_cost`` all instances of edge `(u, v)` is going to be considered as the ``agg_cost`` of edge `(u, v)`
sv: Det lägsta värdet av ``agg_cost`` för alla instanser av kanten `(u, v)`` kommer att betraktas som ``agg_cost`` för kanten `(u, v)``
zh_hans: 边 `(u, v)` 的所有实例的 ``agg_cost`` 最小值将被视为边 `(u, v)` 的 ``agg_cost``

source: Some (or all) traveling costs on edges will still might not obey the triangle inequality.
sv: Vissa (eller alla) resekostnader på kanter kommer kanske ändå inte att följa triangelolikheten.
zh_hans: 边上的一些（或全部）旅行成本仍然可能不遵守三角不等式。

source: When the data does not come from an undirected graph or its not fully connected:
sv: När data inte kommer från en odelad graf eller om den inte är helt sammanhängande:

source: Missing values will be calculated with dijkstra algorithm.
sv: Saknade värden kommer att beräknas med dijkstra-algoritmen.

source: When the graph has more than one component:
sv: När grafen har mer än en komponent:

source: ``start_vid`` or ``end_vid`` are defined and are on the same component: the TSP tour will happen on that component.
sv: ``start_vid`` eller ``slut_vid`` är definierade och finns på samma komponent: TSP-turen kommer att äga rum på den komponenten.

source: ``start_vid`` or ``end_vid`` are defined and are not on the same component: the TSP tour will propose a tour that has both components where connecting costs are estimated.
sv: ``start_vid`` eller ``slut_vid`` definieras och inte finns på samma komponent: TSP-turen kommer att föreslå en tur som har båda komponenterna där anslutningskostnaderna beräknas.

source: ``start_vid`` or ``end_vid`` are not defined: the starting point could be on any component and will include data only from that component.
sv: ``start_vid`` eller ``end_vid`` är inte definierade: startpunkten kan vara på vilken komponent som helst och kommer endast att innehålla data från den komponenten.

source: One cycle attempt to remove crossing edges is done to the TSP results.
sv: Ett cykelförsök för att ta bort korsande kanter görs på TSP-resultaten.

source: Returns set of |tsp-result|
sv: Returnerar uppsättning av |tsp-resultat|
zh_hans: 返回 |tsp-result| 的集合

source: Using :doc:`pgr_dijkstraCostMatrix` to generate the matrix information
sv: Använd :doc:`pgr_dijkstraCostMatrix` för att generera matrisinformationen
zh_hans: 使用:doc:`pgr_dijkstraCostMatrix` 生成矩阵信息

source: **Line 4** Vertices :math:`\{2, 4, 13, 14\}` are not included because they are not connected.
sv: **Linje 4** Punkterna :math:`{\{2, 4, 13, 14\\}` är inte inkluderade eftersom de inte är anslutna.
zh_hans: **Line 4** 顶点 :math:`\{2, 4, 13, 14\}` 不包括在内，因为它们未连接。

source: `Matrix SQL`_ as described below
sv: `Matrix SQL`_ enligt beskrivningen nedan
zh_hans: `Matrix SQL`_如下所述

source: ``ANY-INTEGER``
sv: ``ETT HELTAL``

source: ``ANY-NUMERICAL``
sv: ``ANY-NUMERISK``

source: Cost for going from start_vid to end_vid
sv: Kostnad för att gå från start_vid till slut_vid
zh_hans: 从 start_vid 到 end_vid 的成本

source: Returns SET OF ``(seq, node, cost, agg_cost)``
sv: Returnerar SET OF ``(seq, nod, kostnad, agg_cost)``
zh_hans: 返回集合``(seq, node, cost, agg_cost)``

source: Row sequence.
sv: Radsekvens.
zh_hans: 行顺序。

source: **node**
sv: **nod**

source: Identifier of the node/coordinate/point.
sv: Identifierare av nod/koordinat/punkt.
zh_hans: 节点/坐标/点的标识符。

source: Cost to traverse from the current ``node`` to the next ``node`` in the path sequence.
sv: Kostnad för att gå från aktuell ``nod`` till nästa ``nod`` i sökvägssekvensen.
zh_hans: 从路径序列中的当前 ``node``遍历到下一个``node`` 的成本。

source: ``0`` for the last row in the tour sequence.
sv: ``0`` för den sista raden i turordningssekvensen.
zh_hans: ``0`` 表示游览序列中的最后一行。

source: Aggregate cost from the ``node`` at ``seq = 1`` to the current node.
sv: Sammanlagd kostnad från ``noden`` vid ``seq = 1`` till den aktuella noden.
zh_hans: 从``seq = 1``的 ``node``到当前节点的总成本。

source: ``0`` for the first row in the tour sequence.
sv: ``0`` för den första raden i turordningen.
zh_hans: ``0``表示游览序列中的第一行。

source: Start from vertex :math:`1`
sv: Start från toppunkten :math:`1`
zh_hans: 从顶点 :math:`1`开始

source: **Line 6** ``start_vid => 1``
sv: **Linje 6** ``start_vid => 1``

source: Using points of interest to generate an asymmetric matrix.
sv: Använda intressepunkter för att generera en asymmetrisk matris.

source: To generate an asymmetric matrix:
sv: För att generera en asymmetrisk matris:
zh_hans: 生成非对称矩阵：

source: **Line 4** The ``side`` information of ``pointsOfInterset`` is ignored by not including it in the query
sv: **Linje 4** Informationen om ``sidan`` av ``pointsOfInterset`` ignoreras genom att inte inkludera den i frågan
zh_hans: **Line 4** 通过未在查询中包括 ``pointsOfInterset`` 中的``side`` 信息而被忽略

source: **Line 6** Generating an asymmetric matrix with ``directed => true``
sv: **Linje 6** Generering av en asymmetrisk matris med ``directed => true``

source: The solution that can be larger than *twice as long as the optimal tour* because:
sv: Lösningen som kan vara större än *dubbelt så lång som den optimala turen* eftersom:
zh_hans: 该解决方案的长度可能是*最佳行程的两倍以上*，因为：

source: Triangle inequality might not be satisfied.
sv: Triangelns ojämlikhet kanske inte uppfylls.
zh_hans: 三角不等式可能不满足。

source: Connected incomplete data
sv: Anslutna ofullständiga data
zh_hans: 连接不完整数据
