Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Using selected edges :math:`\{2, 4, 5, 8, 9, 15\}` the matrix is not complete.
sv: Med hjälp av valda kanter :math:`\{2, 4, 5, 8, 9, 15\}` är matrisen inte komplett.
zh_hans: 使用选定的边 :math:`\{2, 4, 5, 8, 9, 15\}`，矩阵不完整。

source: Cost value for :math:`17 \rightarrow 10` do not exist on the matrix, but the value used is taken from :math:`10 \rightarrow 17`.
sv: Kostnadsvärdet för :math:`17 \rightarrow 10` finns inte i matrisen, men det värde som används hämtas från :math:`10 \rightarrow 17`.
zh_hans: 对于 :math:`17 \rightarrow 10` 的成本值在矩阵中不存在，但使用的值是从 :math:`10 \rightarrow 17` 中获取的。

source: ``pgr_TSPeuclidean`` - Approximation using *metric* algorithm.
sv: ``pgr_TSPeuclidean`` - Approximation med hjälp av *metrisk* algoritm.

source: Using `Boost: metric TSP approx <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__
sv: Använda `Boost: metrisk TSP ca <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__

source: Name change from pgr_eucledianTSP
sv: Namnändring från pgr_eucledianTSP
zh_hans: pgr_eucledianTSP 的名称更改

source: New official function.
sv: Ny officiell funktion.

source: Results change depending on input order of the `Coordinates SQL`_
sv: Resultaten ändras beroende på inmatningsordningen för `Coordinates SQL`_

source: Any duplicated identifier will be ignored. The coordinates that will be kept is arbitrarily.
sv: Alla duplicerade identifierare kommer att ignoreras. De koordinater som kommer att behållas är godtyckliga.

source: The coordinates are quite similar for the same identifier, for example ::
sv: Koordinaterna är ganska lika för samma identifierare, till exempel ::
zh_hans: 对于相同的标识符，坐标非常相似，例如 ::

source: The coordinates are quite different for the same identifier, for example ::
sv: Koordinaterna är helt olika för samma identifierare, till exempel ::
zh_hans: 对于相同的标识符，坐标有很大不同，例如::

source: With default values
sv: Med standardvärden
zh_hans: 有默认值

source: `Coordinates SQL`_
sv: koordinater SQL

source: `Coordinates SQL`_ as described below
sv: `Coordinates SQL`_ enligt beskrivningen nedan
zh_hans: `Coordinates SQL`_ 如下所述

source: Coordinates SQL
sv: Koordinerar SQL
zh_hans: 坐标SQL

source: X value of the coordinate.
sv: X-värde för koordinaten.
zh_hans: 坐标的X值。

source: Y value of the coordinate.
sv: Y-värde för koordinaten.
zh_hans: 坐标的Y值。

source: Test 29 cities of Western Sahara
sv: Test 29 städer i Västsahara
zh_hans: 测试西撒哈拉29个城市

source: This example shows how to make performance tests using University of Waterloo's `example data <https://www.math.uwaterloo.ca/tsp/world/countries.html>`__ using the 29 cities of `Western Sahara dataset <https://www.math.uwaterloo.ca/tsp/world/wi29.tsp>`__
sv: I det här exemplet visas hur man gör prestandatester med hjälp av University of Waterloos "exempeldata" <https://www.math.uwaterloo.ca/tsp/world/countries.html>`__ med hjälp av de 29 städerna i "Västsaharas dataset" <https://www.math.uwaterloo.ca/tsp/world/wi29.tsp>`__
zh_hans: 此示例展示了如何使用Waterloo大学的 `示例数据 <https://www.math.uwaterloo.ca/tsp/world/countries.html>`__（使用西撒哈拉 29 个城市的数据集 <https://www.math.uwaterloo.ca/tsp/world/wi29.tsp>`__）进行性能测试

source: Creating a table for the data and storing the data
sv: Skapa en tabell för data och lagra data
zh_hans: 创建数据表并存储数据

source: Adding a geometry (for visual purposes)
sv: Lägga till en geometri (för visuella ändamål)
zh_hans: 添加几何图形（用于视觉目的）

source: Total tour cost
sv: Total kostnad för resan
zh_hans: 旅游总费用

source: Getting a total cost of the tour, compare the value with the length of an optimal tour is 27603, given on the dataset
sv: Få en total kostnad för turnén, jämför värdet med längden på en optimal turné är 27603, givet på datasetet
zh_hans: 获取旅行的总成本，将该值与数据集上给出的最佳旅行长度 27603 进行比较

source: Getting a geometry of the tour
sv: Att få en geometri av turen
zh_hans: 获取游览的几何形状

source: Visual results
sv: Visuella resultat
zh_hans: 视觉效果

source: Visually, The first image is the `optimal solution <https://www.math.uwaterloo.ca/tsp/world/witour.html>`__ and the second image is the solution obtained with ``pgr_TSPeuclidean``.
sv: Visuellt, Den första bilden är den `optimala lösningen <https://www.math.uwaterloo.ca/tsp/world/witour.html>`__ och den andra bilden är den lösning som erhållits med ``pgr_TSPeuclidean``.

source: ``pgr_aStar`` — Shortest path using the A* algorithm.
sv: ``pgr_aStar`` - Kortaste vägen med hjälp av A*-algoritmen.
zh_hans: ``pgr_aStar`` —使用 A* 算法的最短路径。

source: Standardizing output columns to |short-generic-result|
sv: Standardisering av utdatakolumner till |short-generic-result|

source: New proposed signature:
sv: Nytt förslag till signatur:

source: Signature change on pgr_aStar(One to One)
sv: Ändring av signatur på pgr_aStar(One to One)

source: The results are equivalent to the union of the results of the `pgr_aStar(` `One to One`_ `)` on the:
sv: Resultaten är likvärdiga med sammanslagningen av resultaten från `pgr_aStar(` `One to One`_ `)` på :
zh_hans: 结果相当于 `pgr_aStar(` `一对一`_ `)` 结果的并集：

source: Returns set of |short-generic-result|
sv: Returnerar uppsättning av |kort-generiska-resultat|

source: Optional parameters are `named parameters` and have a default value.
sv: Valfria parametrar är "namngivna parametrar" och har ett standardvärde.
zh_hans: 可选参数是`命名参数` 并具有默认值。

source: From vertex :math:`6` to vertex :math:`12` on a **directed** graph with heuristic :math:`2`
sv: Från toppunkt :math:`6` till toppunkt :math:`12` på en **riktad** graf med heuristik :math:`2`
zh_hans: 在具有heuristic :math:`2` 的**有向**图上，从顶点 :math:`6` 到顶点 :math:`12`

source: From vertex :math:`6` to vertices :math:`\{10, 12\}` on a **directed** graph with heuristic :math:`3` and factor :math:`3.5`
sv: Från toppunkten :math:`6` till toppunkterna :math:`\{10, 12\}` på en **riktad** graf med heuristiken :math:`3` och faktorn :math:`3.5`
zh_hans: 在具有heuristic :math:`3` 和factor :math:`3.5` 的**有向**图上，从顶点 :math:`6` 到顶点 :math:`\{10, 12\}`

source: From vertices :math:`\{6, 8\}` to vertex :math:`10` on an **undirected** graph with heuristic :math:`4`
sv: Från topparna :math:`\{6, 8\}` till topp :math:`10` på en **omdirigerad** graf med heuristiken :math:`4`
zh_hans: 在具有heuristic :math:`4` 的**无向**图上，从顶点 :math:`\{6, 8\}` 到顶点 :math:`10`

source: From vertices :math:`\{6, 8\}` to vertices :math:`\{10, 12\}` on a **directed** graph with factor :math:`0.5`
sv: Från topparna :math:`\{6, 8\}` till topparna :math:`\{10, 12\}` på en **riktad** graf med faktorn :math:`0.5`
zh_hans: 在具有factor :math:`0.5` 的**有向**图上，从顶点 :math:`\{6, 8\}` 到顶点 :math:`\{10, 12\}`

source: Using a combinations table on a **directed** graph with factor :math:`0.5`.
sv: Använda en kombinationstabell på en **riktad** graf med faktor :math:`0.5`.
zh_hans: 在**有向**图上使用组合表，且使用factor :math:`0.5`。

source: Example 1
sv: Exempel 1
zh_hans: 示例1

source: Demonstration of repeated values are ignored, and result is sorted.
sv: Demonstration av upprepade värden ignoreras och resultatet sorteras.
zh_hans: 演示中重复的值被忽略，且结果被排序。

source: Example 2
sv: Exempel 2
zh_hans: 示例2

source: Making **start vids** the same as **end vids**.
sv: Att göra **start vids** samma som **slut vids**.
zh_hans: 使 **start vids**与**end vids**相同。

source: Example 3
sv: Exempel 3
zh_hans: 示例3

source: Manually assigned vertex combinations.
sv: Manuellt tilldelade toppunktskombinationer.
zh_hans: 手动指定的顶点组合。

source: ``pgr_aStarCost`` - Total cost of the shortest path using the A* algorithm.
sv: ``pgr_aStarCost`` - Totalkostnad för den kortaste vägen med A*-algoritmen.

source: New proposed function.
sv: Ny föreslagen funktion.

source: The ``pgr_aStarCost`` function summarizes of the cost of the shortest path using the A* algorithm.
sv: Funktionen ``pgr_aStarCost`` sammanfattar kostnaden för den kortaste vägen med hjälp av A*-algoritmen.

source: Let be the case the values returned are stored in a table, so the unique index would be the pair: `(start_vid, end_vid)`
sv: Låt oss anta att de returnerade värdena lagras i en tabell, så det unika indexet skulle vara paret: `(start_vid, end_vid)`
zh_hans: 假设返回的值存储在表中，因此唯一索引将是一对：`(start_vid, end_vid)`

source: For undirected graphs, the results are symmetric.
sv: För oriktade grafer är resultaten symmetriska.
zh_hans: 对于无向图，结果是对称的。

source: The returned values are ordered in ascending order:
sv: De returnerade värdena sorteras i stigande ordning:
zh_hans: 返回值按升序排列：

source: `start_vid` ascending
sv: `start_vid` stigande
zh_hans: `start_vid`升序

source: `end_vid` ascending
sv: `end_vid` stigande
zh_hans: `end_vid`升序

source: Returns set of |matrix-result|
sv: Returnerar uppsättning av |matris-resultat|
zh_hans: 返回 |matrix-result| 的集合

source: ``pgr_aStarCostMatrix`` - Calculates the a cost matrix using :doc:`pgr_aStar`.
sv: ``pgr_aStarCostMatrix`` - Beräknar en kostnadsmatris med hjälp av :doc:`pgr_aStar`.
zh_hans: ``pgr_aStarCostMatrix`` -使用:doc:`pgr_aStar` 计算成本矩阵。

source: Using internally the :doc:`pgr_aStar` algorithm
sv: Intern användning av :doc:`pgr_aStar`-algoritmen

source: Returns a cost matrix.
sv: Returnerar en kostnadsmatris.
zh_hans: 返回成本矩阵。

source: No ordering is performed
sv: Ingen beställning utförs
zh_hans: 不进行排序

source: let `v` and `u` are nodes on the graph:
sv: låt `v` och `u` vara noder i grafen:
zh_hans: 设`v`和 `u` 是图上的节点：

source: when there is no path from `v` to `u`:
sv: när det inte finns någon väg från `v` till `u`:
zh_hans: 当没有从`v`到 `u` 的路径时：

source: cost from `v` to `u` is :math:`\inf`
sv: kostnaden från `v` till `u` är :math:`\inf`
zh_hans: 从`v`到 `u`的成本是 :math:`\inf`

source: when :math:`v = u` then
sv: när :math:`v = u` då
zh_hans: 当 :math:`v = u`时

source: cost from `v` to `u` is :math:`0`
sv: kostnaden från `v` till `u` är :math:`0`
zh_hans: 从`v`到`u`的成本是:math:`0`

source: When the graph is **undirected** the cost matrix is symmetric
sv: När grafen är **icke-riktad** är kostnadsmatrisen symmetrisk
zh_hans: 当图**无向**时，成本矩阵是对称的

source: Symmetric cost matrix for vertices :math:`\{5, 6, 10, 15\}` on an **undirected** graph using heuristic :math:`2`
sv: Symmetrisk kostnadsmatris för topparna :math:`\{5, 6, 10, 15\}` på en **omdirigerad** graf med heuristiken :math:`2`
zh_hans: 在**无向**图上，使用heuristic :math:`2`，对顶点 :math:`\{5, 6, 10, 15\}` 创建对称的成本矩阵

source: Use with :doc:`pgr_TSP`
sv: Använd med :doc:`pgr_TSP`
zh_hans: 使用 :doc:`pgr_TSP`

source: ``pgr_articulationPoints`` - Return the articulation points of an undirected graph.
sv: ``pgr_articulationPoints`` - Returnerar artikulationspunkterna i en odränerad graf.
zh_hans: ``pgr_articulationPoints`` - 返回无向图的连接点。

source: Result columns change: ``seq`` is removed
sv: Ändring av resultatkolumner: ``seq`` tas bort
zh_hans: 结果列更改：删除了 ``seq``

source: New experimental function.
sv: Ny experimentell funktion.

source: Those vertices that belong to more than one biconnected component are called articulation points or, equivalently, cut vertices. Articulation points are vertices whose removal would increase the number of connected components in the graph. This implementation can only be used with an undirected graph.
sv: De hörn som tillhör mer än en biconnected komponent kallas artikulationspunkter eller, på motsvarande sätt, cut vertices. Artikulationspunkter är hörn vars borttagning skulle öka antalet anslutna komponenter i grafen. Denna implementation kan endast användas med en odelad graf.
zh_hans: 那些属于多于一个双连通分量的顶点被称为关节点，或者等效地称为割点。关节点是指那些如果被移除，会增加图中连接分量数量的顶点。这个实现仅适用于无向图。

source: Works for **undirected** graphs.
sv: Fungerar för **undirected** grafer.
zh_hans: 适用于**无向**图。

source: ``node`` ascending
sv: ``nod`` stigande
zh_hans: ``node``升序

source: Running time: :math:`O(V + E)`
sv: Speltid: :math:`O(V + E)`
zh_hans: 运行时间：:math:`O(V + E)`

source: Returns set of |result-node|
sv: Returnerar uppsättning av |result-node|

source: The articulation points of the graph
sv: Diagrammets artikulationspunkter
zh_hans: 图表的连接点

source: Nodes in red are the articulation points.
sv: Rödmarkerade noder är artikulationspunkterna.
zh_hans: 红色节点是关节点。

source: Identifier of the vertex.
sv: Identifierare för toppunkten.
zh_hans: 顶点的标识符。

source: `Boost: Biconnected components & articulation points <https://www.boost.org/libs/graph/doc/biconnected_components.html>`__
sv: `Boost: Biconnected komponenter & ledpunkter <https://www.boost.org/libs/graph/doc/biconnected_components.html>`__

source: wikipedia: `Biconnected component <https://en.wikipedia.org/wiki/Biconnected_component>`__
sv: wikipedia: "Sammankopplad komponent <https://en.wikipedia.org/wiki/Biconnected_component>
zh_hans: 维基百科: `双连通分量 <https://en.wikipedia.org/wiki/Biconnected_component>`__

source: ``pgr_bdAstar`` — Shortest path using the bidirectional A* algorithm.
sv: ``pgr_bdAstar`` - Kortaste vägen med hjälp av den dubbelriktade A*-algoritmen.
zh_hans: ``pgr_bdAstar`` — 使用双向 A* 算法的最短路径。

source: Signature change on pgr_bdAstar(One to One)
sv: Ändring av signatur på pgr_bdAstar(One to One)

source: The results are equivalent to the union of the results of the pgr_bdAStar(One to One) on the:
sv: Resultaten motsvarar sammanslagningen av resultaten av pgr_bdAStar(One to One) på:

source: ``pgr_bdAstarCost`` - Total cost of the shortest path using the bidirectional A* algorithm.
sv: ``pgr_bdAstarCost`` - Totalkostnad för den kortaste vägen med hjälp av den dubbelriktade A*-algoritmen.

source: The ``pgr_bdAstarCost`` function summarizes of the cost of the shortest path using the bidirectional A* algorithm.
sv: Funktionen ``pgr_bdAstarCost`` sammanfattar kostnaden för den kortaste vägen med hjälp av den dubbelriktade A*-algoritmen.

source: ``pgr_bdAstarCostMatrix`` - Calculates the a cost matrix using :doc:`pgr_aStar`.
sv: ``pgr_bdAstarCostMatrix`` - Beräknar en kostnadsmatris med hjälp av :doc:`pgr_aStar`.
zh_hans: ``pgr_bdAstarCostMatrix`` - 使用:doc:`pgr_aStar` 计算成本矩阵。

source: Using internally the :doc:`pgr_bdAstar` algorithm
sv: Intern användning av :doc:`pgr_bdAstar`-algoritmen

source: ``pgr_bdDijkstra`` — Returns the shortest path using Bidirectional Dijkstra algorithm.
sv: ``pgr_bdDijkstra`` - Returnerar den kortaste vägen med hjälp av Bidirectional Dijkstra-algoritmen.

source: Signature change on pgr_bdDijsktra(One to One)
sv: Ändring av signatur på pgr_bdDijsktra(One to One)

source: From vertex :math:`6` to vertex :math:`10` on a **directed** graph
sv: Från toppunkten :math:`6` till toppunkten :math:`10` på en **riktad** graf
zh_hans: 在**有向**图上从顶点 :math:`6`到顶点 :math:`10`

source: From vertex :math:`6` to vertices :math:`\{10, 17\}` on a **directed** graph
sv: Från toppunkten :math:`6` till toppunkterna :math:`\{10, 17\}` i en **riktad** graf
zh_hans: 在**有向**图上从顶点:math:`6`到顶点:math:`\{10, 17\}`

source: From vertices :math:`\{6, 1\}` to vertex :math:`17` on a **directed** graph
sv: Från topparna :math:`\{6, 1\}` till topp :math:`17` på en **riktad** graf
zh_hans: 在**有向**图上从顶点 :math:`\{6, 1\}`到顶点:math:`17`

source: From vertices :math:`\{6, 1\}` to vertices :math:`\{10, 17\}` on an **undirected** graph
sv: Från topparna :math:`{6, 1\}` till topparna :math:`{10, 17\}` på en **omdirigerad** graf
zh_hans: 在**无向**图上从顶点 :math:`\{6, 1\}`到顶点 :math:`\{10, 17\}`

source: Using a combinations table on an **undirected** graph
sv: Använda en kombinationstabell i en **icke-riktad** graf
zh_hans: 在**无向**图上使用组合表

source: ``pgr_bdDijkstraCost`` — Returns the shortest path's cost using Bidirectional Dijkstra algorithm.
sv: ``pgr_bdDijkstraCost`` - Returnerar den kortaste vägens kostnad med hjälp av Bidirectional Dijkstra-algoritmen.

source: The ``pgr_bdDijkstraCost`` function summarizes of the cost of the shortest path using the bidirectional Dijkstra Algorithm.
sv: Funktionen ``pgr_bdDijkstraCost`` sammanfattar kostnaden för den kortaste vägen med hjälp av den dubbelriktade Dijkstra-algoritmen.

source: ``pgr_bdDijkstraCostMatrix`` - Calculates a cost matrix using :doc:`pgr_bdDijkstra`.
sv: ``pgr_bdDijkstraCostMatrix`` - Beräknar en kostnadsmatris med hjälp av :doc:`pgr_bdDijkstra`.
zh_hans: ``pgr_bdDijkstraCostMatrix`` - 使用 :doc:`pgr_bdDijkstra` 计算成本矩阵。

source: Using bidirectional Dijkstra algorithm, calculate and return a cost matrix.
sv: Beräkna och returnera en kostnadsmatris med hjälp av den dubbelriktade Dijkstra-algoritmen.
zh_hans: 使用双向Dijkstra算法，计算并返回成本矩阵。

source: Symmetric cost matrix for vertices :math:`\{5, 6, 10, 15\}` on an **undirected** graph
sv: Symmetrisk kostnadsmatris för toppar :math:`{\5, 6, 10, 15\}` på en **omdirigerad** graf
zh_hans: 在一个**无向**图上的顶点集合:math:`\{5, 6, 10, 15\}` 的对称成本矩阵

source: Use with :doc:`pgr_TSP`.
sv: Använd med :doc:`pgr_TSP`.
zh_hans: 与 :doc:`pgr_TSP` 一起使用。

source: ``pgr_bellmanFord - Experimental``
sv: ``pgr_bellmanFord - Experimentell``
zh_hans: ``pgr_bellmanFord - 实验``

source: ``pgr_bellmanFord`` — Shortest path using Bellman-Ford algorithm.
sv: ``pgr_bellmanFord`` - Kortaste vägen med Bellman-Ford algoritm.

source: New experimental signature:
sv: Ny experimentell signatur:

source: Bellman-Ford's algorithm, is named after Richard Bellman and Lester Ford, who first published it in 1958 and 1956, respectively.It is a graph search algorithm that computes shortest paths from a starting vertex (``start_vid``) to an ending vertex (``end_vid``) in a graph where some of the edge weights may be negative. Though it is more versatile, it is slower than Dijkstra's algorithm.This implementation can be used with a directed graph and an undirected graph.
sv: Bellman-Fords algoritm är uppkallad efter Richard Bellman och Lester Ford, som först publicerade den 1958 respektive 1956. Det är en algoritm för grafsökning som beräknar kortaste vägar från en startpunkt (``start_vid``) till en slutpunkt (``end_vid``) i en graf där vissa av kantvikterna kan vara negativa. Även om den är mer mångsidig är den långsammare än Dijkstras algoritm. Den här implementeringen kan användas med en riktad graf och en oriktad graf.
zh_hans: Bellman-Ford算法以Richard Bellman和Lester Ford的名字命名，他们分别于1958年和1956年首次发表了这个算法。它是一种图搜索算法，用于计算从起始顶点（``start_vid``）到终点顶点（``end_vid``）的最短路径，其中一些边的权重可以为负数。尽管它更加通用，但比Dijkstra算法更慢。这个实现可以用于有向图和无向图。

source: Process is valid for edges with both positive and negative edge weights.
sv: Processen är giltig för kanter med både positiva och negativa kantvikter.
zh_hans: 该过程对于具有正边权重和负边权重的边都有效。

source: When the start vertex and the end vertex are the same, there is no path. The agg_cost would be :math:`0`.
sv: När startvertex och slutvertex är desamma finns det ingen väg. Agg_cost skulle vara :math:`0`.
zh_hans: 当起始顶点和结束顶点相同时，不存在路径。聚合成本（agg_cost）将为 :math:`0`。

source: When the start vertex and the end vertex are different, and there exists a path between them without having a *negative cycle*. The agg_cost would be some finite value denoting the shortest distance between them.
sv: När startvertex och slutvertex är olika, och det finns en väg mellan dem utan att ha en *negativ cykel*. Agg_cost skulle vara ett ändligt värde som anger det kortaste avståndet mellan dem.
zh_hans: 当起始顶点和结束顶点不同，并且它们之间存在路径且不存在*负循环*时。 agg_cost 将是某个有限值，表示它们之间的最短距离。

source: When the start vertex and the end vertex are different, and there exists a path between them, but it contains a *negative cycle*. In such case, agg_cost for those vertices keep on decreasing furthermore, Hence agg_cost can’t be defined for them.
sv: När startpunkten och slutpunkten är olika, och det finns en väg mellan dem, men den innehåller en *negativ cykel*. I sådana fall fortsätter agg_cost för dessa toppar att minska och därför kan agg_cost inte definieras för dem.
zh_hans: 当起始顶点和结束顶点不同，并且它们之间存在路径，但包含*负循环*时。 在这种情况下，这些顶点的 agg_cost 继续减少，因此无法为它们定义 agg_cost 。

source: When the start vertex and the end vertex are different, and there is no path. The agg_cost is :math:`\infty`.
sv: När startvertex och slutvertex är olika och det inte finns någon väg. Agg_cost är :math:`\infty`.
zh_hans: 当起始顶点和结束顶点不同且不存在路径时，聚合成本（agg_cost）为:math:`\infty`。

source: For optimization purposes, any duplicated value in the `start_vids` or `end_vids` are ignored.
sv: För optimeringsändamål ignoreras alla duplicerade värden i `start_vids` eller `end_vids`.
zh_hans: 出于优化目的，`start_vids`或 `end_vids` 中的任何重复值都将被忽略。

source: Running time: :math:`O(| start\_vids | * ( V * E))`
sv: Speltid: :math:`O(| start\_vids | * ( V * E))`
zh_hans: 运行时间：:math:`O(| start\_vids | * ( V * E))`

source: https://en.wikipedia.org/wiki/Bellman%E2%80%93Ford_algorithm
sv: https://en.wikipedia.org/wiki/Bellman%E2%80%93Ford_algoritm

source: ``pgr_betweennessCentrality`` - Experimental
sv: ``pgr_betweennessCentrality`` - Experimentell

source: ``pgr_betweennessCentrality`` - Calculates the relative betweenness centrality using Brandes Algorithm
sv: ``pgr_betweennessCentrality`` - Beräknar den relativa betweenness-centraliteten med hjälp av Brandes-algoritmen

source: The Brandes Algorithm takes advantage of the sparse graphs for evaluating the betweenness centrality score of all vertices.
sv: Brandes-algoritmen utnyttjar de glesa graferna för att utvärdera betweenness centrality-punkten för alla hörn.

source: Betweenness centrality measures the extent to which a vertex lies on the shortest paths between all other pairs of vertices. Vertices with a high betweenness centrality score may have considerable influence in a network by the virtue of their control over the shortest paths passing between them.
sv: Betweenness centrality mäter i vilken utsträckning en toppunkt ligger på de kortaste vägarna mellan alla andra par av toppunkter. Toppar med en hög betweenness centrality-punkt kan ha ett betydande inflytande i ett nätverk genom att de kontrollerar de kortaste vägarna mellan dem.

source: The removal of these vertices will affect the network by disrupting the it, as most of the shortest paths between vertices pass through them.
sv: Om dessa toppar tas bort påverkas nätverket genom att det störs, eftersom de flesta av de kortaste vägarna mellan topparna passerar genom dem.

source: This implementation work for both directed and undirected graphs.
sv: Denna implementering fungerar för både riktade och oriktade grafer.

source: Running time: :math:`\Theta(VE)`
sv: Speltid: :math:`\Theta(VE)`

source: Running space: :math:`\Theta(VE)`
sv: Driftutrymme: :math:`\Theta(VE)``

source: Throws when there are no edges in the graph
sv: Kastar när det inte finns några kanter i grafen

source: Returns set of ``(vid, centrality)``
sv: Returnerar uppsättning av ``(vid, centralitet)``

source: For a directed graph with edges :math:`\{1, 2, 3, 4\}`.
sv: För en riktad graf med kanter :math:`\{1, 2, 3, 4\}`.

source: Explanation
sv: Förklaring

source: The betweenness centrality are between parenthesis.
sv: Betweenness Centrality anges inom parentes.

source: The leaf vertices have betweenness centrality :math:`0`.
sv: Bladkärnorna har betweenness centrality :math:`0`.

source: Betweenness centrality of vertex :math:`6` is higher than of vertex :math:`10`.
sv: Betweenness centrality för toppunkten :math:`6` är högre än för toppunkten :math:`10`.

source: Removing vertex :math:`6` will create three graph components.
sv: Om du tar bort toppunkten :math:`6` skapas tre grafkomponenter.

source: Removing vertex :math:`10` will create two graph components.
sv: Om du tar bort toppunkten :math:`10` skapas två grafkomponenter.

source: ``centrality``
sv: ``centralitet``

source: Relative betweenness centrality score of the vertex (will be in range [0,1])
sv: Relativ betweenness centrality-punkt för vertexet (kommer att ligga inom intervallet [0,1])

source: ``pgr_biconnectedComponents`` — Biconnected components of an undirected graph.
sv: ``pgr_biconnectedComponents`` - Biconnected-komponenter i en odränerad graf.
zh_hans: ``pgr_biconnectedComponents`` — 无向图的双连通分量。

source: Result columns change:
sv: Resultatkolumnerna ändras:
zh_hans: 结果列发生变化：

source: ``n_seq`` is removed
sv: ``n_seq`` tas bort
zh_hans: ``n_seq``被删除
