Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Standardized to |result-node-order|
sv: Standardisera till |result-node-order|

source: Standardized to |result-closure|
sv: Standardisera till |result-closure|

source: Removal of SQL deprecated signatures
sv: Borttagning av SQL-signaturer som inte längre är aktuella

source: `#2798 <https://github.com/pgRouting/pgrouting/issues/2798>`__: pgr_contraction
sv: `#2798 <https://github.com/pgRouting/pgrouting/issues/2798>`__: pgr_kontraktion

source: Removal of SQL deprecated functions
sv: Borttagning av föråldrade SQL-funktioner

source: Removal of SQL deprecated internal functions
sv: Borttagning av interna funktioner i SQL som inte längre är aktuella

source: #2748 _pgr_alphashape(text,double precision)
sv: #2748 _pgr_alphashape(text,dubbel precision)

source: #2861 _pgr_checkverttab(text,text[],integer,text)
sv: #2861 _pgr_checkverttab(text,text[],heltal,text)

source: #2861 _pgr_createindex(text,text,text,integer,text)
sv: #2861 _pgr_createindex(text,text,text,heltal,text)

source: #2861 _pgr_createindex(text,text,text,text,integer,text)
sv: #2861 _pgr_createindex(text,text,text,text,text,heltal,text)

source: #2735 _pgr_drivingdistance(text,anyarray,double precision,boolean,boolean)
sv: #2735 _pgr_drivingdistance(text,valfri matris,dubbel precision,boolean,boolean)

source: #2861 _pgr_endpoint(geometry)
sv: #2861 _pgr_slutpunkt(geometri)

source: #2861 _pgr_getcolumnname(text,text,integer,text)
sv: #2861 _pgr_getcolumnname(text,text,heltal,text)

source: #2861 _pgr_getcolumnname(text,text,text,integer,text)
sv: #2861 _pgr_getcolumnname(text,text,text,heltal,text)

source: #2861 _pgr_getcolumntype(text,text,integer,text)
sv: #2861 _pgr_getcolumntype(text,text,heltal,text)

source: #2861 _pgr_getcolumntype(text,text,text,integer,text)
sv: #2861 _pgr_getcolumntype(text,text,text,heltal,text)

source: #2861 _pgr_gettablename(text,integer,text)
sv: #2861 _pgr_gettablename(text,heltal,text)

source: #2861 _pgr_iscolumnindexed(text,text,integer,text)
sv: #2861 _pgr_iscolumnindexed(text,text,heltal,text)

source: #2861 _pgr_iscolumnindexed(text,text,text,integer,text)
sv: #2861 _pgr_iscolumnindexed(text,text,text,heltal,text)

source: #2745 _pgr_kruskal(text,anyarray,text,bigint,double precision)
sv: #2745 _pgr_kruskal(text,valfri matris,text,bigint,dubbel precision)

source: #2897 _pgr_ksp(text,anyarray,anyarray,integer,boolean,boolean,boolean)
sv: #2897 _pgr_ksp(text,anyarray,anyarray,integer,boolean,boolean,boolean,boolean)

source: #2897 _pgr_ksp(text,text,integer,boolean,boolean)
sv: #2897 _pgr_ksp(text,text,heltal,boolean,boolean)

source: #2861 _pgr_msg(integer,text,text)
sv: #2861 _pgr_msg(heltal,text,text)

source: #2861 _pgr_onerror(boolean,integer,text,text,text,text)
sv: #2861 _pgr_onerror(boolean,heltal,text,text,text,text,text)

source: #2861 _pgr_pointtoid(geometry,double precision,text,integer)
sv: #2861 _pgr_pointtoid(geometri,dubbel precision,text,heltal)

source: #2743 _pgr_prim(text,anyarray,text,bigint,double precision)
sv: #2743 _pgr_prim(text,valfri matris,text,bigint,dubbel precision)

source: #2861 _pgr_startpoint(geometry)
sv: #2861 _pgr_startpunkt(geometri)

source: #2683 _pgr_trsp(text,integer,double precision,integer,double precision,boolean,boolean,text)
sv: #2683 _pgr_trsp(text,heltal,dubbel precision,heltal,dubbel precision,boolean,boolean,text)

source: #2683 _pgr_trsp(text,text,anyarray,anyarray,boolean)
sv: #2683 _pgr_trsp(text,text,valfri matris,valfri matris,boolean)

source: #2683 _pgr_trsp(text,text,anyarray,bigint,boolean)
sv: #2683 _pgr_trsp(text,text,valfri matris,bigint,boolean)

source: #2682 _pgr_trspviavertices(text,integer[],boolean,boolean,text)
sv: #2682 _pgr_trspviavertices(text,heltal[],boolean,boolean,text)

source: #2919 _pgr_trsp_withpoints(text,text,text,anyarray,anyarray,boolean,character,boolean)
sv: #2919 _pgr_trsp_withpoints(text,text,text,anyarray,anyarray,boolean,tecken,boolean)

source: #2919 _pgr_trsp_withpoints(text,text,text,text,boolean,character,boolean)
sv: #2919 _pgr_trsp_withpoints(text,text,text,text,boolean,tecken,boolean)

source: #2901 _pgr_tspeuclidean(text,bigint,bigint,double precision,integer,integer,integer,double precision,double precision,double precision,boolean)
sv: #2901 _pgr_tspeuclidean(text,bigint,bigint,dubbel precision,heltal,heltal,heltal,dubbel precision,dubbel precision,dubbel precision,boolean)

source: #2901 _pgr_tsp(text,bigint,bigint,double precision,integer,integer,integer,double precision,double precision,double precision,boolean)
sv: #2901 _pgr_tsp(text,bigint,bigint,dubbel precision,heltal,heltal,heltal,dubbel precision,dubbel precision,dubbel precision,boolean)

source: #2890 _pgr_withpointsdd(text,text,anyarray,double precision,boolean,character,boolean,boolean)
sv: #2890 _pgr_withpointsdd(text,text,valfri matris,dubbel precision,boolean,tecken,boolean,boolean)

source: #2895 _pgr_withpointsksp(text,text,anyarray,anyarray,integer,character,boolean,boolean,boolean,boolean)
sv: #2895 _pgr_withpointsksp(text,text,anyarray,anyarray,integer,character,boolean,boolean,boolean,boolean,boolean)

source: #2895 _pgr_withpointsksp(text,text,text,integer,character,boolean,boolean,boolean)
sv: #2895 _pgr_withpointsksp(text,text,text,heltal,tecken,boolean,boolean,boolean)

source: #2741 _pgr_withpointsvia(text,bigint[],double precision[],boolean)
sv: #2741 _pgr_withpointsvia(text,bigint[],dubbel precision[],boolean)

source: #2741 _pgr_withpointsvia(text,text,anyarray,boolean,boolean,boolean,character,boolean)
sv: #2741 _pgr_withpointsvia(text,text,anyarray,boolean,boolean,boolean,boolean,character,boolean)

source: #2683 _trsp(text,text,anyarray,anyarray,boolean)
sv: #2683 _trsp(text,text,valfri matris,valfri matris,boolean)

source: #2683 _v4trsp(text,text,anyarray,anyarray,boolean)
sv: #2683 _v4trsp(text,text,valfri matris,valfri matris,boolean)

source: Summary of functions and signatures no longer on pgrouting
sv: Sammanfattning av funktioner och signaturer som inte längre finns på pgrouting

source: #2748 pgr_alphashape(geometry,double precision)
sv: #2748 pgr_alphashape(geometri,dubbel precision)

source: #2752 pgr_analyzegraph(text,double precision,text,text,text,text,text)
sv: #2752 pgr_analyzegraph(text,dubbel precision,text,text,text,text,text,text)

source: #2755 pgr_analyzeoneway(text,text[],text[],text[],text[],boolean,text,text,text)
sv: #2755 pgr_analyzeoneway(text,text[],text[],text[],text[],text[],boolean,text,text,text)

source: #2751 pgr_createtopology(text,double precision,text,text,text,text,text,boolean)
sv: #2751 pgr_createtopology(text,dubbel precision,text,text,text,text,text,text,boolean)

source: #2827 pgr_createverticestable(text,text,text,text,text)
sv: #2827 pgr_createverticestable(text,text,text,text,text,text)

source: #2888 pgr_findcloseedges(text,geometry,double precision,integer,boolean,boolean)
sv: #2888 pgr_findcloseedges(text,geometry,dubbel precision,heltal,boolean,boolean)

source: #2888 pgr_findcloseedges(text,geometry[],double precision,integer,boolean,boolean)
sv: #2888 pgr_findcloseedges(text,geometry[],dubbel precision,heltal,boolean,boolean)

source: #2886 pgr_nodenetwork(text,double precision,text,text,text,text,boolean)
sv: #2886 pgr_nodenetwork(text,dubbel precision,text,text,text,text,text,boolean)

source: #2683 pgr_trsp(text,integer,double precision,integer,double precision,boolean,boolean,text)
sv: #2683 pgr_trsp(text,heltal,dubbel precision,heltal,dubbel precision,boolean,boolean,text)

source: #2683 pgr_trsp(text,integer,integer,boolean,boolean,text)
sv: #2683 pgr_trsp(text,heltal,heltal,boolean,boolean,text)

source: #2681 pgr_trspviaedges(text,integer[],double precision[],boolean,boolean,text)
sv: #2681 pgr_trspviaedges(text,heltal[],dubbel precision[],boolean,boolean,text)

source: #2682 pgr_trspviavertices(text,anyarray,boolean,boolean,text)
sv: #2682 pgr_trspviavertices(text,valfri matris,boolean,boolean,text)

source: #2919 pgr_trspvia_withpoints(text,text,text,anyarray,boolean,boolean,boolean,character,boolean)
sv: #2919 pgr_trspvia_withpoints(text,text,text,anyarray,boolean,boolean,boolean,boolean,character,boolean)

source: #2919 pgr_trsp_withpoints(text,text,text,bigint,bigint,boolean,character,boolean)
sv: #2919 pgr_trsp_withpoints(text,text,text,bigint,bigint,boolean,tecken,boolean)

source: #2919 pgr_trsp_withpoints(text,text,text,text,boolean,character,boolean)
sv: #2919 pgr_trsp_withpoints(text,text,text,text,boolean,tecken,boolean)

source: #2901 pgr_tspeuclidean(text,bigint,bigint,double precision,integer,integer,integer,double precision,double precision,double precision,boolean)
sv: #2901 pgr_tspeuclidean(text,bigint,bigint,dubbel precision,heltal,heltal,heltal,dubbel precision,dubbel precision,dubbel precision,boolean)

source: #2901 pgr_tsp(text,bigint,bigint,double precision,integer,integer,integer,double precision,double precision,double precision,boolean)
sv: #2901 pgr_tsp(text,bigint,bigint,dubbel precision,heltal,heltal,heltal,dubbel precision,dubbel precision,dubbel precision,boolean)

source: #2919 pgr_withpointscost(text,text,anyarray,anyarray,boolean,character)
sv: #2919 pgr_withpointscost(text,text,valfri matris,valfri matris,boolean,tecken)

source: #2919 pgr_withpointscost(text,text,text,boolean,character)
sv: #2919 pgr_withpointscost(text,text,text,boolean,tecken)

source: #2890 pgr_withpointsdd(text,text,anyarray,double precision,boolean,character,boolean,boolean)
sv: #2890 pgr_withpointsdd(text,text,valfri matris,dubbel precision,boolean,tecken,boolean,boolean)

source: #2890 pgr_withpointsdd(text,text,bigint,double precision,boolean,character,boolean)
sv: #2890 pgr_withpointsdd(text,text,bigint,dubbel precision,boolean,tecken,boolean)

source: #2919 pgr_withpoints(text,text,anyarray,anyarray,boolean,character,boolean)
sv: #2919 pgr_withpoints(text,text,valfri matris,valfri matris,boolean,tecken,boolean)

source: #2919 pgr_withpoints(text,text,bigint,anyarray,boolean,character,boolean)
sv: #2919 pgr_withpoints(text,text,bigint,anyarray,boolean,tecken,boolean)

source: #2919 pgr_withpoints(text,text,bigint,bigint,boolean,character,boolean)
sv: #2919 pgr_withpoints(text,text,bigint,bigint,boolean,tecken,boolean)

source: #2919 pgr_withpoints(text,text,text,boolean,character,boolean)
sv: #2919 pgr_withpoints(text,text,text,boolean,tecken,boolean)

source: #2919 pgr_withpointsvia(text,text,anyarray,boolean,boolean,boolean,character,boolean)
sv: #2919 pgr_withpointsvia(text,text,anyarray,boolean,boolean,boolean,boolean,character,boolean)

source: Code enhancements
sv: Förbättringar av koden

source: Removal of unused C/C++ code
sv: Borttagning av oanvänd C/C++-kod

source: Refactor the Script to build the update PostgreSQL file.
sv: Refaktorera skriptet för att bygga uppdateringsfilen PostgreSQL.

source: One process & driver for:
sv: En process & drivrutin för:

source: allpairs: johnson and Floyd-Warshall
sv: alla par: johnson och Floyd-Warshall

source: Shortest path: Dijkstra and withPoints using Dijkstra
sv: Kortaste vägen: Dijkstra och withPoints med hjälp av Dijkstra

source: Deprecation of internal C/C++ functions
sv: Avveckling av interna C/C++-funktioner

source: Deprecated functions are substituted by new function.
sv: Föråldrade funktioner ersätts av nya funktioner.

source: Internal C/C++ functions in legacy
sv: Interna C/C++-funktioner i äldre

source: All releases
sv: Alla utgåvor

source: Kruskal - Family of functions
sv: Kruskal - Familj av funktioner
zh_hans: Kruskal - 函数族

source: Kruskal's algorithm is a greedy minimum spanning tree algorithm that in each cycle finds and adds the edge of the least possible weight that connects any two trees in the forest.
sv: Kruskals algoritm är en "greedy minimum spanning tree"-algoritm som i varje cykel hittar och lägger till den kant med minsta möjliga vikt som förbinder två träd i skogen.
zh_hans: 克鲁斯卡尔算法是一种贪婪的最小生成树算法，它在每个循环中查找并添加连接森林中任意两棵树的最小可能权重的边。

source: **The main Characteristics are:**
sv: **De viktigaste egenskaperna är:**
zh_hans: **主要特点是：**

source: The total weight of all the edges in the tree or forest is minimized.
sv: Den totala vikten för alla kanter i trädet eller skogen minimeras.
zh_hans: 树或森林中所有边的总权重最小化。

source: Kruskal's running time: :math:`O(E * log E)`
sv: Kruskals körtid: :math:`O(E * log E)`
zh_hans: 克鲁斯卡尔的运行时间： :math:`O(E * log E)`

source: Metrics - Family of functions
sv: Metrics - Familj av funktioner

source: Migration guide
sv: Migrationsguide
zh_hans: 迁移指南

source: Several functions are having changes on the signatures, and/or have been replaced by new functions.
sv: Flera funktioner har förändringar på signaturerna och/eller har ersatts av nya funktioner.
zh_hans: 多个函数的签名发生了变化，和/或已被新函数取代。

source: Results can be different because of the changes.
sv: Resultaten kan bli annorlunda på grund av förändringarna.
zh_hans: 结果可能会因变化而不同。

source: All deprecated functions will be removed on next major version 4.0.0
sv: Alla föråldrade funktioner kommer att tas bort i nästa större version 4.0.0

source: Migration to standardized columns
sv: Migrering till standardiserade kolumner

source: There has been an effort to standardize function output columns names and types.
sv: Det har gjorts försök att standardisera namn och typer på kolumner för funktionsutdata.

source: |matrix-result|
sv: |matris-resultat

source: |short-generic-result|
sv: |kort-generiskt-resultat|

source: |result-spantree|
sv: |resultat-spantree|

source: Function
sv: Funktion

source: `Migration of single path functions`_
sv: `Migrering av funktioner med en enda sökväg`_

source: `Migration of spanning tree functions`_
sv: `Migration av funktioner för spänningsträd

source: `Migration of output column name change`_
sv: `Migrering av namnändring för utdatakolumn`

source: `Migration of multiple paths functions`_
sv: `Migrering av funktioner för flera sökvägar`

source: `Migration of cost functions`_
sv: `Migrering av kostnadsfunktioner`_

source: Migration of cost functions
sv: Migrering av kostnadsfunktioner

source: The standardized :ref:`pgRouting-concepts:Result columns for cost functions` are |matrix-result|
sv: De standardiserade :ref:`pgRouting-concepts:Result-kolumnerna för kostnadsfunktioner` är |matrix-result|

source: The following functions need to be migrated when they are being used in an application.
sv: Följande funktioner måste migreras när de används i en applikation.

source: From
sv: Från

source: ``pgr_withPointsCost``
sv: ``pgr_medPointsCost``

source: |matrix-pid|
sv: |matris-pid|

source: ``pgr_withPointsCostMatrix``
sv: ``pgr_medPunkterKostnadsmatris``

source: **to** |matrix-result|
sv: **till** |matris-resultat|

source: Migration of |matrix-pid|
sv: Migrering av |matrix-pid|

source: Signatures to be migrated:
sv: Signaturer som ska migreras:
zh_hans: 要迁移的签名：

source: One to One
sv: En till en
zh_hans: 一对一

source: One to Many
sv: En till många
zh_hans: 一对多

source: Many to One
sv: Många till en
zh_hans: 多对一

source: Many to Many
sv: Många till många
zh_hans: 多对多

source: Combinations
sv: Kombinationer
zh_hans: 组合

source: Breaking change
sv: Brytande förändring

source: If using ``pgr_withPointsCost``: column names must be changed after updating pgRouting
sv: Om du använder ``pgr_withPointsCost``: kolumnnamn måste ändras efter uppdatering av pgRouting

source: New output columns are |matrix-result|
sv: Nya utdatakolumner är |matris-resultat|

source: To get the old version column names: rename ``start_vid`` to ``start_pid`` and ``end_vid`` to ``end_pid``.
sv: För att få kolumnnamnen i den gamla versionen: byt namn på ``start_vid`` till ``start_pid`` och ``end_vid`` till ``end_pid``.

source: Examples
sv: Exempel
zh_hans: 示例

source: Examples for One to One for cost functions
sv: Exempel på One to One för kostnadsfunktioner

source: Using ``pgr_withPointsCost``
sv: Använda ``pgr_withPointsCost``

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#one-to-one>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#one-to-one>`__ exempel.

source: from
sv: från
zh_hans: 从

source: to
sv: till
zh_hans: 到

source: Examples for One to Many for cost functions
sv: Exempel på One to Many för kostnadsfunktioner

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#one-to-many>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#one-to-many>`__ exempel.

source: Examples for Many to One for cost functions
sv: Exempel på Many to One för kostnadsfunktioner

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#many-to-one>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#many-to-one>`__ exempel.

source: Examples for Many to Many for cost functions
sv: Exempel på Many to Many för kostnadsfunktioner

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#many-to-many>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#many-to-many>`__ exempel.

source: Examples for Combinations for cost functions
sv: Exempel på Kombinationer för kostnadsfunktioner

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#combinations>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPointsCost.html#combinations>`__ exempel.

source: Migration of multiple paths functions
sv: Migrering av funktioner för flera banor

source: The standardized :ref:`pgRouting-concepts:Result columns for single path functions` are |nksp-result|
sv: De standardiserade :ref:`pgRouting-concepts:Result-kolumnerna för funktioner med en enda sökväg` är |nksp-result|

source: ``pgr_edgeDisjointPaths``
sv: ``pgr_kantDisjunktaStigar``

source: Migration of |ksp-result|
sv: Migrering av |ksp-resultat|

source: |nksp-result|
sv: |nksp-resultat|

source: Before updating pgRouting, enumerate the |ksp-result|
sv: Innan du uppdaterar pgRouting, räkna upp |ksp-resultatet

source: One to One example using ``pgr_KSP``
sv: Ett till ett exempel med hjälp av ``pgr_KSP``

source: Using `this <https://docs.pgrouting.org/3.5/en/pgr_KSP.html#signatures>`__ example.
sv: Använda `det här <https://docs.pgrouting.org/3.5/en/pgr_KSP.html#signatures>`__ exemplet.
zh_hans: 使用`这个<https://docs.pgrouting.org/3.5/en/pgr_KSP.html#signatures>`__示例。

source: Migration of |result-disjoint|
sv: Migrering av |resultat-disjoint|

source: Before updating pgRouting, enumerate the |result-disjoint|
sv: Innan du uppdaterar pgRouting, räkna upp |resultat-disjunkta|

source: Skip when applicable, ``start_vid``
sv: Hoppa över när det är tillämpligt, ``start_vid``

source: Skip when applicable, ``end_vid``
sv: Hoppa över när det är tillämpligt, ``end_vid``

source: One to One example using ``pgr_edgeDisjointPaths``
sv: Ett till ett exempel med hjälp av ``pgr_edgeDisjointPaths``

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.6/en/pgr_edgeDisjointPaths.html#one-to-one>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.6/en/pgr_edgeDisjointPaths.html#one-to-one>`__ exempel.

source: Before updating pgRouting enumerate the columns: |ksp-result|
sv: Innan du uppdaterar pgRouting räkna upp kolumnerna: |ksp-resultat|

source: Migration of single path functions
sv: Migrering av funktioner med en enda sökväg

source: The standardized :ref:`pgRouting-concepts:Result columns for single path functions` are |short-generic-result|
sv: De standardiserade :ref:`pgRouting-concepts:Result-kolumnerna för funktioner med en enda sökväg` är |short-generic-result|

source: |old-generic-result|
sv: |old-generiskt-resultat|

source: |result-1-1|
sv: |resultat-1-1|

source: ``pgr_withPoints``
sv: ``pgr_medPunkter``

source: |old-pid-result|
sv: |old-pid-resultat|

source: Migration of |old-generic-result|
sv: Migrering av |old-generic-result|

source: Before updating pgRouting, enumerate the corresponding columns of the signature
sv: Innan du uppdaterar pgRouting, räkna upp motsvarande kolumner i signaturen

source: Migration of |old-pid-result|
sv: Migrering av |old-pid-resultat|

source: To get the old version column names, depending on the signature:
sv: För att få den gamla versionen kolumnnamn, beroende på signaturen:

source: Filter out the columns: ``start_vid`` and/or ``end_vid``
sv: Filtrera bort kolumnerna: ``start_vid`` och/eller ``slut_vid``

source: Rename the columns:
sv: Byt namn på kolumnerna:

source: ``start_vid`` to ``start_pid``
sv: ``start_vid`` till ``start_pid``

source: ``end_vid`` to ``end_pid``
sv: ``slut_vid`` till ``slut_pid``

source: If using ``pgr_withPoints``: column names must be changed after updating pgRouting
sv: Om du använder ``pgr_withPoints``: kolumnnamn måste ändras efter uppdatering av pgRouting

source: Migration of |result-1-1|
sv: Migrering av |resultat-1-1|

source: To get the old version column names:
sv: För att få kolumnnamnen i den gamla versionen:

source: Filter out the columns: ``start_vid`` and ``end_vid``
sv: Filtrera bort kolumnerna: ``start_vid`` och ``slut_vid``

source: Examples with One to One with one route result
sv: Exempel med en till en med en rutt resultat

source: Using ``pgr_aStar``
sv: Använda ``pgr_aStar``

source: Migrating `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_aStar.html#one-to-one>`__ example.
sv: Migrering av `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_aStar.html#one-to-one>`__ exempel.

source: Before updating pgRouting enumerate the columns: |result-1-1|
sv: Innan du uppdaterar pgRouting räkna upp kolumnerna: |resultat-1-1|

source: Using ``pgr_bdDijkstra``
sv: Använda ``pgr_bdDijkstra``

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_bdDijkstra.html#one-to-one>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_bdDijkstra.html#one-to-one>`__ exempel.

source: Using ``pgr_DAGshortestPath``
sv: Använda ``pgr_DAGshortestPath``

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_dagShortestPath.html#one-to-one>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_dagShortestPath.html#one-to-one>`__ exempel.

source: This applies to all signatures of ``pgr_DAGshortestPath``
sv: Detta gäller för alla signaturer av ``pgr_DAGshortestPath``

source: Examples for One to Many with one route result
sv: Exempel för One to Many med ett ruttresultat

source: Using ``pgr_bdAstar``
sv: Använda ``pgr_bdAstar``

source: Migrating `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_bdAstar.html#one-to-many>`__ example.
sv: Migrering av `this v3.5 <https://docs.pgrouting.org/3.5/en/pgr_bdAstar.html#one-to-many>`__ exempel.

source: Before updating pgRouting enumerate the columns: |result-1-m|
sv: Innan uppdatering av pgRouting räknas kolumnerna upp: |resultat-1-m|

source: Using ``pgr_withPoints``
sv: Använda ``pgr_withPoints``

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPoints.html#one-to-many>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_withPoints.html#one-to-many>`__ exempel.

source: To get the old signature column names: filter out the column ``start_vid`` and rename ``end_vid`` to ``end_pid``.
sv: För att få de gamla signaturkolumnnamnen: filtrera bort kolumnen ``start_vid`` och byt namn på ``end_vid`` till ``end_pid``.

source: Examples for Many to One with one route result
sv: Exempel för Many to One med ett ruttresultat

source: Migrating `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_bdDijkstra.html#many-to-one>`__ example.
sv: Migrering av `this v3.8 <https://docs.pgrouting.org/3.8/en/pgr_bdDijkstra.html#many-to-one>`__ exempel.
