Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: `#2427 <https://github.com/pgRouting/pgrouting/issues/2427>`__: pgr_createVerticesTable & pgr_createTopology, variable should be of type Record.
sv: `#2427 <https://github.com/pgRouting/pgrouting/issues/2427>`__: pgr_createVerticesTable & pgr_createTopology, variabeln ska vara av typen Record.

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.4.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.4.1%22>`_
sv: För att se alla problem och pull requests som stängts av denna release, se `Git stängd milstolpe för 3.4.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.4.1%22>`_

source: `#2401 <https://github.com/pgRouting/pgrouting/issues/2401>`__: pgRouting 3.4.0 do not build docs when sphinx is too low or missing
sv: `#2401 <https://github.com/pgRouting/pgrouting/issues/2401>`__: pgRouting 3.4.0 bygger inte dokument när sphinx är för låg eller saknas

source: `#2398 <https://github.com/pgRouting/pgrouting/issues/2398>`__: v3.4.0 does not upgrade from 3.3.3
sv: `#2398 <https://github.com/pgRouting/pgrouting/issues/2398>`__: v3.4.0 uppgraderar inte från 3.3.3

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.4.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.4.0%22>`_
sv: För att se alla problem och pull requests som stängts av denna release, se `Git stängd milstolpe för 3.4.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.4.0%22>`_

source: `#1891 <https://github.com/pgRouting/pgrouting/issues/1891>`__: pgr_ksp doesn't give all correct shortest path
sv: `#1891 <https://github.com/pgRouting/pgrouting/issues/1891>`__: pgr_ksp ger inte alla korrekta kortaste vägar

source: New proposed functions.
sv: Nya föreslagna funktioner.

source: With points
sv: Med punkt

source: Turn Restrictions
sv: Begränsningar för sväng

source: Via with turn restrictions
sv: Via med svängrestriktioner

source: Topology
sv: Topologi

source: Ordering
sv: Ordning

source: Unclassified
sv: Oklassificerade

source: Flow functions
sv: Flödesfunktioner

source: Deprecating: pgr_maxCardinalityMatch(text,boolean)
sv: Föråldrad: pgr_maxCardinalityMatch(text,boolean)

source: Deprecated Functions
sv: Föråldrade funktioner

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.3.4 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.4%22>`_
sv: För att se alla problem och pull requests som stängts av denna release, se `Git stängd milstolpe för 3.3.4 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.4%22>`_

source: `#2400 <https://github.com/pgRouting/pgrouting/issues/2400>`__: pgRouting 3.3.3 does not build in focal
sv: `#2400 <https://github.com/pgRouting/pgrouting/issues/2400>`__: pgRouting 3.3.3 kan inte byggas i fokal

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.3.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.3%22>`_
sv: För att se alla problem och pull requests som stängts av denna release, se `Git stängd milstolpe för 3.3.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.3%22>`_

source: Ignoring optional boolean parameter, as the algorithm works only for undirected graphs.
sv: Ignorerar den valfria booleska parametern, eftersom algoritmen endast fungerar för oriktade grafer.

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.3.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.2%22>`_
sv: För att se alla problem och pull requests som stängts av denna release, se `Git stängd milstolpe för 3.3.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.2%22>`_

source: Revised documentation
sv: Reviderad dokumentation

source: Simplifying table names and table columns, for example:
sv: Förenkling av t.ex. tabellnamn och tabellkolumner:

source: ``edges`` instead of ``edge_table``
sv: ``edges`` i stället för ``edge_table``

source: Removing unused columns ``category_id`` and ``reverse_category_id``.
sv: Ta bort oanvända kolumner ``category_id`` och ``reverse_category_id``.

source: ``combinations`` instead of ``combinations_table``
sv: ``combinations`` i stället för ``combinations_table``

source: Using PostGIS standard for geometry column.
sv: Använda PostGIS-standard för geometrikolumn.

source: ``geom`` instead of ``the_geom``
sv: ``geom`` i stället för ``the_geom``

source: Avoiding usage of functions that modify indexes, columns etc on tables.
sv: Undvika användning av funktioner som modifierar index, kolumner etc. i tabeller.

source: Using ``pgr_extractVertices`` to create a routing topology
sv: Använda ``pgr_extractVertices`` för att skapa en routningstopologi

source: Restructure of the pgRouting concepts page.
sv: Omstrukturering av sidan med pgRouting-koncept.

source: `#2276 <https://github.com/pgRouting/pgrouting/issues/2276>`__: edgeDisjointPaths issues with start_vid and combinations
sv: `#2276 <https://github.com/pgRouting/pgrouting/issues/2276>`__: edgeDisjointPaths-problem med start_vid och kombinationer

source: `#2312 <https://github.com/pgRouting/pgrouting/issues/2312>`__: pgr_extractVertices error when target is not BIGINT
sv: `#2312 <https://github.com/pgRouting/pgrouting/issues/2312>`__: pgr_extractVertices fel när målet inte är BIGINT

source: `#2357 <https://github.com/pgRouting/pgrouting/issues/2357>`__: Apply clang-tidy performance-*
sv: `#2357 <https://github.com/pgRouting/pgrouting/issues/2357>`__: Tillämpa clang-tidy prestanda-*

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.3.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.1%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.3.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.1%22>`_ på Github.

source: `#2216 <https://github.com/pgRouting/pgrouting/issues/2216>`__: Warnings when using clang
sv: `#2216 <https://github.com/pgRouting/pgrouting/issues/2216>`__: Varningar vid användning av clang

source: `#2266 <https://github.com/pgRouting/pgrouting/issues/2266>`__: Error processing restrictions
sv: `#2266 <https://github.com/pgRouting/pgrouting/issues/2266>`__: Fel vid bearbetning av restriktioner

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.3.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.0%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.3.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.3.0%22>`_ på Github.

source: `#2057 <https://github.com/pgRouting/pgrouting/issues/2057>`__: trspViaEdges columns in different order
sv: `#2057 <https://github.com/pgRouting/pgrouting/issues/2057>`__: trspViaEdges-kolumner i olika ordning

source: `#2087 <https://github.com/pgRouting/pgrouting/issues/2087>`__: pgr_extractVertices to proposed
sv: `#2087 <https://github.com/pgRouting/pgrouting/issues/2087>`__: pgr_extractVertices till förslag

source: `#2201 <https://github.com/pgRouting/pgrouting/issues/2201>`__: pgr_depthFirstSearch to proposed
sv: `#2201 <https://github.com/pgRouting/pgrouting/issues/2201>`__: pgr_depthFirstSearch till proposed

source: `#2202 <https://github.com/pgRouting/pgrouting/issues/2202>`__: pgr_sequentialVertexColoring to proposed
sv: `#2202 <https://github.com/pgRouting/pgrouting/issues/2202>`__: pgr_sequentialVertexColoring till föreslagen

source: `#2203 <https://github.com/pgRouting/pgrouting/issues/2203>`__: pgr_dijkstraNear and pgr_dijkstraNearCost to proposed
sv: `#2203 <https://github.com/pgRouting/pgrouting/issues/2203>`__: pgr_dijkstraNear och pgr_dijkstraNearCost till föreslagna

source: Coloring
sv: Färgläggning

source: Experimental promoted to Proposed
sv: Experimentell befordrad till Föreslagen

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.2.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.2.2%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.2.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.2.2%22>`_ på Github.

source: `#2093 <https://github.com/pgRouting/pgrouting/issues/2093>`__: Compilation on Visual Studio
sv: `#2093 <https://github.com/pgRouting/pgrouting/issues/2093>`__: Kompilering i Visual Studio

source: `#2189 <https://github.com/pgRouting/pgrouting/issues/2189>`__: Build error on RHEL 7
sv: `#2189 <https://github.com/pgRouting/pgrouting/issues/2189>`__: Byggfel på RHEL 7

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.2.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.2.1%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.2.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.2.1%22>`_ på Github.

source: `#1883 <https://github.com/pgRouting/pgrouting/issues/1883>`__: pgr_TSPEuclidean crashes connection on Windows
sv: `#1883 <https://github.com/pgRouting/pgrouting/issues/1883>`__: pgr_TSPEuclidean kraschar anslutningen i Windows

source: The solution is to use Boost::graph::metric_tsp_approx
sv: Lösningen är att använda Boost::graph::metric_tsp_approx

source: To not break user's code the optional parameters related to the TSP Annaeling are ignored
sv: För att inte bryta användarens kod ignoreras de valfria parametrarna som är relaterade till TSP Annaeling

source: The function with the annaeling optional parameters is deprecated
sv: Funktionen med de valfria parametrarna annaeling är föråldrad

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.2.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.2.0%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.2.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.2.0%22>`_ på Github.

source: `#1850 <https://github.com/pgRouting/pgrouting/issues/1850>`__: Change Boost min version to 1.56
sv: `#1850 <https://github.com/pgRouting/pgrouting/issues/1850>`__: Ändra Boost min-version till 1.56

source: Removing support for Boost v1.53, v1.54 & v1.55
sv: Borttagande av stöd för Boost v1.53, v1.54 & v1.55

source: Dijkstra Near
sv: Dijkstra Nära

source: Bidirectional Astar
sv: Dubbelriktad Astar

source: Bidirectional Dijkstra
sv: Dubbelriktad Dijkstra

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.1.4 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.4%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.1.4 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.4%22>`_ på Github.

source: Issues fixes
sv: Problemlösningar

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.1.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.3%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.1.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.3%22>`_ på Github.

source: `#1825 <https://github.com/pgRouting/pgrouting/issues/1825>`__: Boost versions are not honored
sv: `#1825 <https://github.com/pgRouting/pgrouting/issues/1825>`__: Boost-versioner respekteras inte

source: `#1849 <https://github.com/pgRouting/pgrouting/issues/1849>`__: Boost 1.75.0 geometry "point_xy.hpp" build error on macOS environment
sv: `#1849 <https://github.com/pgRouting/pgrouting/issues/1849>`__: Boost 1.75.0 geometri "point_xy.hpp" byggfel i macOS-miljö

source: `#1861 <https://github.com/pgRouting/pgrouting/issues/1861>`__: vrp functions crash server
sv: `#1861 <https://github.com/pgRouting/pgrouting/issues/1861>`__: vrp-funktioner kraschar server

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.1.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.2%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.1.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.2%22>`_ på Github.

source: `#1304 <https://github.com/pgRouting/pgrouting/issues/1304>`__: FreeBSD 12 64-bit crashes on pgr_vrOneDepot tests Experimental Function
sv: `#1304 <https://github.com/pgRouting/pgrouting/issues/1304>`__: FreeBSD 12 64-bit kraschar på pgr_vrOneDepot-tester Experimentell funktion

source: `#1356 <https://github.com/pgRouting/pgrouting/issues/1356>`__: tools/testers/pg_prove_tests.sh fails when PostgreSQL port is not passed
sv: `#1356 <https://github.com/pgRouting/pgrouting/issues/1356>`__: tools/testers/pg_prove_tests.sh misslyckas när PostgreSQL-porten inte är godkänd

source: `#1725 <https://github.com/pgRouting/pgrouting/issues/1725>`__: Server crash on pgr_pickDeliver and pgr_vrpOneDepot on openbsd
sv: `#1725 <https://github.com/pgRouting/pgrouting/issues/1725>`__: Serverkrasch på pgr_pickDeliver och pgr_vrpOneDepot på openbsd

source: `#1760 <https://github.com/pgRouting/pgrouting/issues/1760>`__: TSP server crash on ubuntu 20.04 #1760
sv: `#1760 <https://github.com/pgRouting/pgrouting/issues/1760>`__: TSP-serverkrasch på ubuntu 20.04 #1760

source: `#1770 <https://github.com/pgRouting/pgrouting/issues/1770>`__: Remove warnings when using clang compiler
sv: `#1770 <https://github.com/pgRouting/pgrouting/issues/1770>`__: Ta bort varningar vid användning av clang-kompilatorn

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.1.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.1%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.1.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.1%22>`_ på Github.

source: `#1733 <https://github.com/pgRouting/pgrouting/issues/1733>`__: pgr_bdAstar fails when source or target vertex does not exist in the graph
sv: `#1733 <https://github.com/pgRouting/pgrouting/issues/1733>`__: pgr_bdAstar misslyckas när käll- eller målvertexen inte finns i grafen

source: `#1647 <https://github.com/pgRouting/pgrouting/issues/1647>`__: Linear Contraction contracts self loops
sv: `#1647 <https://github.com/pgRouting/pgrouting/issues/1647>`__: Linjär sammandragning kontrakterar självloopar

source: `#1640 <https://github.com/pgRouting/pgrouting/issues/1640>`__: pgr_withPoints fails when points_sql is empty
sv: `#1640 <https://github.com/pgRouting/pgrouting/issues/1640>`__: pgr_withPoints misslyckas när points_sql är tom

source: `#1616 <https://github.com/pgRouting/pgrouting/issues/1616>`__: Path evaluation on C++ not updated before the results go back to C
sv: `#1616 <https://github.com/pgRouting/pgrouting/issues/1616>`__: Banutvärdering på C++ uppdateras inte innan resultaten går tillbaka till C

source: `#1300 <https://github.com/pgRouting/pgrouting/issues/1300>`__: pgr_chinesePostman crash on test data
sv: `#1300 <https://github.com/pgRouting/pgrouting/issues/1300>`__: pgr_chinesePostman kraschar på testdata

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.1.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.0%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.1.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.1.0%22>`_ på Github.

source: Build changes
sv: Förändringar i byggnaden

source: Minimal requirement for Sphinx: version 1.8
sv: Minimikrav för Sphinx: version 1.8

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.0.6 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.6%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.0.6 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.6%22>`_ på Github.

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.0.5 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.5%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.0.5 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.5%22>`_ på Github.

source: Backport issue fixes
sv: Fixar problem med backport

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.0.4 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.4%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.0.4 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.4%22>`_ på Github.

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.0.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.2%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.0.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.2%22>`_ på Github.

source: `#1378 <https://github.com/pgRouting/pgrouting/issues/1378>`__: Visual Studio build failing
sv: `#1378 <https://github.com/pgRouting/pgrouting/issues/1378>`__: Visual Studio-byggnad misslyckas

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.0.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.1%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.0.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.1%22>`_ på Github.

source: `#232 <https://github.com/pgRouting/pgrouting/issues/232>`__: Honor client cancel requests in C /C++ code
sv: `#232 <https://github.com/pgRouting/pgrouting/issues/232>`__: Uppfylla begäran om avbrytande av klient i C/C++-kod
zh_hans: `#232 <https://github.com/pgRouting/pgrouting/issues/232>`__：在 C /C++ 代码中尊重客户端取消请求

source: To see all issues & pull requests closed by this release see the `Git closed milestone for 3.0.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.0%22>`_ on Github.
sv: För att se alla problem och pull requests som stängts av den här utgåvan, se `Git stängd milstolpe för 3.0.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%203.0.0%22>`_ på Github.

source: Fixed Issues
sv: Korrigerade problem

source: `#1153 <https://github.com/pgRouting/pgrouting/issues/1153>`__: Renamed pgr_eucledianTSP to pgr_TSPeuclidean
sv: `#1153 <https://github.com/pgRouting/pgrouting/issues/1153>`__: Bytte namn på pgr_eucledianTSP till pgr_TSPeuclidean

source: `#1188 <https://github.com/pgRouting/pgrouting/issues/1188>`__: Removed CGAL dependency
sv: `#1188 <https://github.com/pgRouting/pgrouting/issues/1188>`__: Borttaget CGAL-beroende

source: `#1002 <https://github.com/pgRouting/pgrouting/issues/1002>`__: Fixed contraction issues:
sv: `#1002 <https://github.com/pgRouting/pgrouting/issues/1002>`__: Fixade problem med sammandragning:

source: `#1004 <https://github.com/pgRouting/pgrouting/issues/1004>`__: Contracts when forbidden vertices do not belong to graph
sv: `#1004 <https://github.com/pgRouting/pgrouting/issues/1004>`__: Kontrakt när förbjudna toppar inte tillhör grafen

source: `#1005 <https://github.com/pgRouting/pgrouting/issues/1005>`__: Intermideate results eliminated
sv: `#1005 <https://github.com/pgRouting/pgrouting/issues/1005>`__: Medelmåttiga resultat eliminerade

source: `#1006 <https://github.com/pgRouting/pgrouting/issues/1006>`__: No loss of information
sv: `#1006 <https://github.com/pgRouting/pgrouting/issues/1006>`__: Ingen förlust av information

source: New Functions
sv: Nya funktioner

source: Kruskal family
sv: Familjen Kruskal

source: Prim family
sv: Familjen Prim

source: Proposed moved to official on pgRouting
sv: Föreslagen flyttad till officiell på pgRouting

source: aStar Family
sv: aStar-familjen

source: bdAstar Family
sv: bdAstar Familj

source: bdDijkstra Family
sv: familjen bdDijkstra

source: Flow Family
sv: Flödesfamilj

source: Components family
sv: Komponenter familj

source: Contraction:
sv: Sammandragning:

source: Removed unnecessary column seq
sv: Tog bort onödig kolumn seq

source: Bug Fixes
sv: Buggfixar

source: VRP category
sv: VRP-kategori

source: Moved to legacy
sv: Flyttat till legacy

source: Max flow - functions were renamed on v2.5.0
sv: Maxflöde - funktioner döptes om i v2.5.0

source: TSP old signatures
sv: TSP gamla signaturer

source: To see the issues closed by this release see the `Git closed milestone for 2.6.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.6.3%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.6.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.6.3%22%20>`_ på Github.

source: `#1219 <https://github.com/pgRouting/pgrouting/pull/1219>`__ Implicit cast for via_path integer to text
sv: `#1219 <https://github.com/pgRouting/pgrouting/pull/1219>`__ Implicit kast för via_path integer till text

source: `#1193 <https://github.com/pgRouting/pgrouting/pull/1193>`__ Fixed pgr_pointsAsPolygon breaking when comparing strings in WHERE clause
sv: `#1193 <https://github.com/pgRouting/pgrouting/pull/1193>`__ Fixat att pgr_pointsAsPolygon gick sönder när strängar jämfördes i WHERE-satsen

source: `#1185 <https://github.com/pgRouting/pgrouting/pull/1185>`__ Improve FindPostgreSQL.cmake
sv: `#1185 <https://github.com/pgRouting/pgrouting/pull/1185>`__ Förbättra FindPostgreSQL.cmake
