Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: BFS - Category
sv: BFS - Kategori
zh_hans: BFS-类别

source: Traversal using breadth first search.
sv: Traversering med hjälp av första breda sökning.
zh_hans: 使用广度优先搜索进行遍历。

source: It's implementation is only on **undirected** graph.
sv: Den är endast implementerad på en **ej riktad** graf.
zh_hans: 它的实现仅在**无向**图上。

source: Process is done only on edges with positive costs.
sv: Processen utförs endast på kanter med positiva kostnader.
zh_hans: 仅在具有正成本的边进行处理。

source: When the graph is connected
sv: När grafen är ansluten
zh_hans: 当图连通时

source: The resulting edges make up a tree
sv: De resulterande kanterna bildar ett träd
zh_hans: 由此产生的边组成一棵树

source: When the graph is not connected,
sv: När grafen inte är ansluten,
zh_hans: 当图不连通时

source: Finds a minimum spanning tree for each connected component.
sv: Hittar ett minsta spännträd för varje ansluten komponent.
zh_hans: 为每个连通分量找到最小生成树。

source: The resulting edges make up a forest.
sv: De kanter som bildas utgör en skog.
zh_hans: 由此产生的边构成了一片森林。

source: Parameters
sv: Parametrar
zh_hans: 参数

source: Type
sv: Typ
zh_hans: 类型

source: Description
sv: Beskrivning
zh_hans: 描述

source: `Edges SQL`_ as described below.
sv: `Edges SQL`_ enligt beskrivningen nedan.
zh_hans: `Edges SQL`_如下所述。

source: Identifier of the root vertex of the tree.
sv: Identifierare för trädets rotvertex.
zh_hans: 树的根顶点的标识符。

source: When value is :math:`0` then gets the spanning forest starting in aleatory nodes for each tree in the forest.
sv: När värdet är :math:`0` får du den spännvidd som börjar i aleatoriska noder för varje träd i skogen.
zh_hans: 当值为 :math:`0` 时，则获取从森林中每棵树的随机节点开始的生成森林。

source: ``ARRAY`` [ **ANY-INTEGER** ]
sv: ``ARRAY`` [ **ANY-TAL** ]

source: Array of identifiers of the root vertices.
sv: Array med identifierare för rotpunkterna.
zh_hans: 根顶点的标识符数组。

source: :math:`0` values are ignored
sv: :math:`0` värden ignoreras
zh_hans: :math:`0` 值被忽略

source: For optimization purposes, any duplicated value is ignored.
sv: För optimeringsändamål ignoreras alla duplicerade värden.
zh_hans: 出于优化目的，任何重复的值都将被忽略。

source: Where:
sv: Var:
zh_hans: 其中：

source: SMALLINT, INTEGER, BIGINT
sv: SMALLINT, HELTAL, BIGINT

source: ANY-NUMERIC
sv: VALFRI NUMERISK

source: SMALLINT, INTEGER, BIGINT, REAL, FLOAT, NUMERIC
sv: SMALLINT, HELTAL, BIGINT, REAL, FLOAT, NUMERISK

source: BFS optional parameters
sv: Valfria parametrar för BFS
zh_hans: BFS可选参数

source: Default
sv: Standard
zh_hans: 默认

source: ``max_depth``
sv: ``max_djup``

source: Upper limit of the depth of the tree.
sv: Övre gräns för trädets djup.
zh_hans: 树深度的上限。

source: When negative throws an error.
sv: När negativ kastar ett fel.
zh_hans: 为负数时抛出错误。

source: Inner Queries
sv: Inre frågor
zh_hans: 内部查询

source: Edges SQL
sv: Kanter SQL

source: Column
sv: Kolumn
zh_hans: 列

source: Identifier of the edge.
sv: Identifierare av kanten.
zh_hans: 边的标识符

source: ``source``
sv: ``Källa``

source: Identifier of the first end point vertex of the edge.
sv: Identifierare för den första slutpunktsvertexen på kanten.
zh_hans: 边的第一个端点顶点的标识符。

source: ``target``
sv: ``mål``

source: Identifier of the second end point vertex of the edge.
sv: Identifierare för den andra slutpunktsvertexen på kanten.
zh_hans: 边的第二个端点顶点的标识符。

source: **ANY-NUMERICAL**
sv: **ANY-NUMERISK**

source: Weight of the edge (``source``, ``target``)
sv: Kantvikt (``källa``, ``mål``)
zh_hans: 边(``source``, ``target``)的权重

source: ``reverse_cost``
sv: ``omvända_kostnader``

source: Weight of the edge (``target``, ``source``)
sv: Kantvikt (``mål``, ``källa``)
zh_hans: 边(``target``, ``source``)的权重

source: When negative: edge (``target``, ``source``) does not exist, therefore it's not part of the graph.
sv: När negativ: kanten (``mål``, ``källa``) existerar inte, därför är den inte en del av grafen.
zh_hans: 当为负时：边（``target``, ``source``）不存在，因此它不是图的一部分。

source: Result columns
sv: Resultat kolumner
zh_hans: 结果列

source: Returns set of ``(seq, depth, start_vid, node, edge, cost, agg_cost)``
sv: Returnerar uppsättning av ``(seq, depth, start_vid, node, edge, cost, agg_cost)``
zh_hans: 返回一组``(seq, depth, start_vid, node, edge, cost, agg_cost)``

source: Sequential value starting from :math:`1`.
sv: Sekventiellt värde med början från :math:`1`.
zh_hans: 从:math:`1`开始的顺序值。

source: ``depth``
sv: ``djup``

source: Depth of the ``node``.
sv: Djupet på ``noden``.
zh_hans: ``node``的深度

source: :math:`0` when ``node`` = ``start_vid``.
sv: :math:`0` när``node`` = ``start_vid``.
zh_hans: :math:`0` 当``node`` = ``start_vid``。

source: Identifier of the root vertex.
sv: Identifierare för rotvertexen.
zh_hans: 根顶点的标识符。

source: ``node``
sv: ``nod``

source: Identifier of ``node`` reached using ``edge``.
sv: Identifierare av ``nod`` som nås med hjälp av ``kant``.
zh_hans: 使用``edge``到达的``node``的标识符。

source: ``edge``
sv: ``kant``

source: Identifier of the ``edge`` used to arrive to ``node``.
sv: Identifierare av den ``kant`` som används för att komma till ``nod``.
zh_hans: 用于到达``node``的``edge``的标识符。

source: :math:`-1` when ``node`` = ``start_vid``.
sv: :math:`-1` när ``node`` = ``start_vid``.
zh_hans: :math:`-1` 当``node`` = ``start_vid``。

source: Cost to traverse ``edge``.
sv: Kostnad för att korsa ``kant``.
zh_hans: 遍历``edge``的成本。

source: Aggregate cost from ``start_vid`` to ``node``.
sv: Sammanlagd kostnad från ``start_vid`` till ``node``.
zh_hans: 从``start_vid``到``node``的总成本。

source: See Also
sv: Se även
zh_hans: 另请参阅

source: `Boost: Prim's algorithm <https://www.boost.org/libs/graph/doc/prim_minimum_spanning_tree.html>`__
sv: `Boost: Prims algoritm <https://www.boost.org/libs/graph/doc/prim_minimum_spanning_tree.html>`__

source: `Boost: Kruskal's algorithm <https://www.boost.org/libs/graph/doc/kruskal_min_spanning_tree.html>`__
sv: `Boost: Kruskals algoritm <https://www.boost.org/libs/graph/doc/kruskal_min_spanning_tree.html>`__

source: `Wikipedia: Prim's algorithm <https://en.wikipedia.org/wiki/Prim%27s_algorithm>`__
sv: `Wikipedia: Prims algoritm <https://en.wikipedia.org/wiki/Prim%27s_algoritm>`__

source: `Wikipedia: Kruskal's algorithm <https://en.wikipedia.org/wiki/Kruskal's_algorithm>`__
sv: `Wikipedia: Kruskals algoritm <https://en.wikipedia.org/wiki/Kruskal:s_algoritm>`__

source: Indices and tables
sv: Index och tabeller
zh_hans: 索引和表格

source: DFS - Category
sv: DFS - Kategori
zh_hans: DFS - 类别

source: Traversal using Depth First Search.
sv: Traversering med hjälp av första sökning på djupet.
zh_hans: 使用深度优先搜索进行遍历。

source: Proposed functions for next mayor release.
sv: Föreslagna funktioner för nästa version av Mayor.
zh_hans: 下一版本的拟议功能。

source: They are not officially in the current release.
sv: De finns inte officiellt med i den aktuella versionen.
zh_hans: 它们并未正式出现在当前版本中。

source: They will likely officially be part of the next mayor release:
sv: De kommer sannolikt officiellt att vara en del av nästa borgmästarutgåva:
zh_hans: 它们可能会正式成为下一个版本的一部分：

source: The functions make use of ANY-INTEGER and ANY-NUMERICAL
sv: Funktionerna använder sig av ANY-INTEGER och ANY-NUMERICAL
zh_hans: 这些函数使用 ANY-INTEGER 和 ANY-NUMERICAL

source: Name might not change. (But still can)
sv: Namnet kanske inte ändras. (Men kan fortfarande göra det)
zh_hans: 名字可能不会改变。（但仍然有可能改变）

source: Signature might not change. (But still can)
sv: Signaturen kanske inte ändras. (Men kan fortfarande göra det)
zh_hans: 签名可能不会改变。（但仍然有可能改变）

source: Functionality might not change. (But still can)
sv: Funktionaliteten kanske inte ändras. (Men kan fortfarande göra det)
zh_hans: 功能可能不会改变。（但仍然有可能改变）

source: pgTap tests have being done. But might need more.
sv: pgTap-tester har gjorts. Men det kan behövas fler.
zh_hans: pgTap 测试已经完成。 但可能需要更多。

source: Documentation might need refinement.
sv: Dokumentationen kan behöva förbättras.
zh_hans: 文档可能需要完善。

source: In general:
sv: I allmänhet:
zh_hans: 一般来说：

source: K shortest paths - Category
sv: K kortaste vägarna - Kategori
zh_hans: K最短路径 - 类别

source: TRSP - Family of functions
sv: TRSP - Familj av funktioner
zh_hans: TRSP - 函数族

source: When points are also given as input:
sv: När punkt också ges som input:
zh_hans: 当点也作为输入给出时：

source: Possible server crash
sv: Möjlig serverkrasch
zh_hans: 可能服务器崩溃

source: These functions might create a server crash
sv: Dessa funktioner kan orsaka en serverkrasch
zh_hans: 这些功能可能会导致服务器崩溃

source: Experimental functions
sv: Experimentella funktioner
zh_hans: 实验功能

source: They are not officially of the current release.
sv: De är inte officiellt i den aktuella versionen.
zh_hans: 它们不是当前版本的正式版本。

source: They likely will not be officially be part of the next release:
sv: De kommer troligen inte att officiellt vara en del av nästa utgåva:
zh_hans: 它们可能不会正式成为下一个版本的一部分：

source: The functions might not make use of ANY-INTEGER and ANY-NUMERICAL
sv: Funktionerna får inte använda sig av ANY-INTEGER och ANY-NUMERICAL
zh_hans: 这些函数可能不使用 ANY-INTEGER 和 ANY-NUMERICAL

source: Name might change.
sv: Namnet kan komma att ändras.
zh_hans: 名称可能会改变。

source: Signature might change.
sv: Signaturen kan komma att ändras.
zh_hans: 签名可能会改变。

source: Functionality might change.
sv: Funktionaliteten kan komma att ändras.
zh_hans: 功能可能会改变。

source: pgTap tests might be missing.
sv: pgTap-tester kan saknas.
zh_hans: pgTap 测试可能丢失。

source: Might need c/c++ coding.
sv: Kan behöva c/c++-kodning.
zh_hans: 可能需要 c/c++编码。

source: May lack documentation.
sv: Kan sakna dokumentation.
zh_hans: 可能缺乏文档。

source: Documentation if any might need to be rewritten.
sv: Eventuell dokumentation kan behöva skrivas om.
zh_hans: 文档（如果有）可能需要重写。

source: Documentation examples might need to be automatically generated.
sv: Dokumentationsexempel kan behöva genereras automatiskt.
zh_hans: 可能需要自动生成文档示例。

source: Might need a lot of feedback from the community.
sv: Det kan behövas mycket feedback från samhället.

source: Might depend on a proposed function of pgRouting
sv: Kan bero på en föreslagen funktion för pgRouting
zh_hans: 可能取决于 pgRouting 的拟议功能

source: Might depend on a deprecated function of pgRouting
sv: Kan vara beroende av en föråldrad funktion i pgRouting
zh_hans: 可能依赖于 pgRouting 的已弃用函数

source: Introduction
sv: Introduktion
zh_hans: 介绍

source: Road restrictions are a sequence of road segments that can not be taken in a sequential manner. Some restrictions are implicit on a directed graph, for example, one way roads where the wrong way edge is not even inserted on the graph. But normally on turns like no left turn or no right turn, hence the name turn restrictions, there are sometimes restrictions.
sv: Vägrestriktioner är en sekvens av vägsegment som inte kan tas i en följd. Vissa restriktioner är implicita i en riktad graf, t.ex. enkelriktade vägar där kanten för fel väg inte ens är inlagd i grafen. Men normalt finns det ibland restriktioner vid svängar, t.ex. ingen vänstersväng eller högersväng, därav namnet svängrestriktioner.
zh_hans: 道路限制是一系列不能按顺序采取的路段。 有向图上隐含了一些限制，例如单向道路，其中错误的边甚至不会插入到图上。 但通常在转弯时如不许左转或不许右转，因此得名转弯限制，这儿是一些常见限制

source: TRSP algorithm
sv: TRSP-algoritm
zh_hans: TRSP算法

source: The internal TRSP algorithm performs a lookahead over the dijkstra algorithm in order to find out if the attempted path has a restriction. This allows the algorithm to pass twice on the same vertex.
sv: Den interna TRSP-algoritmen utför en lookahead över dijkstra-algoritmen för att ta reda på om den sökta sökvägen har en restriktion. Detta gör att algoritmen kan passera två gånger på samma vertex.
zh_hans: 内部 TRSP 算法对 dijkstra 算法执行前瞻，以查明尝试的路径是否有限制。 这允许算法在同一顶点上传递两次

source: `Edges SQL`_ query as described.
sv: `Edges SQL`_-fråga enligt beskrivningen.
zh_hans: `Edges SQL`_按描述查询。

source: `Restrictions SQL`_
sv: "Begränsningar SQL

source: `Restrictions SQL`_ query as described.
sv: `Restrictions SQL`_-fråga enligt beskrivningen.
zh_hans: `Restrictions SQL`_按描述查询。

source: **via vertices**
sv: **via toppar**

source: ``ARRAY[`` **ANY-INTEGER** ``]``
sv: ``ARRAY[`` **ANY-TAL** ``]```

source: Array of ordered vertices identifiers that are going to be visited.
sv: Array av ordnade toppunktsidentifierare som kommer att besökas.
zh_hans: 将要访问的有序顶点标识符数组。

source: Restrictions
sv: Begränsningar
zh_hans: 限制

source: On road networks, there are restrictions such as left or right turn restrictions, no U turn restrictions.
sv: På vägnätet finns det begränsningar, till exempel begränsningar för vänster- eller högersväng, inga begränsningar för U-sväng.
zh_hans: 在道路网络上，有左转或右转限制等限制，没有掉头限制。

source: A restriction is a sequence of edges, called path and that path is to be avoided.
sv: En restriktion är en sekvens av kanter, som kallas väg, och den vägen ska undvikas.
zh_hans: 限制是一系列边，称为路径，并且要避免该路径。

source: **Restrictions on the road network**
sv: **Begränsningar av vägnätet**
zh_hans: **道路网络的限制**

source: These restrictions are represented on a table as follows:
sv: Dessa begränsningar visas i en tabell enligt följande:
zh_hans: 这些限制在表格中表示如下：

source: The table has an identifier, which maybe is needed for the administration of the restrictions, but the algorithms do not need that information. If given it will be ignored.
sv: Tabellen har en identifierare, som kanske behövs för administrationen av restriktionerna, men algoritmerna behöver inte den informationen. Om den ges kommer den att ignoreras.
zh_hans: 该表有一个标识符，这可能是管理限制所需要的，但算法不需要该信息。 如果给出，它将被忽略。

source: Restrictions SQL
sv: Begränsningar SQL

source: ``path``
sv: ``Sökväg``

source: Sequence of edge identifiers that form a path that is not allowed to be taken. - Empty arrays or ``NULL`` arrays are ignored. - Arrays that have a ``NULL`` element will raise an exception.
sv: Sekvens av kantidentifierare som bildar en väg som inte är tillåten att ta. - Tomma arrayer eller ``NULL`` arrayer ignoreras. - Arrayer som har ett ``NULL``-element kommer att ge upphov till ett undantag.
zh_hans: 形成不允许采用的路径的边缘标识符序列。 - 空数组或 ``NULL`` 数组将被忽略。 - 具有 ``NULL`` 元素的数组将引发异常。

source: ``Cost``
sv: ``Kostnad``

source: Cost of taking the forbidden path.
sv: Kostnaden för att gå den förbjudna vägen.
zh_hans: 走禁路的成本。

source: Traveling Sales Person - Family of functions
sv: Resande säljare - Familj av funktioner
zh_hans: Traveling Sales Person - 函数族

source: Table of Contents
sv: Innehåll
zh_hans: 目录

source: General Information
sv: Allmän information
zh_hans: 一般信息

source: Problem Definition
sv: Definition av problem
zh_hans: 问题定义

source: The travelling salesperson problem (TSP) asks the following question:
sv: Problemet med den resande försäljaren (TSP) ställer följande fråga:
zh_hans: 旅行推销员问题 (TSP) 提出以下问题：

source: *Given a list of cities and the distances between each pair of cities, which is the shortest possible route that visits each city exactly once and returns to the origin city?*
sv: *Givet en lista över städer och avstånden mellan varje par av städer, vilken är den kortaste möjliga rutten som besöker varje stad exakt en gång och återvänder till ursprungsstaden?*
zh_hans: *给定一个城市列表以及每对城市之间的距离，哪条是访问每个城市一次并返回出发城市的最短路线？*

source: Origin
sv: Ursprung
zh_hans: 起源

source: The traveling sales person problem was studied in the 18th century by mathematicians **Sir William Rowam Hamilton** and **Thomas Penyngton Kirkman**.
sv: Problemet med den resande försäljaren studerades på 1700-talet av matematikerna **Sir William Rowam Hamilton** och **Thomas Penyngton Kirkman**.
zh_hans: 旅行推销员问题由数学家 **William Rowam Hamilton 爵士**和 **Thomas Penyngton Kirkman** 于 18 世纪研究。

source: A discussion about the work of Hamilton & Kirkman can be found in the book **Graph Theory (Biggs et al. 1976)**.
sv: En diskussion om Hamilton & Kirkmans arbete finns i boken **Graph Theory (Biggs et al. 1976)**.
zh_hans: 关于汉密尔顿和柯克曼工作的讨论可参见《**图论》（比格斯等人，1976 年）一书**。

source: It is believed that the general form of the TSP have been first studied by Kalr Menger in Vienna and Harvard. The problem was later promoted by Hassler, Whitney & Merrill at Princeton. A detailed description about the connection between Menger & Whitney, and the development of the TSP can be found in `On the history of combinatorial optimization (till 1960) <https://homepages.cwi.nl/~lex/files/histco.ps>`__
sv: Man tror att den allmänna formen av TSP först studerades av Kalr Menger i Wien och Harvard. Problemet togs senare vidare av Hassler, Whitney & Merrill vid Princeton. En detaljerad beskrivning av sambandet mellan Menger & Whitney och utvecklingen av TSP finns i `On the history of combinatorial optimization (till 1960) <https://homepages.cwi.nl/~lex/files/histco.ps>`__
zh_hans: 人们认为旅行推销员问题（TSP）的一般形式最早由维也纳和哈佛的卡尔·门格尔（Karl Menger）研究。后来，普林斯顿的哈斯勒、惠特尼和梅里尔（Hassler, Whitney & Merrill）进一步推动了这个问题。关于门格尔和惠特尼之间的联系以及TSP的发展，可以在`组合优化的历史(直到1960年) <https://homepages.cwi.nl/~lex/files/histco.ps>`__。

source: To calculate the number of different tours through :math:`n` cities:
sv: För att beräkna antalet olika turer genom :math:`n` städer:
zh_hans: 计算经过:math:`n` 城市的不同旅行次数：

source: Given a starting city,
sv: Med tanke på en startstad,
zh_hans: 给定一个起始城市，

source: There are :math:`n-1` choices for the second city,
sv: Det finns :math:`n-1` val för den andra staden,
zh_hans: 第二个城市还有:math:`n-1`个选择，

source: And :math:`n-2` choices for the third city, etc.
sv: Och :math:`n-2` val för den tredje staden, etc.
zh_hans: 第三个城市的 :math:`n-2` 选项等。

source: Multiplying these together we get :math:`(n-1)! = (n-1) (n-2) . . 1`.
sv: Multiplicerar vi dessa tillsammans får vi :math:`(n-1)! = (n-1) (n-2) . . 1`.
zh_hans: 相乘得到 :math:`(n-1)！= (n-1) (n-2) ..1`.

source: Now since the travel costs do not depend on the direction taken around the tour:
sv: Nu när resekostnaderna inte beror på vilken riktning som tas runt turen:
zh_hans: 现在，由于旅行成本不取决于旅行的方向：

source: this number by 2
sv: detta tal med 2
zh_hans: 这个数字乘2

source: Characteristics
sv: Egenskaper
zh_hans: 特征

source: This problem is an NP-hard optimization problem.
sv: Detta problem är ett NP-svårt optimeringsproblem.
zh_hans: 该问题是一个NP-hard优化问题。

source: Metric Algorithm is used
sv: Metrisk algoritm används
zh_hans: 使用度量算法

source: Implementation generates solutions that *are twice as long as the optimal tour in the worst case*:
sv: Implementeringen genererar lösningar som *är dubbelt så långa som den optimala turen i värsta fall*:

source: Graph characteristics for best performance:
sv: Grafiska egenskaper för bästa prestanda:

source: Graph is undirected
sv: Grafen är ostyrd
zh_hans: 图是无向的

source: Graph is fully connected
sv: Grafen är helt sammanhängande
zh_hans: 图是全连通的

source: Graph where traveling costs on edges obey the triangle inequality.
sv: Graf där resekostnader på kanter följer triangelolikheten.
zh_hans: 图中，边上的旅行成本服从三角不等式。

source: The traveling costs are symmetric:
sv: Resekostnaderna är symmetriska:
zh_hans: 旅行费用是对称的：

source: Traveling costs from ``u`` to ``v`` are just as much as traveling from ``v`` to ``u``
sv: Resekostnaderna från ``u`` till ``v`` är lika mycket som att resa från ``v`` till ``u``
zh_hans: 从 ``u`` 到 ``v`` 的旅行费用与从 ``v`` 到 ``u`` 的旅行费用相同

source: TSP optional parameters
sv: TSP valfria parametrar
zh_hans: TSP 可选参数

source: The first visiting vertex
sv: Det första besökande toppunktet
zh_hans: 第一个访问顶点

source: When `0` any vertex can become the first visiting vertex.
sv: När `0` kan vilken toppunkt som helst bli den första besökande toppunkten.
zh_hans: 当 `0` 时，任何顶点都可以成为第一个访问顶点。

source: ``end_id``
sv: ``slut_id``

source: Last visiting vertex before returning to ``start_vid``.
sv: Sista besökande toppunkt innan återgång till ``start_vid``.
zh_hans: 返回 ``start_vid`` 之前最后访问的顶点。

source: When ``0`` any vertex can become the last visiting vertex before returning to ``start_id``.
sv: När ``0`` kan vilken topp som helst bli den sista besökande toppen innan den återvänder till ``start_id``.
zh_hans: 当为 ``0`` 时，任何顶点都可以成为返回 ``start_id`` 之前最后访问的顶点。

source: When ``NOT 0`` and ``start_id = 0`` then it is the first and last vertex
sv: När ``NOT 0`` och ``start_id = 0`` är det den första och sista toppunkten
zh_hans: 当 ``NOT 0`` 且 ``start_id = 0``时，它是第一个和最后一个顶点

source: References
sv: Referenser
zh_hans: 参考

source: `Boost: metric TSP approx <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__
sv: `Boost: metrisk TSP ca <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__

source: `University of Waterloo TSP <https://www.math.uwaterloo.ca/tsp/>`__
sv: universitetet i Waterloo TSP <https://www.math.uwaterloo.ca/tsp/>`__
zh_hans: `滑铁卢大学（University of Waterloo ）TSP <https://www.math.uwaterloo.ca/tsp/>`__

source: `Wikipedia: Traveling Salesman Problem <https://en.wikipedia.org/wiki/Traveling_salesman_problem>`__
sv: `Wikipedia: Problemet med den resande försäljaren <https://en.wikipedia.org/wiki/Traveling_salesman_problem>`__
zh_hans: `维基百科：旅行商问题 <https://en.wikipedia.org/wiki/Traveling_salesman_problem>`__

source: Vehicle Routing Functions - Category
sv: Funktioner för fordonsdirigering - Kategori

source: Pickup and delivery problem
sv: Problem med upphämtning och leverans
zh_hans: 取货和送货问题

source: Distribution problem
sv: Distributionsproblem
zh_hans: 分配问题

source: Contents
sv: Innehåll
zh_hans: 内容

source: Vehicle Routing Problems `VRP` are **NP-hard** optimization problem, it generalises the travelling salesman problem (TSP).
sv: Vehicle Routing Problems `VRP` är **NP-hårda** optimeringsproblem och är en generalisering av Travelling Salesman Problem (TSP).
zh_hans: 车辆路径问题 `VRP` 是 **NP-hard**优化问题，它推广了旅行商问题 (TSP)。

source: The objective of the VRP is to minimize the total route cost.
sv: VRP:s mål är att minimera den totala ruttkostnaden.
zh_hans: VRP 的目标是最小化总路由成本。

source: There are several variants of the VRP problem,
sv: Det finns flera varianter av VRP-problemet,
zh_hans: VRP 问题有多种变体，

source: **pgRouting does not try to implement all variants.**
sv: **pgRouting försöker inte implementera alla varianter.**
zh_hans: **pgRouting 并不尝试实现所有变体。**

source: Capacitated Vehicle Routing Problem `CVRP` where The vehicles have limited carrying capacity of the goods.
sv: Capacitated Vehicle Routing Problem `CVRP` där fordonen har begränsad lastkapacitet för godset.
zh_hans: 容量车辆路径问题 `CVRP` 其中车辆的货物承载能力有限。

source: Vehicle Routing Problem with Time Windows `VRPTW` where the locations have time windows within which the vehicle's visits must be made.
sv: Vehicle Routing Problem with Time Windows `VRPTW` där platserna har tidsfönster inom vilka fordonets besök måste göras.
zh_hans: 具有时间窗口的车辆路由问题 `VRPTW`，其中位置具有车辆必须访问的时间窗口。

source: Vehicle Routing Problem with Pickup and Delivery `VRPPD` where a number of goods need to be moved from certain pickup locations to other delivery locations.
sv: Vehicle Routing Problem with Pickup and Delivery `VRPPD` där ett antal varor måste flyttas från vissa upphämtningsplatser till andra leveransplatser.
zh_hans: 取货和送货的车辆路径问题`VRPPD`，其中大量货物需要从某些取货地点移动到其他送货地点。

source: Limitations
sv: Begränsningar
zh_hans: 局限性

source: No multiple time windows for a location.
sv: Inga flera tidsfönster för en plats.
zh_hans: 一个位置没有多个时间窗口。

source: Less vehicle used is considered better.
sv: Mindre fordon som används anses vara bättre.
zh_hans: 使用的车辆越少越好。

source: Less total duration is better.
sv: Kortare total varaktighet är bättre.
zh_hans: 总持续时间越短越好。

source: Less wait time is better.
sv: Kortare väntetid är bättre.
zh_hans: 等待时间越短越好。

source: Problem: `CVRPPDTW` Capacitated Pick and Delivery Vehicle Routing problem with Time Windows
sv: Problem: `CVRPPDTW` Kapaciterade plock- och leveransfordons ruttproblem med tidsfönster
zh_hans: 问题：`CVRPPDTW` 具有时间窗口的有能力分拣和送货车辆路径问题

source: Times are relative to `0`
sv: Tiden är relativ till `0`
zh_hans: 时间是相对于`0`的

source: The vehicles
sv: Fordonen
zh_hans: 车辆

source: have start and ending service duration times.
sv: har start- och sluttider för tjänstens varaktighet.
zh_hans: 有开始和结束服务持续时间。
