Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Information known at this point is the geometry of the edges, cost values, capacity values, category values and some locations that are not in the graph.
sv: Information som är känd vid denna tidpunkt är geometrin för kanterna, kostnadsvärden, kapacitetsvärden, kategorivärden och vissa platser som inte finns i grafen.

source: The process to have working topology starts by inserting the edges. After that everything else is calculated.
sv: Processen för att få en fungerande topologi börjar med att lägga in kanterna. Efter det beräknas allt annat.

source: The database design for the documentation of pgRouting, keeps in the same row 2 segments, one in the direction of the geometry and the second in the opposite direction. Therefore some information has the ``reverse_`` prefix which corresponds to the segment on the opposite direction of the geometry.
sv: Databasdesignen för dokumentationen av pgRouting, håller i samma rad 2 segment, ett i geometrins riktning och det andra i motsatt riktning. Därför har viss information prefixet ``reverse_`` som motsvarar segmentet i geometrins motsatta riktning.

source: Identifier of the starting vertex of the geometry ``geom``.
sv: Identifierare av startpunkten för geometrin ``geom``.

source: Identifier of the ending vertex of the geometry ``geom``
sv: Identifierare för geometrins slutpunkt ``geom``

source: Cost to traverse from `source` to ``target``.
sv: Kostnad för att gå från `källa` till `mål`.

source: Cost to traverse from `target` to ``source``.
sv: Kostnad för att gå från `mål` till `källa`.

source: Flow capacity from `source` to ``target``.
sv: Flödeskapacitet från `källa` till `mål`.

source: Flow capacity from `target` to ``source``.
sv: Flödeskapacitet från `mål` till `källa`.

source: For convenience it is saved on the table but can be calculated as ``ST_X(ST_StartPoint(geom))``.
sv: För enkelhetens skull sparas den i tabellen, men kan beräknas som ``ST_X(ST_StartPoint(geom))``.

source: For convenience it is saved on the table but can be calculated as ``ST_Y(ST_EndPoint(geom))``.
sv: För enkelhetens skull sparas den i tabellen, men kan beräknas som ``ST_Y(ST_EndPoint(geom))``.

source: The geometry of the segments.
sv: Segmentens geometri.

source: Starting on PostgreSQL 12::
sv: Börjar på PostgreSQL 12::

source: Optionally indexes on different columns can be created. The recommendation is to have
sv: Eventuellt kan index på olika kolumner skapas. Rekommendationen är att ha

source: ``id`` indexed.
sv: ``id`` indexerad.

source: ``source`` and ``target`` columns indexed to speed up pgRouting queries.
sv: kolumnerna ``källa`` och ``mål`` indexerade för att snabba upp pgRouting-frågor.

source: ``geom`` indexed to speed up geometry processes that might be needed in the front end.
sv: ``geom`` indexerad för att påskynda geometriska processer som kan behövas i frontend.

source: For this small example the indexes are skipped, except for ``id``
sv: I det här lilla exemplet hoppas indexen över, utom för ``id``

source: Edges data
sv: Data om kanter

source: Inserting into the database the information of the edges:
sv: Lägga in informationen om kanterna i databasen:

source: Negative values on the cost, capacity and category means that the edge do not exist.
sv: Negativa värden på kostnad, kapacitet och kategori innebär att kanten inte existerar.

source: Vertices
sv: Hörn

source: The vertex information is calculated based on the identifier of the edge and the geometry and saved on a table. Saving all the information provided by :doc:`pgr_extractVertices`:
sv: Vertexinformationen beräknas utifrån kantidentifieraren och geometrin och sparas i en tabell. Sparar all information som tillhandahålls av :doc:`pgr_extractVertices`:

source: In this case the because the ``CREATE`` statement was not used, the definition of an index on the table is needed.
sv: I det här fallet, eftersom ``CREATE``-satsen inte användes, behövs definitionen av ett index på tabellen.

source: The structure of the table is:
sv: Tabellens struktur är:

source: Vertices data
sv: Data om vertikaler

source: The saved information of the vertices is:
sv: Den sparade informationen om topparna är:

source: Here is where adding more columns to the vertices table can be done. Additional columns names and types will depend on the application.
sv: Här kan du lägga till fler kolumner i tabellen vertices. Namn och typer på ytterligare kolumner beror på tillämpningen.

source: The topology
sv: Topologin

source: This queries based on the vertices data create a topology by filling the ``source`` and ``target`` columns in the edges table.
sv: Denna fråga baseras på toppdata och skapar en topologi genom att fylla i kolumnerna "källa" och "mål" i tabellen "kanter".

source: Topology data
sv: Topologidata

source: Points outside the graph
sv: Punkter utanför grafen

source: Support tables
sv: Stödbord

source: Many functions can be used with a combinations of ``(source, target)`` pairs when wanting a route from ``source`` to ``target``.
sv: Många funktioner kan användas med kombinationer av paren ``(källa, mål)`` när man vill ha en rutt från ``källa`` till ``mål``.

source: For convenience of this documentation, some combinations will be stored on a table:
sv: För att underlätta denna dokumentation kommer vissa kombinationer att lagras på en tabell:

source: Inserting the data:
sv: Infoga data:

source: Combinations data
sv: Kombinationer data

source: Some functions accept soft restrictions about the segments.
sv: Vissa funktioner accepterar mjuka begränsningar för segmenten.

source: Images
sv: Bilder
zh_hans: 图片

source: Red arrows correspond when ``cost`` > 0 in the edge table.
sv: Röda pilar motsvarar när ``cost`` > 0 i kanttabellen.

source: Blue arrows correspond when ``reverse_cost`` > 0 in the edge table.
sv: Blå pilar motsvarar när ``reverse_cost`` > 0 i edge-tabellen.

source: Points are outside the graph.
sv: Punkterna ligger utanför grafen.

source: Click on the graph to enlarge.
sv: Klicka på grafen för att förstora den.

source: Directed graph with ``cost`` and ``reverse_cost``
sv: Riktad graf med ``kostnad`` och ``omvänd_kostnad``

source: When working with city networks, this is recommended for point of view of vehicles.
sv: När du arbetar med stadsnät rekommenderas detta för fordonens synvinkel.

source: Directed, with cost and reverse_cost
sv: Riktad, med kostnad och omvänd_kostnad

source: Undirected graph with ``cost`` and ``reverse_cost``
sv: Oriktad graf med ``kostnad`` och ``omvända_kostnader``

source: When working with city networks, this is recommended for point of view of pedestrians.
sv: När du arbetar med stadsnät rekommenderas detta för fotgängarnas synvinkel.

source: Undirected, with cost and reverse cost
sv: Ostyrd, med kostnad och omvänd kostnad

source: Directed graph with ``cost``
sv: Riktad graf med ``kostnad``

source: Directed, with cost
sv: Riktad, med kostnad

source: Undirected graph with ``cost``
sv: Oriktad graf med ``kostnad``

source: Undirected, with cost
sv: Ostyrd, med kostnad

source: Pick & Deliver Data
sv: Hämta och leverera data

source: Spanning Tree - Category
sv: Spanning Tree - Kategori
zh_hans: 生成树 - 类别

source: A spanning tree of an undirected graph is a tree that includes all the vertices of G with the minimum possible number of edges.
sv: Ett spännträd för en odelad graf är ett träd som innehåller alla hörn i G med minsta möjliga antal kanter.

source: For a disconnected graph, there there is no single tree, but a spanning forest, consisting of a spanning tree of each connected component.
sv: För en frånkopplad graf finns det inte ett enda träd, utan en spänningsskog, som består av ett spänningsträd för varje ansluten komponent.

source: Characteristics:
sv: Kännetecken:
zh_hans: 特征：

source: pgRouting community support is available through the `pgRouting website <https://pgrouting.org/support.html>`_, `documentation <https://docs.pgrouting.org>`_, tutorials, mailing lists and others. If you’re looking for :ref:`commercial support <support_commercial>`, find below a list of companies providing pgRouting development and consulting services.
sv: pgRouting community support är tillgängligt via `pgRouting webbplats <https://pgrouting.org/support.html>`_, `dokumentation <https://docs.pgrouting.org>`_, handledning, e-postlistor och andra. Om du letar efter :ref:`kommersiellt stöd <support_commercial>`, hittar du nedan en lista över företag som tillhandahåller pgRouting-utveckling och konsulttjänster.
zh_hans: pgRouting 社区支持可通过 `pgRouting 网站 <https://pgrouting.org/support.html>`_、`文档<https://docs.pgrouting.org>`_、教程、邮件列表等获得。 如果您正在寻求:ref:`商业支持<support_commercial>`，请在下面找到提供 pgRouting 开发和咨询服务的公司列表。

source: Reporting Problems
sv: Rapportering av problem
zh_hans: 报告问题

source: Bugs are reported and managed in an `issue tracker <https://github.com/pgrouting/pgrouting/issues>`_. Please follow these steps:
sv: Buggar rapporteras och hanteras i en `issue tracker <https://github.com/pgrouting/pgrouting/issues>`_. Vänligen följ dessa steg:
zh_hans: 错误在`问题跟踪器<https://github.com/pgrouting/pgrouting/issues>`_中报告和管理。 请按照以下步骤操作：

source: Search the tickets to see if your problem has already been reported. If so, add any extra context you might have found, or at least indicate that you too are having the problem. This will help us prioritize common issues.
sv: Sök bland ärendena för att se om ditt problem redan har rapporterats. Om så är fallet kan du lägga till extra sammanhang som du kan ha hittat, eller åtminstone ange att du också har problemet. Detta hjälper oss att prioritera vanliga problem.
zh_hans: 搜索票证以查看您的问题是否已被报告。 如果是这样，请添加您可能发现的任何额外上下文，或者至少表明您也遇到了问题。 这将帮助我们优先考虑常见问题。

source: If your problem is unreported, create a `new issue <https://github.com/pgRouting/pgrouting/issues/new>`__ for it.
sv: Om ditt problem inte har rapporterats, skapa en ny fråga <https://github.com/pgRouting/pgrouting/issues/new>`__ för det.
zh_hans: 如果您的问题未报告，请为其创建一个`新问题 <https://github.com/pgRouting/pgrouting/issues/new>`__ 。

source: In your report include explicit instructions to replicate your issue. The best tickets include the exact SQL necessary to replicate a problem.
sv: I din rapport inkluderar du uttryckliga instruktioner för att replikera ditt problem. De bästa ärendena innehåller den exakta SQL som krävs för att replikera ett problem.
zh_hans: 在您的报告中包含重现问题的明确说明。 最好的票证包含复制问题所需的确切 SQL。

source: If you can test older versions of PostGIS for your problem, please do. On your ticket, note the earliest version the problem appears.
sv: Om du kan testa äldre versioner av PostGIS för ditt problem, vänligen gör det. Notera den tidigaste versionen som problemet uppträder i ditt ärende.
zh_hans: 如果您可以测试旧版本的 PostGIS 来解决您的问题，请这样做。 在您的票证上，记下问题出现的最早版本。

source: For the versions where you can replicate the problem, note the operating system and version of pgRouting, PostGIS and PostgreSQL.
sv: För de versioner där du kan replikera problemet, notera operativsystemet och versionen av pgRouting, PostGIS och PostgreSQL.
zh_hans: 对于可以重现问题的版本，请记下操作系统以及 pgRouting、PostGIS 和 PostgreSQL 的版本。

source: It is recommended to use the following wrapper on the problem to pin point the step that is causing the problem.
sv: Vi rekommenderar att du använder följande wrapper på problemet för att hitta det steg som orsakar problemet.
zh_hans: 建议对问题使用以下包装器来查明导致问题的步骤。

source: Mailing List and GIS StackExchange
sv: Mailinglista och GIS StackExchange
zh_hans: 邮件列表和 GIS StackExchange

source: There are two mailing lists for pgRouting hosted on OSGeo mailing list server:
sv: Det finns två e-postlistor för pgRouting som finns på OSGeo mailing list server:
zh_hans: OSGeo 邮件列表服务器上托管有两个 pgRouting 邮件列表：

source: User mailing list: https://lists.osgeo.org/mailman/listinfo/pgrouting-users
sv: E-postlista för användare: https://lists.osgeo.org/mailman/listinfo/pgrouting-users
zh_hans: 用户邮件列表：https://lists.osgeo.org/mailman/listinfo/pgrouting-users

source: Developer mailing list: https://discourse.osgeo.org/c/pgrouting/pgrouting-dev/
sv: E-postlista för utvecklare: https://discourse.osgeo.org/c/pgrouting/pgrouting-dev/

source: Subscribe: https://discourse.osgeo.org/g/pgrouting-dev
sv: Prenumerera: https://discourse.osgeo.org/g/pgrouting-dev

source: For general questions and topics about how to use pgRouting, please write to the user mailing list.
sv: För allmänna frågor och ämnen om hur du använder pgRouting, vänligen skriv till e-postlistan för användare.
zh_hans: 有关如何使用 pgRouting 的一般问题和主题，请写信给用户邮件列表。

source: You can also ask at `GIS StackExchange <https://gis.stackexchange.com/>`_ and tag the question with ``pgrouting``. Find all questions tagged with ``pgrouting`` under https://gis.stackexchange.com/questions/tagged/pgrouting or subscribe to the `pgRouting questions feed <https://gis.stackexchange.com/feeds/tag?tagnames=pgrouting&sort=newest>`_.
sv: Du kan också ställa frågan på `GIS StackExchange <https://gis.stackexchange.com/>`_ och märka frågan med ``pgrouting``. Hitta alla frågor taggade med ``pgrouting`` under https://gis.stackexchange.com/questions/tagged/pgrouting eller prenumerera på `pgRouting questions feed <https://gis.stackexchange.com/feeds/tag?tagnames=pgrouting&sort=newest>`_.
zh_hans: 您还可以在 `GIS StackExchange <https://gis.stackexchange.com/>`_ 上提问，并使用 ``pgrouting`` 标签。查找所有带有 ``pgrouting`` 标签的问题，请访问 https://gis.stackexchange.com/questions/tagged/pgrouting 或订阅 `pgRouting 问题订阅 <https://gis.stackexchange.com/feeds/tag?tagnames=pgrouting&sort=newest>`_。

source: Commercial Support
sv: Kommersiellt stöd
zh_hans: 商业支持

source: For users who require professional support, development and consulting services, consider contacting any of the following organizations, which have significantly contributed to the development of pgRouting:
sv: För användare som behöver professionell support, utveckling och konsulttjänster kan du överväga att kontakta någon av följande organisationer, som har bidragit väsentligt till utvecklingen av pgRouting:
zh_hans: 对于需要专业支持、开发和咨询服务的用户，请考虑联系以下任何一个组织，这些组织对 pgRouting 的发展做出了重大贡献：

source: **Company**
sv: **Företag**
zh_hans: **公司**

source: **Offices in**
sv: **Kontor i**
zh_hans: **办事处**

source: **Website**
sv: **Webbplats**
zh_hans: **网站**

source: Germany, Japan
sv: Tyskland, Japan
zh_hans: 德国，日本

source: United States
sv: USA
zh_hans: 美国

source: Capranica, Italy
sv: Capranica, Italien
zh_hans: 卡普拉尼卡，意大利

source: Transformation - Family of functions
sv: Transformation - Familj av funktioner

source: This family of functions is used for transforming a given input graph :math:`G(V,E)` into a new graph :math:`G'(V',E')`.
sv: Denna familj av funktioner används för att omvandla en given indatagraf :math:`G(V,E)` till en ny graf :math:`G'(V',E')`.
zh_hans: 该函数族用于将给定的输入图:math:`G(V,E)`转换为新图 :math:`G'(V',E')`。

source: Traversal - Family of functions
sv: Traversal - Familj av funktioner
zh_hans: Traversal - 函数族

source: Additionally there are 2 categories under this family
sv: Dessutom finns det 2 kategorier under denna familj

source: Utility functions
sv: Verktygsfunktioner

source: Via - Category
sv: Via - Kategori
zh_hans: Via - 类别

source: This category intends to solve the general problem:
sv: Denna kategori avser att lösa det allmänna problemet:
zh_hans: 该类别旨在解决普遍问题：

source: Given a graph and a list of vertices, find the shortest path between :math:`vertex_i` and :math:`vertex_{i+1}` for all vertices
sv: Givet en graf och en lista med toppar, hitta den kortaste vägen mellan :math:`vertex_i` och :math:`vertex_{i+1}` för alla toppar
zh_hans: 给定一个图和一个顶点列表，找到所有相邻顶点对 :math:`vertex_i` 和 :math:`vertex_{i+1}` 之间的最短路径

source: In other words, find a continuous route that visits all the vertices in the order given.
sv: Med andra ord, hitta en kontinuerlig rutt som besöker alla toppar i den ordning som anges.

source: path
sv: väg

source: represents a section of a **route**.
sv: representerar en del av en **rutt**.
zh_hans: 代表**route**的一部分。

source: route
sv: rutt

source: is a sequence of **paths**
sv: är en sekvens av **vägar**
zh_hans: 是一系列**paths**

source: **Used in:**
sv: **Används i:**
zh_hans: **用于：**

source: Besides the compulsory parameters each function has, there are optional parameters that exist due to the kind of function.
sv: Förutom de obligatoriska parametrar som varje funktion har, finns det valfria parametrar som beror på vilken typ av funktion det är.
zh_hans: 除了每个函数具有的强制参数之外，由于函数的种类而存在可选参数。

source: Used in all Via functions
sv: Används i alla Via-funktioner
zh_hans: 用于所有 Via 功能

source: Depending on the function one or more inner queries are needed.
sv: Beroende på funktion behövs en eller flera inre frågor.
zh_hans: 根据函数需要一个或多个内部查询。

source: withPoints - Category
sv: withPoints - Kategori
zh_hans: withPoints - 类别

source: When points are added to the graph.
sv: När punkter läggs till i diagrammet.
zh_hans: 当点添加到图中时。

source: The **with points** category modifies the graph on the fly by adding points on edges as required by the `Points SQL`_ query.
sv: Kategorin **with points** ändrar grafen i farten genom att lägga till punkter på kanterna enligt vad som krävs av SQL-frågan `Points`_.
zh_hans: **with points** 类别通过根据 `Points SQL`_ 查询的要求在边上添加点来动态修改图形。

source: The functions within this category give the ability to process between arbitrary points located outside the original graph.
sv: Funktionerna inom denna kategori ger möjlighet att bearbeta mellan godtyckliga punkter utanför den ursprungliga grafen.
zh_hans: 该类别中的函数能够在位于原始图之外的任意点之间进行处理。

source: This category of functions was thought for routing vehicles, but might as well work for some other application not involving vehicles.
sv: Denna kategori av funktioner var tänkt för att dirigera fordon, men kan lika gärna fungera för någon annan applikation som inte involverar fordon.
zh_hans: 此类功能被认为用于路由车辆，但也可能适用于其他一些不涉及车辆的应用程序。

source: When given a point identifier ``pid`` that its being mapped to an edge with an identifier ``edge_id``, with a fraction from the source to the target along the edge ``fraction`` and some additional information about which side of the edge the point is on ``side``, then processing from arbitrary points can be done on fixed networks.
sv: När man får en punktidentifierare ``pid`` som mappas till en kant med en identifierare ``edge_id``, med en fraktion från källan till målet längs kanten ``fraktion`` och lite ytterligare information om vilken sida av kanten punkten ligger på ``side``, kan bearbetning från godtyckliga punkter göras på fasta nätverk.
zh_hans: 当给定一个点标识符 `pid`，它被映射到具有标识符 `edge_id` 的边上，并且有一个从源到目标沿边的分数 `fraction`，以及关于点位于边的哪一侧的其他信息 `side`，那么可以在固定网络上从任意点进行处理。

source: All this functions consider as many traits from the "real world" as possible:
sv: Alla dessa funktioner tar hänsyn till så många egenskaper från den "verkliga världen" som möjligt:
zh_hans: 所有这些函数都考虑了尽可能多的“现实世界”特征：

source: Kind of graph:
sv: Typ av graf:
zh_hans: 图的种类：

source: **directed** graph
sv: **riktad** graf
zh_hans: **有向**图

source: **undirected** graph
sv: **Omdirigerad** graf
zh_hans: **无向**图

source: Arriving at the point:
sv: Anländer till punkten:
zh_hans: 到达点：

source: Compulsory arrival on the side of the segment where the point is located.
sv: Obligatorisk ankomst på den sida av segmentet där punkten är belägen.
zh_hans: 强制到达该点所在航段的一侧。

source: On either side of the segment.
sv: På vardera sidan om segmentet.
zh_hans: 位于该段的两侧。

source: Countries with:
sv: Länder med:
zh_hans: 具有以下条件的国家：

source: **Right** side driving
sv: *körning på *höger** sida
zh_hans: **右侧**驾驶

source: **Left** side driving
sv: **Vänster** sida körning
zh_hans: **左侧**驾驶

source: Some points are:
sv: Några punkter är:
zh_hans: 一些要点是：

source: **Permanent**: for example the set of points of clients stored in a table in the data base.
sv: **Permanent**: t.ex. en uppsättning punkter för kunder som lagras i en tabell i databasen.
zh_hans: **永久**：例如，存储在表中的客户端点集 数据库。

source: The graph has been modified to permanently have those points as vertices.
sv: Grafen har ändrats så att den permanent har dessa punkter som hörn.
zh_hans: 图已修改为将这些点永久用作顶点。

source: There is a table on the database that describes the points
sv: Det finns en tabell i databasen som beskriver punkterna
zh_hans: 数据库上有一个描述点的表格

source: **Temporal**: for example points given through a web application
sv: **Temporal**: till exempel punkt som ges via en webbapplikation
zh_hans: **时间**：例如通过 Web 应用程序给出的点

source: The numbering of the points are handled with negative sign.
sv: Numreringen av punkterna hanteras med negativt tecken.
zh_hans: 在点 SQL 中使用pgr_findCloseEdges。

source: This sign change is to avoid confusion when there is a vertex with the same identifier as the point identifier.
sv: Denna teckenändring är till för att undvika förvirring när det finns en topp med samma identifierare som punktens identifierare.
zh_hans: 这种符号变化是为了避免当存在与点标识符具有相同标识符的顶点时发生混淆。

source: Original point identifiers are to be positive.
sv: Ursprungliga punktidentifierare ska vara positiva.
zh_hans: 原始点标识符应为正数。

source: Transformation to negative is done internally.
sv: Omvandling till negativ sker internt.
zh_hans: 向负数的转变是在内部完成的。

source: Interpretation of the sign on the node information of the output
sv: Tolkning av tecknet på noden information om utdata
zh_hans: 解释输出的节点上的符号信息

source: positive sign is a vertex of the original graph
sv: positivt tecken är ett toppunkt i den ursprungliga grafen
zh_hans: 正号是原始图的顶点

source: negative sign is a point of the `Points SQL`_
sv: negativt tecken är en punkt i `Points SQL`_
zh_hans: 负号是`Points SQL`_ 的一个点

source: About points
sv: Om punkt
zh_hans: 关于积分

source: For this section the following city (see :doc:`sampledata`) some interesting points such as restaurant, supermarket, post office, etc. will be used as example.
sv: I detta avsnitt kommer följande stad (se :doc:`sampledata`) att användas som exempel: några intressanta punkter såsom restaurang, snabbköp, postkontor etc.

source: The graph is **directed**
sv: Grafen är **riktad**
zh_hans: 图是**有向**的

source: Red arrows show the ``(source, target)`` of the edge on the edge table
sv: Röda pilar visar ``(källa, mål)`` för kanten i kanttabellen
zh_hans: 红色箭头显示边表上的边``(source, target)``

source: Blue arrows show the ``(target, source)`` of the edge on the edge table
sv: Blå pilar visar ``(mål, källa)`` för kanten i kanttabellen
zh_hans: 蓝色箭头显示边表上的边``(target, source)``

source: Each point location shows where it is located with relation of the edge ``(source, target)``
sv: Varje punktposition visar var den är belägen i förhållande till kanten ``(källa, mål)``
zh_hans: 每个点位置显示它与边 ``(source, target)``的关系

source: On the right for points **2** and **4**.
sv: Till höger för punkterna **2** och **4**.
zh_hans: 在右侧为第** 2 **点和第** 4** 点。

source: On the left for points **1**, **3** and **5**.
sv: Till vänster för punkterna **1**, **3** och **5**.
zh_hans: 左侧为第 **1**、**3** 和** 5 **点。

source: On both sides for point **6**.
sv: På båda sidor för punkt **6**.
zh_hans: 在两侧为第**6**点。

source: The representation on the data base follows the `Points SQL`_ description, and for this example:
sv: Representationen på databasen följer `Points SQL`_-beskrivningen, och för detta exempel:
zh_hans: 数据库上的表示遵循 `Points SQL`_ 描述，对于本示例：

source: Driving side
sv: Körning på sidan
zh_hans: 驾驶侧

source: In the following images:
sv: I följande bilder:

source: The squared vertices are the temporary vertices,
sv: De kvadrerade topparna är de tillfälliga topparna,
zh_hans: 平方顶点是临时顶点，

source: The temporary vertices are added according to the driving side,
sv: De tillfälliga topparna läggs till enligt körsidan,
zh_hans: 根据驾驶侧添加临时顶点，

source: visually showing the differences on how depending on the driving side the data is interpreted.
sv: visar visuellt skillnaderna i hur data tolkas beroende på vilken sida som kör.
zh_hans: 直观地显示不同驾驶侧数据解释方式的差异。
