Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: The steps to prepare the graph involve geometry operations using `PostGIS <https://postgis.net/>`__ and some others involve graph operations like :doc:`pgr_contraction` to contract a graph.
sv: Stegen för att förbereda grafen involverar geometriska operationer med hjälp av `PostGIS <https://postgis.net/>`__ och vissa andra involverar grafoperationer som :doc:`pgr_contraction` för att dra ihop en graf.
zh_hans: 准备图的步骤涉及使用`PostGIS <https://postgis.net/>`__进行几何操作，其他一些步骤涉及诸如:doc:`pgr_contraction` 之类的图操作来收缩图。

source: The `workshop <https://workshop.pgrouting.org/latest>`__ has a step by step on how to prepare a graph using Open Street Map data, for a small application.
sv: I workshopen <https://workshop.pgrouting.org/latest>`__ finns en steg-för-stegbeskrivning av hur man skapar en graf med hjälp av Open Street Map-data för en liten applikation.
zh_hans: 该 `workshop <https://workshop.pgrouting.org/latest>`__逐步介绍了如何使用开放街道地图数据为小型应用程序准备图。

source: The use of indexes on the database design in general:
sv: Användningen av index på databasdesignen i allmänhet:
zh_hans: 数据库设计上索引的使用一般：

source: Have the geometries indexed.
sv: Låt geometrierna vara indexerade.
zh_hans: 对几何图形进行索引。

source: Have the identifiers columns indexed.
sv: Låt kolumnerna med identifierare indexeras.
zh_hans: 对标识符列建立索引。

source: Please consult the `PostgreSQL <https://www.postgresql.org/docs/>`__ documentation and the `PostGIS <https://postgis.net/>`__ documentation.
sv: Vänligen se dokumentationen för `PostgreSQL <https://www.postgresql.org/docs/>`__ och dokumentationen för `PostGIS <https://postgis.net/>`__.
zh_hans: 请查阅`PostgreSQL <https://www.postgresql.org/docs/>`__ 文档和 `PostGIS <https://postgis.net/>`__文档。

source: Data coming from OSM and using `osm2pgrouting <https://github.com/pgRouting/osm2pgrouting>`__ as an import tool, comes with the routing topology. See an example of using ``osm2pgrouting`` on the `workshop <https://workshop.pgrouting.org/latest/en/basic/data.html>`__.
sv: Data som kommer från OSM och använder `osm2pgrouting <https://github.com/pgRouting/osm2pgrouting>`__ som ett importverktyg, kommer med routingtopologin. Se ett exempel på användning av ``osm2pgrouting`` på `workshop <https://workshop.pgrouting.org/latest/en/basic/data.html>`__.
zh_hans: 来自 OSM 并使用 `osm2pgrouting <https://github.com/pgRouting/osm2pgrouting>`__ 作为导入工具的数据附带路由拓扑。 请参阅`workshop <https://workshop.pgrouting.org/latest/en/basic/data.html>`__上使用``osm2pgrouting`` 的示例。

source: Adjust costs
sv: Justera kostnader
zh_hans: 调整成本

source: For this example the ``cost`` and ``reverse_cost`` values are going to be the double of the length of the geometry.
sv: I det här exemplet kommer värdena ``cost`` och ``reverse_cost`` att vara det dubbla av geometrins längd.
zh_hans: 对于本示例，``cost`` 和``reverse_cost``值将是几何体长度的两倍。

source: Update costs to length of geometry
sv: Uppdatera kostnaderna till geometrins längd
zh_hans: 将成本更新为几何形状的长度

source: Suppose that ``cost`` and ``reverse_cost`` columns in the sample data represent:
sv: Antag att kolumnerna ``kostnad`` och ``omvända_kostnader`` i urvalsdata representerar:
zh_hans: 假设样本数据中的 ``cost`` 和``reverse_cost``列表示：

source: Using that information updating to the length of the geometries:
sv: Med hjälp av den informationen uppdateras geometriernas längd:
zh_hans: 使用该信息更新几何形状的长度：

source: Which gives the following results:
sv: Vilket ger följande resultat:
zh_hans: 给出以下结果：

source: Note that to be able to follow the documentation examples, everything is based on the original graph.
sv: Observera att för att kunna följa dokumentationsexemplen är allt baserat på den ursprungliga grafen.
zh_hans: 请注意，为了能够遵循文档示例，一切都基于原始图。

source: Returning to the original data:
sv: Återgå till de ursprungliga uppgifterna:
zh_hans: 回到原始数据：

source: Update costs based on codes
sv: Uppdatera kostnader baserat på koder
zh_hans: 根据代码更新成本

source: Other datasets, can have a column with values like
sv: Andra dataset kan ha en kolumn med värden som
zh_hans: 其他数据集可以有一列包含如下值

source: ``FT`` vehicle flow on the direction of the geometry
sv: ``FT`` fordonsflöde i geometrins riktning
zh_hans: ``FT``几何方向上的车流

source: ``TF`` vehicle flow opposite of the direction of the geometry
sv: ``TF`` fordonsflöde motsatt geometrins riktning
zh_hans: ``TF`` 车流与几何方向相反

source: ``B`` vehicle flow on both directions
sv: ``B`` fordonsflöde i båda riktningarna
zh_hans: ``B``双向车流

source: Preparing a code column for the example:
sv: Förbereda en kodkolumn för exemplet:
zh_hans: 为示例准备代码列：

source: Adjusting the costs based on the codes:
sv: Justering av kostnaderna baserat på koderna:
zh_hans: 根据代码调整成本：

source: Check the Routing Topology
sv: Kontrollera routingtopologin
zh_hans: 检查路由拓扑

source: There are lots of possible problems in a graph.
sv: Det finns många möjliga problem i en graf.
zh_hans: 图中可能存在很多问题。

source: The data used may not have been designed with routing in mind.
sv: De data som används kanske inte har utformats med tanke på routing.
zh_hans: 使用的数据在设计时可能没有考虑路由。

source: A graph has some very specific requirements.
sv: En graf har några mycket specifika krav.
zh_hans: 图有一些非常具体的要求。

source: The graph is disconnected.
sv: Grafen är frånkopplad.
zh_hans: 该图已断开连接。

source: There are unwanted intersections.
sv: Det finns oönskade korsningar.
zh_hans: 存在不需要的交叉点。

source: The graph is too large and needs to be contracted.
sv: Grafen är för stor och behöver krympas.
zh_hans: 图太大，需要收缩。

source: A sub graph is needed for the application.
sv: En subgraf behövs för applikationen.
zh_hans: 该应用程序需要一个子图。

source: and many other problems that the pgRouting user, that is the application developer might encounter.
sv: och många andra problem som pgRouting-användaren, det vill säga applikationsutvecklaren, kan stöta på.
zh_hans: 以及 pgRouting 用户（即应用程序开发人员）可能遇到的许多其他问题。

source: Crossing edges
sv: Korsande kanter
zh_hans: 交叉边

source: To get the crossing edges:
sv: För att få de korsande kanterna:
zh_hans: 要获取交叉边：

source: That information is correct, for example, when in terms of vehicles, is it a tunnel or bridge crossing over another road.
sv: Den informationen är korrekt, till exempel när det gäller fordon, är det en tunnel eller bro som korsar en annan väg.
zh_hans: 这些信息是正确的，例如，就车辆而言，是隧道还是横跨另一条道路的桥梁。

source: It might be incorrect, for example:
sv: Det kan till exempel vara felaktigt:
zh_hans: 它可能是不正确的，例如：

source: When it is actually an intersection of roads, where vehicles can make turns.
sv: När det faktiskt är en korsning av vägar, där fordon kan svänga.
zh_hans: 当它实际上是道路交叉口时，车辆可以转弯。

source: When in terms of electrical lines, the electrical line is able to switch roads even on a tunnel or bridge.
sv: När det gäller elektriska ledningar kan den elektriska ledningen byta väg även i en tunnel eller på en bro.
zh_hans: 在电力线路方面，电力线能够在隧道或桥梁上甚至切换道路。

source: When it is incorrect, it needs fixing:
sv: När den är felaktig behöver den åtgärdas:
zh_hans: 当不正确时，需要修复：

source: For vehicles and pedestrians
sv: För fordon och fotgängare
zh_hans: 对于车辆和行人

source: If the data comes from OSM and was imported to the database using ``osm2pgrouting``, the fix needs to be done in the `OSM portal <https://www.openstreetmap.org>`__ and the data imported again.
sv: Om data kommer från OSM och importerades till databasen med hjälp av ``osm2pgrouting``, måste korrigeringen göras i `OSM-portalen <https://www.openstreetmap.org>`__ och data importeras igen.
zh_hans: 如果数据来自 OSM 并使用 ``osm2pgrouting`` 导入到数据库，则需要在 `OSM portal <https://www.openstreetmap.org>`__ 中完成修复并再次导入数据。

source: In general when the data comes from a supplier that has the data prepared for routing vehicles, and there is a problem, the data is to be fixed from the supplier
sv: I allmänhet när data kommer från en leverantör som har förberett data för routing av fordon och det finns ett problem, ska data åtgärdas från leverantören
zh_hans: 一般来说，当数据来自为车辆路线准备数据的供应商时，并且出现问题时，需要从供应商处修复数据

source: For very specific applications
sv: För mycket specifika tillämpningar
zh_hans: 对于非常具体的应用

source: The data is correct when from the point of view of routing vehicles or pedestrians.
sv: Uppgifterna är korrekta om de ses ur de dirigerande fordonens eller fotgängarnas synvinkel.
zh_hans: 从路线车辆或行人的角度来看，数据是正确的。

source: The data needs a local fix for the specific application.
sv: Uppgifterna behöver en lokal fix för den specifika applikationen.
zh_hans: 数据需要针对特定应用程序进行本地修复。

source: Once analyzed one by one the crossings, for the ones that need a local fix, the edges need to be `split <https://postgis.net/docs/ST_Split.html>`__.
sv: När korsningarna har analyserats en efter en, för de som behöver en lokal fix, måste kanterna `delas <https://postgis.net/docs/ST_Split.html>`__.
zh_hans: 对交叉点进行一一分析后，对于需要局部修复的交叉点，需要 `分割 <https://postgis.net/docs/ST_Split.html>`__边。

source: The new edges need to be added to the edges table, the rest of the attributes need to be updated in the new edges, the old edges need to be removed and the routing topology needs to be updated.
sv: De nya kanterna måste läggas till i kanttabellen, resten av attributen måste uppdateras i de nya kanterna, de gamla kanterna måste tas bort och routingtopologin måste uppdateras.
zh_hans: 需要将新边添加到边表中，需要更新新边中的其余属性，需要删除旧边并需要更新路由拓扑。

source: Fixing an intersection
sv: Fixa en korsning

source: In this example the original edge table will be used to store the additional geometries.
sv: I detta exempel kommer den ursprungliga kanttabellen att användas för att lagra de extra geometrierna.

source: An example use without results
sv: Ett exempel på användning utan resultat

source: Routing from :math:`1` to :math:`18` gives no solution.
sv: Routning från :math:`1` till :math:`18` ger ingen lösning.

source: Analyze the network for intersections.
sv: Analysera nätverket för korsningar.

source: The analysis tell us that the network has an intersection.
sv: Analysen visar att nätverket har en korsning.

source: Prepare tables
sv: Förbereda tabeller

source: Additional columns to control the origin of the segments.
sv: Ytterligare kolumner för att styra segmentens ursprung.

source: Adding new segments.
sv: Lägga till nya segment.

source: Calling :doc:`pgr_separateCrossing` and adding the new segments to the edges table.
sv: Anropar :doc:`pgr_separateCrossing` och lägger till de nya segmenten i tabellen över kanter.

source: Update other values
sv: Uppdatera andra värden

source: In this example only ``cost`` and ``reverse_cost`` are updated, where they are based on the length of the geometry and the directionality is kept using the ``sign`` function.
sv: I det här exemplet uppdateras endast ``cost`` och ``reverse_cost``, där de baseras på geometrins längd och riktningen bibehålls med hjälp av funktionen ``sign``.

source: Update the topology
sv: Uppdatera topologin

source: Insert the new vertices if any.
sv: Infoga eventuella nya hörn.

source: Update source and target information on the edges table.
sv: Uppdatera käll- och målinformationen i kanttabellen.

source: The example has results
sv: Exemplet har resultat

source: Routing from :math:`1` to :math:`18` gives a solution.
sv: Routning från :math:`1` till :math:`18` ger en lösning.

source: Touching edges
sv: Beröring av kanter

source: Visually the edges seem to be connected, but internally they are not.
sv: Visuellt verkar kanterna vara sammankopplade, men internt är de inte det.

source: The validity of the information is application dependent.
sv: Informationens giltighet är applikationsberoende.

source: Maybe there is a small barrier for vehicles but not for pedestrians.
sv: Kanske finns det en liten barriär för fordon men inte för fotgängare.

source: Once analyzed one by one the touchings, for the ones that need a local fix, the edges need to be `split <https://postgis.net/docs/ST_Split.html>`__.
sv: När beröringarna har analyserats en efter en, för de som behöver en lokal fix, måste kanterna `delas <https://postgis.net/docs/ST_Split.html>`__.

source: Fixing a gap
sv: Åtgärda en lucka

source: Routing from :math:`1` to :math:`2` gives no solution.
sv: Routning från :math:`1` till :math:`2` ger ingen lösning.

source: Analyze the network for gaps.
sv: Analysera nätverket för att hitta luckor.

source: The analysis tell us that the network has a gap.
sv: Analysen visar att det finns en lucka i nätverket.

source: Calling :doc:`pgr_separateTouching` and adding the new segments to the edges table.
sv: Anropar :doc:`pgr_separateTouching` och lägger till de nya segmenten i tabellen över kanter.

source: Routing from :math:`1` to :math:`2` gives a solution.
sv: En routning från :math:`1` till :math:`2` ger en lösning.

source: Connecting components
sv: Anslutning av komponenter
zh_hans: 连接组件

source: To get the graph connectivity:
sv: För att få grafens anslutningsmöjligheter:
zh_hans: 要获取图的连通性：

source: There are three basic ways to connect components:
sv: Det finns tre grundläggande sätt att ansluta komponenter:

source: From the vertex to the starting point of the edge
sv: Från toppunkten till startpunkten för kanten
zh_hans: 从顶点到边的起点

source: From the vertex to the ending point of the edge
sv: Från toppunkten till slutpunkten för kanten
zh_hans: 从顶点到边的终点

source: From the vertex to the closest vertex on the edge
sv: Från toppunkten till den närmaste toppunkten på kanten
zh_hans: 从边上的顶点到最近的顶点

source: This solution requires the edge to be split.
sv: Denna lösning kräver att kanten delas.
zh_hans: 该解决方案需要将边缘分割。

source: In this example :doc:`pgr_separateCrossing` and :doc:`pgr_separateTouching` will be used.
sv: I detta exempel kommer :doc:`pgr_separateCrossing` och :doc:`pgr_separateTouching` att användas.

source: Get the connectivity
sv: Få anslutningsmöjligheterna

source: In this example: the edges table will need an additional column and the vertex table will be rebuilt completely.
sv: I det här exemplet behöver tabellen edges en extra kolumn och tabellen vertex byggs om helt och hållet.

source: Insert new edges
sv: Infoga nya kanter

source: Using :doc:`pgr_separateCrossing` and :doc:`pgr_separateTouching` insert the results into the edges table.
sv: Använd :doc:`pgr_separateCrossing` och :doc:`pgr_separateTouching` för att infoga resultaten i tabellen över kanter.

source: Create the vertices table
sv: Skapa en tabell över hörnpunkter
zh_hans: 创建顶点表

source: Using :doc:`pgr_extractVertices` create the table.
sv: Skapa tabellen med hjälp av :doc:`pgr_extractVertices`.

source: Contraction of a graph
sv: Sammandragning av en graf
zh_hans: 图的收缩

source: The graph can be reduced in size using :doc:`contraction-family`
sv: Grafen kan minskas i storlek med hjälp av :doc:`contraction-family`
zh_hans: 可以使用:doc:`contraction-family`来减小图形的大小

source: When to contract will depend on the size of the graph, processing times, correctness of the data, on the final application, or any other factor not mentioned.
sv: När kontrakt ska ingås beror på grafens storlek, behandlingstider, uppgifternas riktighet, den slutliga ansökan eller någon annan faktor som inte nämns.
zh_hans: 何时收缩将取决于图的大小、处理时间、数据的正确性、最终应用程序或任何其他未提及的因素。

source: A fairly good method of finding out if contraction can be useful is because of the number of dead ends and/or the number of linear edges.
sv: En ganska bra metod för att ta reda på om sammandragning kan vara användbart är på grund av antalet återvändsgränder och/eller antalet linjära kanter.
zh_hans: 确定收缩是否有用的一个相当好的方法是根据死端的数量和/或线性边的数量。

source: A complete method on how to contract and how to use the contracted graph is described on :doc:`contraction-family`
sv: En fullständig metod för hur man kontraherar och hur man använder den kontraherade grafen beskrivs på :doc:`contraction-family`
zh_hans: 有关如何收缩以及如何使用收缩图的完整方法在 :doc:`contraction-family`中进行了描述

source: To get the dead ends:
sv: För att få bort återvändsgränderna:
zh_hans: 获取死端：

source: A dead end happens when
sv: En återvändsgränd uppstår när

source: The vertex is the limit of a cul-de-sac, a no-through road or a no-exit road.
sv: Toppunkten är gränsen för en återvändsgränd, en väg med genomfartsförbud eller en väg med utfartsförbud.

source: The vertex is on the limit of the imported graph.
sv: Toppunkten ligger på gränsen för den importerade grafen.

source: If a larger graph is imported then the vertex might not be a dead end
sv: Om en större graf importeras är det inte säkert att toppunkten är en återvändsgränd

source: Node :math:`4`, is a dead end on the query, even that it visually looks like an end point of 3 edges.
sv: Noden :math:`4`, är en återvändsgränd i frågan, även om den visuellt ser ut som en slutpunkt för 3 kanter.

source: Is node :math:`4` a dead end or not?
sv: Är noden :math:`4` en återvändsgränd eller inte?

source: The answer to that question will depend on the application.
sv: Svaret på den frågan beror på vilken applikation det gäller.

source: Is there such a small curb:
sv: Finns det en sådan liten trottoarkant:
zh_hans: 有这么小的路边吗：

source: That does not allow a vehicle to use that visual intersection?
sv: Som inte tillåter ett fordon att använda den visuella korsningen?
zh_hans: 这不允许车辆使用该视觉交叉路口？

source: Is the application for pedestrians and therefore the pedestrian can easily walk on the small curb?
sv: Är applikationen för fotgängare och därför kan fotgängaren enkelt gå på den lilla trottoaren?
zh_hans: 是否适用于行人，因此行人可以轻松地在小路边行走？

source: Is the application for the electricity and the electrical lines than can easily be extended on top of the small curb?
sv: Gäller ansökan el och elledningar som enkelt kan förlängas ovanpå den lilla trottoarkanten?
zh_hans: 电力和电线的应用是否可以轻松地延伸到小路边顶部？

source: Is there a big cliff and from eagles view look like the dead end is close to the segment?
sv: Finns det en stor klippa och från örnens utsikt ser det ut som att återvändsgränden ligger nära segmentet?
zh_hans: 是否有一个大悬崖，从鹰的角度看，死胡同靠近该路段？

source: Depending on the answer, modification of the data might be needed.
sv: Beroende på svaret kan det bli nödvändigt att ändra uppgifterna.

source: When there are many dead ends, to speed up processing, the :doc:`contraction-family` functions can be used to contract the graph.
sv: När det finns många återvändsgränder kan funktionerna :doc:`contraction-family` användas för att dra ihop grafen för att påskynda bearbetningen.

source: Linear edges
sv: Linjära kanter
zh_hans: 线性边

source: To get the linear edges:
sv: För att få de linjära kanterna:
zh_hans: 要获得线性边：

source: These linear vertices are correct, for example, when those the vertices are speed bumps, stop signals and the application is taking them into account.
sv: Dessa linjära hörn är korrekta, till exempel när de hörnen är farthinder, stoppsignaler och applikationen tar hänsyn till dem.

source: When there are many linear vertices, that need not to be taken into account, to speed up the processing, the :doc:`contraction-family` functions can be used to contract the problem.
sv: När det finns många linjära toppar, som inte behöver beaktas, för att påskynda bearbetningen, kan funktionerna :doc:`contraction-family` användas för att kontrahera problemet.

source: Function's structure
sv: Funktionens struktur
zh_hans: 函数的结构

source: Once the graph preparation work has been done above, it is time to use a
sv: När förberedelserna för grafen har gjorts ovan är det dags att använda en
zh_hans: 完成上述图准备工作后，就可以使用

source: The general form of a pgRouting function call is:
sv: Den allmänna formen för ett pgRouting-funktionsanrop är:
zh_hans: pgRouting 函数调用的一般形式是：

source: `Inner queries`_: Are compulsory parameters that are ``TEXT`` strings containing SQL queries.
sv: `Innerfrågor`_: Är obligatoriska parametrar som är ``TEXT``-strängar som innehåller SQL-frågor.
zh_hans: `Inner queries`_：是强制参数，是包含 SQL 查询的``TEXT``字符串。

source: **parameters**: Additional compulsory parameters needed by the function.
sv: **parametrar**: Ytterligare obligatoriska parametrar som behövs för funktionen.
zh_hans: **parameters**：函数需要的附加强制参数。

source: ``Optional parameters``: Are non compulsory **named** parameters that have a default value when omitted.
sv: ``Optionella parametrar``: Är icke obligatoriska **namngivna** parametrar som har ett standardvärde när de utelämnas.
zh_hans: ``Optional parameters``：是非强制命名参数，省略时具有默认值。

source: The compulsory parameters are positional parameters, the optional parameters are named parameters.
sv: De obligatoriska parametrarna är positionsparametrar och de valfria parametrarna är namnparametrar.
zh_hans: 强制参数是位置参数，可选参数是命名参数。

source: For example, for this :doc:`pgr_dijkstra` signature:
sv: Till exempel, för denna :doc:`pgr_dijkstra` signatur:
zh_hans: 例如，对于这个 :doc:`pgr_dijkstra`签名：

source: Is the first parameter.
sv: Är den första parametern.
zh_hans: 是第一个参数。

source: It is compulsory.
sv: Det är obligatoriskt.
zh_hans: 这是强制性的。

source: It is an inner query.
sv: Det är en inre frågeställning.
zh_hans: 这是一个内部查询。

source: It has no name, so **Edges SQL** gives an idea of what kind of inner query needs to be used
sv: Den har inget namn, så **Edges SQL** ger en uppfattning om vilken typ av inre fråga som måste användas
zh_hans: 它没有名称，因此 **Edges SQL**给出了需要使用哪种内部查询的想法

source: **start vid**:
sv: **starta video**:

source: Is the second parameter.
sv: Är den andra parametern.
zh_hans: 是第二个参数。

source: It has no name, so **start vid** gives an idea of what the second parameter's value should contain.
sv: Den har inget namn, så **start vid** ger en uppfattning om vad den andra parameterns värde ska innehålla.
zh_hans: 它没有名称，因此 **start vid** 给出了第二个参数的值应包含的内容。

source: Is the third parameter.
sv: Är den tredje parametern.
zh_hans: 是第三个参数。

source: It has no name, so **end vid** gives an idea of what the third parameter's value should contain
sv: Den har inget namn, så **slut vid** ger en uppfattning om vad den tredje parameterns värde ska innehålla
zh_hans: 它没有名称，因此 **end vid**给出了第三个参数的值应包含的内容

source: Is the fourth parameter.
sv: Är den fjärde parametern.
zh_hans: 是第四个参数。

source: It is optional.
sv: Det är valfritt.
zh_hans: 是可选的。

source: It has a name.
sv: Den har ett namn.
zh_hans: 它有一个名字。

source: The full description of the parameters are found on the `Parameters`_ section of each function.
sv: En fullständig beskrivning av parametrarna finns i avsnittet `Parametrar`_ för varje funktion.
zh_hans: 参数的完整描述可以在每个函数的 `Parameters`_部分找到。

source: Function's overloads
sv: Funktionens överbelastningar
zh_hans: 函数的重载

source: A function might have different overloads. The most common are called:
sv: En funktion kan ha olika överbelastningar. De vanligaste kallas:
zh_hans: 一个函数可能有不同的重载。 最常见的是：

source: `One to One`_
sv: "En till en
zh_hans: `一对一`_

source: `One to Many`_
sv: "En till många
zh_hans: `一对多`_

source: `Many to One`_
sv: "Många till en
zh_hans: `多对一`_

source: `Many to Many`_
sv: `Många till många`_
zh_hans: `多对多`_

source: `Combinations`_
sv: `Kombinationer`_
zh_hans: `组合`_

source: Depending on the overload the parameters types change.
sv: Beroende på överbelastningen ändras parametertyperna.
zh_hans: 根据过载，参数类型会发生变化。

source: **One**: **ANY-INTEGER**
sv: **Ett**: **ANY-INTEGER**
zh_hans: **一**: **ANY-INTEGER**

source: **Many**: ``ARRAY`` [**ANY-INTEGER**]
sv: **Många**: ``ARRAY`` [**ANY-INTEGER**]
zh_hans: **多**: ``ARRAY`` [**ANY-INTEGER**]

source: Depending of the function the overloads may vary. But the concept of parameter type change remains the same.
sv: Beroende på funktion kan överbelastningarna variera. Men konceptet med ändring av parametertyp förblir detsamma.
zh_hans: 根据函数的不同，重载可能会有所不同。 但参数类型改变的概念保持不变。

source: When routing from:
sv: När du dirigerar från:
zh_hans: 当路由来自：

source: From **one** starting vertex
sv: Från **en** startpunkt
zh_hans: 从**一**起始顶点

source: to **one** ending vertex
sv: till **en** avslutande toppunkt
zh_hans: 到**一**结束顶点

source: to **many** ending vertices
sv: till **många** avslutande hörn
zh_hans: 到**多**结束顶点
