Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Uses the :doc:`pgr_pushRelabel <pgr_pushRelabel>` algorithm.
sv: Använder algoritmen :doc:`pgr_pushRelabel <pgr_pushRelabel>`.
zh_hans: 使用:doc:`pgr_pushRelabel <pgr_pushRelabel>`算法。

source: Running time: :math:`O( V ^ 3)`
sv: Speltid: :math:`O( V ^ 3)`
zh_hans: 运行时间：:math:`O( V ^ 3)`

source: RETURNS ``BIGINT``
sv: RETURNERAR ``BIGINT``

source: Maximum flow possible from the source(s) to the target(s)
sv: Högsta möjliga flöde från källan/källorna till målet/målen
zh_hans: 从 source(s)到 target(s)的可能最大流量

source: `Boost: push relabel max flow <https://www.boost.org/libs/graph/doc/push_relabel_max_flow.html>`__
sv: `Boost: push relabel max flöde <https://www.boost.org/libs/graph/doc/push_relabel_max_flow.html>`__

source: https://en.wikipedia.org/wiki/Push%E2%80%93relabel_maximum_flow_algorithm
sv: https://en.wikipedia.org/wiki/Push%E2%80%93relabel_maximum_flow_algoritm

source: ``pgr_maxFlowMinCost`` - Experimental
sv: ``pgr_maxFlowMinCost`` - Experimentell
zh_hans: ``pgr_maxFlowMinCost`` - 实验

source: ``pgr_maxFlowMinCost`` — Calculates the edges that minimizes the total cost of the maximum flow on a graph
sv: ``pgr_maxFlowMinCost`` - Beräknar de kanter som minimerar den totala kostnaden för det maximala flödet i en graf
zh_hans: ``pgr_maxFlowMinCost`` — 计算图上最大流的总成本最小化的边

source: |boost| graph inside.
sv: |boost| graf inuti.

source: **TODO** check which statement is true:
sv: **TODO** kontrollera vilket påstående som är sant:
zh_hans: **TODO **检查哪个陈述是正确的：

source: The cost value of all input edges must be nonnegative.
sv: Kostnadsvärdet för alla inmatade kanter måste vara icke-negativt.
zh_hans: 所有输入边的成本值必须是非负的。

source: Process is done when the cost value of all input edges is nonnegative.
sv: Processen är klar när kostnadsvärdet för alla inmatade kanter är icke-negativt.
zh_hans: 当所有输入边的成本值为非负时，处理完成。

source: Process is done on edges with nonnegative cost.
sv: Processen görs på kanter med icke-negativ kostnad.
zh_hans: 过程是在具有非负成本的边上完成的。

source: Running time: :math:`O(U * (E + V * logV))`
sv: Drifttid: :math:`O(U * (E + V * logV))`
zh_hans: 运行时间：:math:`O(U * (E + V * logV))`

source: where :math:`U` is the value of the max flow.
sv: där :math:`U` är värdet på maxflödet.
zh_hans: 其中 :math:`U`是最大流量的值。

source: Returns set of |result-flow-mincost|
sv: Returnerar uppsättning av |resultat-flöde-minkostnad|
zh_hans: 返回 |result-flow-mincost| 的集合

source: ``pgr_maxFlowMinCost_Cost`` - Experimental
sv: ``pgr_maxFlowMinCost_Cost`` - Experimentell
zh_hans: ``pgr_maxFlowMinCost_Cost`` - 实验

source: ``pgr_maxFlowMinCost_Cost`` — Calculates the minimum total cost of the maximum flow on a graph
sv: ``pgr_maxFlowMinCost_Cost`` - Beräknar den lägsta totala kostnaden för det maximala flödet i en graf
zh_hans: ``pgr_maxFlowMinCost_Cost`` — 计算图上最大流量的最小总成本

source: **The cost value of all input edges must be nonnegative.**
sv: **Kostnadsvärdet för alla inmatade kanter måste vara icke-negativt
zh_hans: **所有输入边的成本值必须是非负的。**

source: When the maximum flow is 0 then there is no flow and **0** is returned.
sv: När det maximala flödet är 0 finns det inget flöde och **0** returneras.
zh_hans: 当最大流量为0时则没有流量，返回**0**。

source: Uses :doc:`pgr_maxFlowMinCost`.
sv: Använder :doc:`pgr_maxFlowMinCost`.
zh_hans: 使用:doc:`pgr_maxFlowMinCost`。

source: Minimum Cost Maximum Flow possible from the source(s) to the target(s)
sv: Minsta kostnad Högsta möjliga flöde från källa(n) till mål(en)
zh_hans: 从source(s) 到target(s)的最小成本最大流量

source: ``pgr_pickDeliver`` - Experimental
sv: ``pgr_pickDeliver`` - Experimentell
zh_hans: ``pgr_pickDeliver`` - 实验

source: ``pgr_pickDeliver`` - Pickup and delivery Vehicle Routing Problem
sv: ``pgr_pickDeliver`` - Problem med ruttplanering för hämtning och leverans av fordon
zh_hans: ``pgr_pickDeliver`` - 接送车辆路径问题

source: Problem: Distribute and optimize the pickup-delivery pairs into a fleet of vehicles.
sv: Problem: Fördela och optimera upphämtnings- och leveranspar i en fordonsflotta.
zh_hans: 问题：将取货-送货对分配并优化到车队中。

source: Optimization problem is NP-hard.
sv: Optimeringsproblemet är NP-svårt.
zh_hans: 优化问题是NP-hard。

source: pickup and Delivery with time windows.
sv: upphämtning och leverans med tidsfönster.
zh_hans: 有时间窗口的取货和送货。

source: All vehicles are equal.
sv: Alla fordon är likvärdiga.
zh_hans: 所有车辆都是平等的。

source: Same Starting location.
sv: Samma Startplats.
zh_hans: 相同的起始位置。

source: Same Ending location which is the same as Starting location.
sv: Samma slutplacering som är densamma som startplaceringen.
zh_hans: 相同的结束位置与开始位置相同。

source: All vehicles travel at the same speed.
sv: Alla fordon färdas med samma hastighet.
zh_hans: 所有车辆以相同的速度行驶。

source: A customer is for doing a pickup or doing a deliver.
sv: En kund är för att göra en upphämtning eller göra en leverans.
zh_hans: 客户负责提货或送货。

source: has an open time.
sv: har en öppen tid.
zh_hans: 有开放时间。

source: has a closing time.
sv: har en stängningstid.
zh_hans: 有关闭时间。

source: has a service time.
sv: har en servicetid.
zh_hans: 有服务时间。

source: has an (x, y) location.
sv: har en (x, y)-placering.
zh_hans: 具有 (x, y) 位置。

source: There is a customer where to deliver a pickup.
sv: Det finns en kund där man ska leverera en pickup.
zh_hans: 有客户需要送货。

source: travel time between customers is distance / speed
sv: restid mellan kunder är avstånd / hastighet
zh_hans: 客户之间的旅行时间是距离/速度

source: pickup and delivery pair is done with the same vehicle.
sv: hämtning och leverans sker med samma fordon.
zh_hans: 取货和送货是使用同一辆车完成的。

source: All trucks depart at time 0.
sv: Alla lastbilar avgår vid tidpunkt 0.
zh_hans: 所有卡车均在时间 0 出发。

source: the algorithm will raise an exception when
sv: algoritmen kommer att ge upphov till ett undantag när
zh_hans: 该算法将在以下情况下引发异常

source: If there is a pickup-deliver pair than violates time window
sv: Om det finns ett upphämtnings-/leveranspar som bryter mot tidsfönstret
zh_hans: 如果存在违反时间窗口的取货-送货对

source: The speed, max_cycles, ma_capacity have illegal values
sv: Hastigheten, max_cycles, ma_capacity har olagliga värden
zh_hans: speed、max_cycles、ma_capacity 具有非法值

source: Six different initial will be optimized - the best solution found will be result
sv: Sex olika initialer kommer att optimeras - den bästa lösningen som hittas blir resultatet
zh_hans: 将优化六个不同的初始值 - 找到的最佳解决方案将是结果

source: Signature
sv: Underskrift
zh_hans: 标识

source: Returns set of |result-pickdrop|
sv: Returnerar uppsättning av |resultat-pickdrop|
zh_hans: 返回 |result-pickdrop| 的集合

source: Solve the following problem
sv: Lös följande problem
zh_hans: 解决以下问题

source: Given the vehicles:
sv: Med tanke på fordonen:
zh_hans: 给定车辆：

source: and the orders:
sv: och order:
zh_hans: 和顺序：

source: The parameters are:
sv: Parametrarna är:
zh_hans: 参数是：

source: A `SELECT` statement that returns the following columns:
sv: En `SELECT`-sats som returnerar följande kolumner:
zh_hans: 返回以下列的 `SELECT` 语句：

source: id, demand
sv: id, efterfrågan

source: id, capacity
sv: id, kapacitet

source: ``pgr_pickDeliverEuclidean`` - Experimental
sv: ``pgr_pickDeliverEuclidean`` - Experimentell
zh_hans: ``pgr_pickDeliverEuclidean`` - 实验

source: ``pgr_pickDeliverEuclidean`` - Pickup and delivery Vehicle Routing Problem
sv: ``pgr_pickDeliverEuclidean`` - Problem med ruttplanering för hämtning och leverans av fordon
zh_hans: ``pgr_pickDeliverEuclidean`` -取货和送货车辆路径问题

source: Replaces ``pgr_gsoc_vrppdtw``
sv: Ersätter ``pgr_gsoc_vrppdtw``
zh_hans: 替换 ``pgr_gsoc_vrppdtw``

source: Pickup and Delivery:
sv: Upphämtning och leverans:
zh_hans: 取货和送货：

source: capacitated
sv: kapaciterad
zh_hans: 带容量限制的

source: with time windows.
sv: med tidsfönster.
zh_hans: 有时间窗口的。

source: have (x, y) start and ending locations.
sv: har (x, y) start- och slutpositioner.
zh_hans: 有 (x, y) 开始和结束位置。

source: have a start and ending service times.
sv: har en start- och sluttid för tjänsten.
zh_hans: 有开始和结束服务时间。

source: An order is for doing a pickup and a a deliver.
sv: En order är till för att göra en upphämtning och en leverans.
zh_hans: 订单用于取货和送货。

source: has (x, y) pickup and delivery locations.
sv: har (x, y) upphämtnings- och leveransplatser.
zh_hans: 有 (x, y) 个取货和送货地点。

source: has opening and closing times for the pickup and delivery locations.
sv: har öppnings- och stängningstider för upphämtnings- och leveransplatserna.
zh_hans: 有提货和送货地点的开放和关闭时间。

source: has a pickup and deliver service times.
sv: har en upphämtning och leverera servicetider.
zh_hans: 有取货和送货服务时间。

source: Six different optional different initial solutions
sv: Sex olika valfria olika ursprungliga lösningar
zh_hans: 六种不同的可选不同初始解决方案

source: the best solution found will be result
sv: den bästa lösningen som hittas blir resultatet
zh_hans: 找到的最佳解决方案将作为结果

source: This data example **lc101** is from data published at https://www.sintef.no/projectweb/top/pdptw/li-lim-benchmark/
sv: Detta dataexempel **lc101** är hämtat från data som publicerats på https://www.sintef.no/projectweb/top/pdptw/li-lim-benchmark/
zh_hans: 此数据示例 **lc101** 来自 https://www.sintef.no/projectweb/top/pdptw/li-lim-benchmark/ 上发布的数据

source: There are 25 vehicles in the problem all with the same characteristics.
sv: Det finns 25 fordon i problemet som alla har samma egenskaper.

source: The original orders
sv: De ursprungliga beställningarna
zh_hans: 原始订单

source: The data comes in different rows for the pickup and the delivery of the same order.
sv: Uppgifterna kommer i olika rader för upphämtning och leverans av samma order.
zh_hans: 对于同一订单的取货和配送，数据位于不同的行中。

source: The original data needs to be converted to an appropriate table:
sv: Originaldata måste konverteras till en lämplig tabell:

source: The query
sv: Frågeställningen
zh_hans: 查询

source: Showing only the relevant information to compare with the best solution information published on https://www.sintef.no/projectweb/top/pdptw/100-customers/
sv: Visar endast relevant information för att jämföra med informationen om den bästa lösningen som publiceras på https://www.sintef.no/projectweb/top/pdptw/100-customers/
zh_hans: 仅显示相关信息，以便与 https://www.sintef.no/projectweb/top/pdptw/100-customers/ 上发布的最佳解决方案信息进行比较

source: The best solution found for **lc101** is a travel time: 828.94
sv: Den bästa lösningen som hittades för **lc101** är en restid: 828.94
zh_hans: 找到的 **lc101**的最佳解是行程时间：828.94

source: This implementation's travel time: 854.54
sv: Restid för detta genomförande: 854.54
zh_hans: 此实施的行程时间：854.54

source: ``pgr_prim`` — Minimum spanning forest of a graph using Prim's algorithm.
sv: ``pgr_prim`` - Skog med minsta spann i en graf med Prims algoritm.
zh_hans: ``pgr_prim`` — 使用 Prim 算法的图的最小生成森林。

source: This algorithm finds the minimum spanning forest in a possibly disconnected graph using Prim's algorithm.
sv: Denna algoritm hittar den minsta spännviddsskogen i en eventuellt frånkopplad graf med hjälp av Prims algoritm.
zh_hans: 该算法使用 Prim 算法在可能断开的图中找到最小生成森林。

source: Prim's running time: :math:`O(E * log V)`
sv: Prims körtid: :math:`O(E * log V)`
zh_hans: Prim运行时间：:math:`O(E * log V)`

source: Minimum spanning forest of a subgraph
sv: Minsta skog som spänner över en delgraf
zh_hans: 子图的最小生成森林

source: `Boost: Prim's algorithm documentation <https://www.boost.org/libs/graph/doc/prim_minimum_spanning_tree.html>`__
sv: `Boost: Dokumentation av Prims algoritm <https://www.boost.org/libs/graph/doc/prim_minimum_spanning_tree.html>`__
zh_hans: `Boost: Prim算法文档 <https://www.boost.org/libs/graph/doc/prim_minimum_spanning_tree.html>`__

source: ``pgr_primBFS`` — Prim's algorithm for Minimum Spanning Tree with Depth First Search ordering.
sv: ``pgr_primBFS`` - Prims algoritm för minsta spännviddsträd med djup först-sökordning.
zh_hans: ``pgr_primBFS`` — Prim 的深度优先搜索排序最小生成树算法。

source: Visits and extracts the nodes information in Breath First Search ordering of the Minimum Spanning Tree created using Prims's algorithm.
sv: Besöker och extraherar nodinformationen i Breath First Search-ordningen i det minsta spännviddsträdet som skapats med Prims algoritm.

source: ``pgr_primDD`` — Catchament nodes using Prim's algorithm.
sv: ``pgr_primDD`` - Fångar upp noder med Prims algoritm.
zh_hans: ``pgr_primDD`` — 使用 Prim 算法的集水区节点。

source: Using Prim's algorithm, extracts the nodes that have aggregate costs less than or equal to a distance from a root vertex (or vertices) within the calculated minimum spanning tree.
sv: Med hjälp av Prims algoritm, extrahera de noder som har aggregerade kostnader som är mindre än eller lika med ett avstånd från en rotvertex (eller vertex) inom det beräknade minsta spännträd.

source: ``pgr_primDFS`` — Prim algorithm for Minimum Spanning Tree with Depth First Search ordering.
sv: ``pgr_primDFS`` - Prim-algoritm för minsta spännviddsträd med djup först-sökordning.
zh_hans: ``pgr_primDFS`` — 具有深度优先搜索排序的最小生成树的 Prim 算法。

source: Visits and extracts the nodes information in Depth First Search ordering of the Minimum Spanning Tree created using Prims's algorithm.
sv: Besöker och extraherar nodernas information i Depth First Search-ordningen för det minsta spännviddsträdet som skapats med Prims algoritm.
zh_hans: 访问并提取使用 Prims 算法创建的最小生成树的深度优先搜索顺序中的节点信息。

source: ``pgr_pushRelabel`` — Calculates the flow on the graph edges that maximizes the flow from the sources to the targets using Push Relabel Algorithm.
sv: ``pgr_pushRelabel`` - Beräknar flödet på grafens kanter som maximerar flödet från källorna till målen med hjälp av Push Relabel-algoritmen.
zh_hans: ``pgr_pushRelabel`` — 使用 Push Relabel 算法计算图边上的流量，以最大化从源到目标的流量。

source: Renamed from ``pgr_maxFlowPushRelabel``
sv: Borttagen från ``pgr_maxFlowPushRelabel``
zh_hans: 由 ``pgr_maxFlowPushRelabel`` 重命名

source: ``pgr_separateCrossing``
sv: ``pgr_separeraKorsning``

source: ``pgr_separateCrossing`` - From crossing geometries generates geometries that do not cross.
sv: ``pgr_separateCrossing`` - Från korsande geometrier genereras geometrier som inte korsar varandra.

source: Proposed function.
sv: Föreslagen funktion.

source: This is an auxiliary function for separating crossing edges.
sv: Detta är en hjälpfunktion för att separera korsande kanter.

source: RETURNS |result-separate|
sv: RETURNS |resultat-separat|

source: Get the segments of the crossing geometries
sv: Hämta segmenten för korsningsgeometrierna

source: ``tolerance``
sv: "Tolerans

source: Used in ST_Snap before ST_Split
sv: Används i ST_Snap före ST_Split

source: Get the code for further refinement.
sv: Hämta koden för ytterligare förfining.

source: When there are special details that need to be taken care of because of the final application or the quality of the data, the code can be obtained On a PostgreSQL ``NOTICE`` using the ``dryrun`` flag.
sv: När det finns speciella detaljer som måste tas om hand på grund av den slutliga applikationen eller datakvaliteten kan koden erhållas på en PostgreSQL ``NOTICE`` med hjälp av ``dryrun`` flaggan.

source: ``pgr_separateTouching`` - From touching geometries generates geometries that are properly connected at endpoints
sv: ``pgr_separateTouching`` - Från berörande geometrier genereras geometrier som är korrekt anslutna vid ändpunkterna

source: This is an auxiliary function for processing geometries that touch but don't share exact endpoints, splitting them at their intersection points to improve network connectivity.
sv: Detta är en hjälpfunktion för bearbetning av geometrier som berör varandra men inte har exakta ändpunkter, och som delas upp vid sina skärningspunkter för att förbättra nätverksanslutningen.

source: ``pgr_sequentialVertexColoring`` - Proposed
sv: ```pgr_sequentialVertexColoring`` - Föreslagen

source: ``pgr_sequentialVertexColoring`` — Returns the vertex coloring of an undirected graph, using greedy approach.
sv: ``pgr_sequentialVertexColoring`` - Returnerar vertexfärgningen av en odelad graf med hjälp av en girig metod.
zh_hans: ``pgr_sequentialVertexColoring`` — 使用贪婪方法返回无向图的顶点着色。

source: Sequential vertex coloring algorithm is a graph coloring algorithm in which color identifiers are assigned to the vertices of a graph in a sequential manner, such that no edge connects two identically colored vertices.
sv: Sequential vertex coloring algorithm är en algoritm för färgläggning av grafer där färgidentifierare tilldelas topparna i en graf sekventiellt, så att ingen kant förbinder två identiskt färgade toppar.
zh_hans: 顺序顶点着色算法是一种图着色算法，其中颜色标识符以顺序方式分配给图的顶点，使得没有边连接两个相同颜色的顶点。

source: The implementation is applicable only for **undirected** graphs.
sv: Implementeringen är endast tillämplig för **undirected** grafer.
zh_hans: 该实现仅适用于**无向**图。

source: Provides the color to be assigned to all the vertices present in the graph.
sv: Ger den färg som ska tilldelas alla hörn som finns i grafen.
zh_hans: 提供要分配给图中存在的所有顶点的颜色。

source: Color identifiers values are in the Range :math:`[1, |V|]`
sv: Värden för färgidentifierare ligger i intervallet :math:`[1, |V|]`
zh_hans: 颜色标识符值在范围 :math:`[1, |V|]`内

source: The algorithm tries to assign the least possible color to every vertex.
sv: Algoritmen försöker tilldela minsta möjliga färg till varje toppunkt.
zh_hans: 该算法尝试为每个顶点分配尽可能少的颜色。

source: Efficient graph coloring is an NP-Hard problem, and therefore, this algorithm does not always produce optimal coloring. It follows a greedy strategy by iterating through all the vertices sequentially, and assigning the smallest possible color that is not used by its neighbors, to each vertex.
sv: Effektiv färgläggning av grafer är ett NP-hårt problem, och därför ger den här algoritmen inte alltid optimal färgläggning. Den följer en girig strategi genom att iterera genom alla toppar i följd och tilldela varje topp den minsta möjliga färg som inte används av dess grannar.
zh_hans: 高效的图着色是一个 NP 困难问题，因此，该算法并不总是产生最佳着色。 它遵循贪婪策略，依次迭代所有顶点，并将其邻居未使用的最小可能颜色分配给每个顶点。

source: The returned rows are ordered in ascending order of the vertex value.
sv: De återlämnade raderna är ordnade i stigande ordning efter vertexvärdet.
zh_hans: 返回的行按顶点值的升序排列。

source: Sequential Vertex Coloring Running Time: :math:`O(|V|*(d + k))`
sv: Sekventiell vertexfärgning Körtid: :math:`O(|V|*(d + k))`
zh_hans: 顺序顶点着色运行时间：:math:`O(|V|*(d + k))`

source: `Boost: Sequential Vertex Coloring <https://www.boost.org/libs/graph/doc/sequential_vertex_coloring.html>`__
sv: `Boost: Sekventiell färgläggning av toppar <https://www.boost.org/libs/graph/doc/sequential_vertex_coloring.html>`__

source: ``pgr_stoerWagner`` - Experimental
sv: ``pgr_stoerWagner`` - Experimentell

source: ``pgr_stoerWagner`` — The min-cut of graph using stoerWagner algorithm.
sv: ``pgr_stoerWagner`` - Min-cut av grafen med stoerWagner-algoritmen.
zh_hans: ``pgr_stoerWagner`` — 使用 stoerWagner 算法对图进行最小分割。

source: In graph theory, the Stoer–Wagner algorithm is a recursive algorithm to solve the minimum cut problem in undirected weighted graphs with non-negative weights. The essential idea of this algorithm is to shrink the graph by merging the most intensive vertices, until the graph only contains two combined vertex sets. At each phase, the algorithm finds the minimum s-t cut for two vertices s and t chosen as its will. Then the algorithm shrinks the edge between s and t to search for non s-t cuts. The minimum cut found in all phases will be the minimum weighted cut of the graph.
sv: Inom grafteorin är Stoer-Wagner-algoritmen en rekursiv algoritm för att lösa problemet med minsta snitt i ovägda viktade grafer med icke-negativa vikter. Den grundläggande idén med denna algoritm är att krympa grafen genom att slå samman de mest intensiva topparna, tills grafen bara innehåller två kombinerade toppuppsättningar. I varje fas hittar algoritmen det minsta s-t-snittet för två toppar s och t som valts som dess vilja. Därefter krymper algoritmen kanten mellan s och t för att söka efter andra snitt än s-t-snitt. Det minsta snitt som hittas i alla faser kommer att vara det minsta viktade snittet i grafen.
zh_hans: 在图论中，Stoer-Wagner 算法是一种递归算法，用于解决具有非负权重的无向带权图中的最小割问题。 该算法的基本思想是通过合并最密集的顶点来收缩图，直到图仅包含两个组合的顶点集。 在每个阶段，算法都会找到任意选择的两个顶点 s 和 t 的最小 s-t 割。 然后算法缩小 s 和 t 之间的缘以搜索非 s-t 切割。 在所有阶段中找到的最小割将是图的最小加权割。

source: A cut is a partition of the vertices of a graph into two disjoint subsets. A minimum cut is a cut for which the size or weight of the cut is not larger than the size of any other cut. For an unweighted graph, the minimum cut would simply be the cut with the least edges. For a weighted graph, the sum of all edges' weight on the cut determines whether it is a minimum cut.
sv: Ett snitt är en uppdelning av hörnen i en graf i två disjunkta delmängder. En minsta skärning är en skärning där skärningens storlek eller vikt inte är större än storleken på någon annan skärning. För en oviktad graf skulle det minsta snittet helt enkelt vara det snitt som har minst kanter. För en viktad graf är det summan av alla kanters vikt på snittet som avgör om det är ett minimisnitt.
zh_hans: 割是将图的顶点划分为两个不相交的子集。 最小切割是指切割的尺寸或重量不大于任何其他切割的尺寸的切割。 对于未加权的图，最小割只是具有最少边的割。 对于加权图，割线上所有边的权重之和决定了它是否是最小割。

source: Sum of the weights of all edges between the two sets is mincut.
sv: Summan av vikterna för alla kanter mellan de två uppsättningarna är mincut.
zh_hans: 两组之间所有边的权重之和是最小割。

source: A **mincut** is a cut having the least weight.
sv: Ett **mincut** är ett snitt som har minst vikt.
zh_hans: **最小切割**是重量最小的切割。

source: Values are returned when graph is connected.
sv: Värdena returneras när grafen är ansluten.
zh_hans: 连接图形时返回值。

source: When there is no edge in graph then EMPTY SET is return.
sv: När det inte finns någon kant i grafen returneras EMPTY SET.
zh_hans: 当图中没有边时，则返回 EMPTY SET。

source: When the graph is unconnected then EMPTY SET is return.
sv: När grafen inte är sammankopplad returneras EMPTY SET.
zh_hans: 当图形未连接时，则返回 EMPTY SET。

source: Sometimes a graph has multiple min-cuts, but all have the same weight. The this function determines exactly one of the min-cuts as well as its weight.
sv: Ibland har en graf flera min-cuts, men alla har samma vikt. Den här funktionen bestämmer exakt en av min-cuts samt dess vikt.
zh_hans: 有时一个图有多个最小割，但都具有相同的权重。 该函数准确地确定最小切割之一及其权重。

source: Running time: :math:`O(V*E + V^2*log V)`.
sv: Drifttid: :math:`O(V*E + V^2*log V)`.
zh_hans: 运行时间： :math:`O(V*E + V^2*log V)`。

source: Returns set of |result-mincut|
sv: Returnerar uppsättning av |resultat-mincut|
zh_hans: 返回|result-mincut|的集合

source: min cut of the main subgraph
sv: min-klippning av huvudundergrafen
zh_hans: 主子图的最小割

source: Returns set of ``(seq, edge, cost, mincut)``
sv: Returnerar uppsättning av ``(seq, edge, cost, mincut)``
zh_hans: 返回集合``(seq, edge, cost, mincut)``

source: Edges which divides the set of vertices into two.
sv: Kanter som delar upp uppsättningen av hörn i två.
zh_hans: 将顶点集一分为二的边。

source: Cost to traverse of edge.
sv: Kostnad för att korsa kanten.
zh_hans: 遍历边的成本。

source: Min-cut weight of a undirected graph.
sv: Min-cut-vikt för en odränerad graf.
zh_hans: 无向图的最小割权。

source: Additional Example:
sv: Ytterligare exempel:
zh_hans: 附加示例：

source: min cut of an edge
sv: minutskärning av en kant
zh_hans: 边的最小割

source: Using :doc:`pgr_connectedComponents`
sv: Använda :doc:`pgr_connectedComponents`
zh_hans: 使用:doc:`pgr_connectedComponents`

source: https://en.wikipedia.org/wiki/Stoer%E2%80%93Wagner_algorithm
sv: https://en.wikipedia.org/wiki/Stoer%E2%80%93Wagner_algoritm

source: ``pgr_strongComponents`` — Strongly connected components of a directed graph using Tarjan's algorithm based on DFS.
sv: ``pgr_strongComponents`` - Starkt förbundna komponenter i en riktad graf med hjälp av Tarjans algoritm baserad på DFS.
zh_hans: ``pgr_strongComponents`` — 使用基于 DFS 的 Tarjan 算法构建有向图的强连通分量。

source: A strongly connected component of a directed graph is a set of vertices that are all reachable from each other.
sv: En starkt sammanhängande komponent i en riktad graf är en uppsättning hörn som alla är nåbara från varandra.
zh_hans: 有向图的强连接组件是一组彼此可达的顶点。
