Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: first by ``start_vid`` (if exists)
sv: först av ``start_vid`` (om sådan finns)
zh_hans: 首先按``start_vid``（如果存在）

source: then by ``end_vid``
sv: sedan genom ``slut_vid``
zh_hans: 然后按``end_vid``

source: Values are returned when there is a path.
sv: Värden returneras när det finns en sökväg.
zh_hans: 当存在路径时返回值。

source: Let :math:`v` and :math:`u` be nodes on the graph:
sv: Låt :math:`v` och :math:`u` vara noder i grafen:
zh_hans: 设 :math:`v` 和 :math:`u` 为图上的节点：

source: If there is no path from :math:`v` to :math:`u`:
sv: Om det inte finns någon sökväg från :math:`v` till :math:`u`:
zh_hans: 如果没有从:math:`v` 到 :math:`u`的路径：

source: no corresponding row is returned
sv: ingen motsvarande rad returneras
zh_hans: 没有返回对应的行

source: ``agg_cost`` from :math:`v` to :math:`u` is :math:`\infty`
sv: ``agg_cost`` från :math:`v` till :math:`u` är :math:``infty``
zh_hans: 从:math:`v`到:math:`u`的``agg_cost`` 是 :math:`\infty`

source: There is no path when :math:`v = u` therefore
sv: Det finns ingen väg när :math:`v = u` därför
zh_hans: 当:math:`v = u`没有路径，因此

source: ``agg_cost`` from `v` to `u` is :math:`0`
sv: ``agg_cost`` från `v` till `u`` är :math:`0``
zh_hans: 从`v`到`u`的``agg_cost``是:math:`0`

source: When :math:`(x,y)` coordinates for the same vertex identifier differ:
sv: När :math:`(x,y)`-koordinaterna för samma toppunktsidentifierare skiljer sig åt:
zh_hans: 当同一顶点标识符的:math:`(x,y)` 坐标不同时：

source: A random selection of the vertex's :math:`(x,y)` coordinates is used.
sv: Ett slumpmässigt urval av toppunktens :math:`(x,y)`-koordinater används.
zh_hans: 使用随机选择的顶点的:math:`(x,y)`坐标。

source: Running time: :math:`O((E + V) * \log V)`
sv: Drifttid: :math:`O((E + V) * \log V)`
zh_hans: 运行时间：:math:`O((E + V) * \log V)`

source: aStar optional parameters
sv: aStar valfria parametrar
zh_hans: aStar 可选参数

source: ``heuristic``
sv: ``heuristisk``

source: Heuristic number. Current valid values 0~5.
sv: Heuristiskt nummer. Aktuella giltiga värden 0~5.
zh_hans: Heuristic 数字。当前有效值0~5。

source: 0: :math:`h(v) = 0` (Use this value to compare with pgr_dijkstra)
sv: 0: :math:`h(v) = 0` (Använd detta värde för att jämföra med pgr_dijkstra)
zh_hans: 0: :math:`h(v) = 0` (使用该值与 pgr_dijkstra 进行比较)

source: For units manipulation. :math:`factor > 0`.
sv: För manipulering av enheter. :math:`factor > 0`.
zh_hans: 对于单位操作。:math:`factor > 0`。

source: For less restricted results. :math:`epsilon >= 1`.
sv: För mindre begränsade resultat. :math:`epsilon >= 1`.
zh_hans: 对于限制较少的结果。:math:`epsilon >= 1`。

source: See :ref:`heuristics <astar_heuristics>` available and :ref:`factor <astar_factor>` handling.
sv: Se :ref:`heuristics <astar_heuristics>` tillgänglig och :ref:`factor <astar_factor>` hantering.
zh_hans: 查看可用的:ref:`heuristics <astar_heuristics>`和:ref:`factor <astar_factor>`处理。

source: Advanced documentation
sv: Avancerad dokumentation
zh_hans: 高级文档

source: Heuristic
sv: Heuristisk

source: Currently the heuristic functions available are:
sv: För närvarande är de tillgängliga heuristiska funktionerna:
zh_hans: 目前可用的heuristic函数有：

source: where :math:`\Delta x = x_1 - x_0` and :math:`\Delta y = y_1 - y_0`
sv: där :math:`\Delta x = x_1 - x_0` och :math:`\Delta y = y_1 - y_0`
zh_hans: 其中 :math:`\Delta x = x_1 - x_0`和:math:`\Delta y = y_1 - y_0`

source: Analysis 1
sv: Analys 1
zh_hans: 分析1

source: Working with cost/reverse_cost as length in degrees, x/y in lat/lon: Factor = 1 (no need to change units)
sv: Arbetar med kostnad/omvänd_kostnad som längd i grader, x/y i lat/lon: Faktor = 1 (inget behov av att ändra enheter)
zh_hans: 使用 cost/reverse_cost 作为长度（以度为单位），x/y 以纬度/经度为单位：因子 = 1（无需更改单位）

source: Analysis 2
sv: Analys 2
zh_hans: 分析2

source: Working with cost/reverse_cost as length in meters, x/y in lat/lon: Factor = would depend on the location of the points:
sv: Arbetar med kostnad/omvänd_kostnad som längd i meter, x/y i lat/lon: Faktor = skulle bero på punkternas läge:
zh_hans: 使用 cost/reverse_cost 作为以米为单位的长度，以纬度/经度为单位的 x/y： Factor = 将取决于点的位置：

source: 1 longitude degree is 78846.81 m
sv: 1 longitudgrad är 78846,81 m
zh_hans: 1 经度为 78846.81 米

source: 1 longitude degree is 111319.46 m
sv: 1 longitudgrad är 111319,46 m
zh_hans: 1经度为111319.46 m

source: Analysis 3
sv: Analys 3
zh_hans: 分析3

source: Working with cost/reverse_cost as time in seconds, x/y in lat/lon: Factor: would depend on the location of the points and on the average speed say 25m/s is the speed.
sv: Arbetar med kostnad/omvänd_kostnad som tid i sekunder, x/y i lat/lon: Faktor: skulle bero på punkternas läge och på medelhastigheten, säg att 25 m/s är hastigheten.
zh_hans: 使用 cost/reverse_cost 作为以秒为单位的时间，以 lat/lon 为单位的 x/y： 因子：取决于点的位置和平均速度，例如 25m/s 是速度。

source: `Boost: A* search <https://www.boost.org/libs/graph/doc/astar_search.html>`__
sv: `Boost: A*-sökning <https://www.boost.org/libs/graph/doc/astar_search.html>`__

source: https://en.wikipedia.org/wiki/A*_search_algorithm
sv: https://en.wikipedia.org/wiki/A*_search_algoritm

source: All Pairs - Family of Functions
sv: Alla par - Familj av funktioner
zh_hans: All Pairs - 函数族

source: The following functions work on all vertices pair combinations
sv: Följande funktioner fungerar på alla kombinationer av toppar och par
zh_hans: 以下函数适用于所有顶点对组合

source: The main characteristics are:
sv: De viktigaste egenskaperna är:
zh_hans: 主要特点是：

source: It does not return a path.
sv: Den returnerar inte någon sökväg.
zh_hans: 它不返回路径。

source: Returns the sum of the costs of the shortest path for each pair of nodes in the graph.
sv: Returnerar summan av kostnaderna för den kortaste vägen för varje par av noder i grafen.
zh_hans: 返回图中每对节点的最短路径成本之和。

source: Boost returns a :math:`V \times V` matrix, where the infinity values. Represent the distance between vertices for which there is no path.
sv: Boost returnerar en :math:`V \times V`-matris, där oändlighetsvärdena. Representerar avståndet mellan hörnpunkter för vilka det inte finns någon väg.
zh_hans: Boost 返回一个:math:`V \times V`矩阵，其中无穷大值。 表示没有路径的顶点之间的距离。

source: We return only the non infinity values in form of a set of `(start_vid, end_vid, agg_cost)`.
sv: Vi returnerar endast de värden som inte är oändliga i form av en uppsättning `(start_vid, end_vid, agg_cost)`.
zh_hans: 我们仅以一组 `(start_vid, end_vid, agg_cost)` 的形式返回非无穷大值。

source: Let be the case the values returned are stored in a table, so the unique index would be the pair: `(start_vid, end_vid)`.
sv: Låt oss anta att de värden som returneras lagras i en tabell, så det unika indexet skulle vara paret: `(start_vid, end_vid)`.
zh_hans: 假设返回的值存储在表中，因此唯一索引将是一对：`(start_vid, end_vid)`。

source: For the undirected graph, the results are symmetric.
sv: För den oriktade grafen är resultaten symmetriska.
zh_hans: 对于无向图，结果是对称的。

source: The `agg_cost` of `(u, v)` is the same as for `(v, u)`.
sv: Agg_cost för `(u, v)` är samma som för `(v, u)`.
zh_hans: `(u, v)` 的 `agg_cost` 与 `(v, u)`相同。

source: When `start_vid` = `end_vid`, the `agg_cost` = 0.
sv: När `start_vid` = `slut_vid` är `agg_cost` = 0.
zh_hans: 当`start_vid` = `end_vid`时，`agg_cost`= 0。

source: **Recommended, use a bounding box of no more than 3500 edges.**
sv: **Rekommendation: använd en avgränsande box med högst 3500 kanter
zh_hans: **建议使用不超过 3500 条边的边界框。**

source: Optional parameters
sv: Valfria parametrar
zh_hans: 可选参数

source: ``directed``
sv: ``riktad``

source: When ``true`` the graph is considered `Directed`
sv: När ``true`` anses grafen vara `Directed``
zh_hans: 当 ``true``时，该图被视为有`有向`

source: When ``false`` the graph is considered as `Undirected`.
sv: När den är ``falsk`` betraktas grafen som `Ondirected``.
zh_hans: 如果为 ``false``，则该图被视为 `无向`。

source: Performance
sv: Prestanda
zh_hans: 表现

source: The following tests:
sv: Följande tester:
zh_hans: 以下测试：

source: non server computer
sv: dator som inte är en server
zh_hans: 非服务式计算机

source: with AMD 64 CPU
sv: med AMD 64 CPU
zh_hans: 配备 AMD 64 CPU

source: 4G memory
sv: 4G-minne
zh_hans: 4G内存

source: trusty
sv: pålitlig
zh_hans: 可靠

source: The following data was used
sv: Följande uppgifter användes
zh_hans: 使用了以下数据

source: Data processing was done with osm2pgrouting-alpha
sv: Databehandling gjordes med osm2pgrouting-alpha
zh_hans: 数据处理是使用 osm2pgrouting-alpha 完成的

source: Results
sv: Resultat
zh_hans: 结果

source: One
sv: En
zh_hans: 一

source: This test is not with a bounding box The density of the passed graph is extremely low. For each <SIZE> 30 tests were executed to get the average The tested query is:
sv: Detta test är inte med en bounding box Densiteten i den godkända grafen är extremt låg. För varje <SIZE> utfördes 30 tester för att få fram genomsnittet Den testade frågan är:
zh_hans: 该测试没有使用边界框，通过的图形密度极低。 对于每个 <SIZE> 执行 30 次测试以获得平均值， 测试的查询是：

source: The results of this tests are presented as:
sv: Resultaten av dessa tester presenteras enligt följande:
zh_hans: 该测试的结果如下：

source: SIZE
sv: STRL

source: is the number of edges given as input.
sv: är antalet kanter som anges som indata.
zh_hans: 是作为输入给出的边数。

source: is the total number of records in the query.
sv: är det totala antalet poster i sökningen.
zh_hans: 是查询中的记录总数。

source: DENSITY
sv: DENSITET

source: is the density of the data :math:`\dfrac{E}{V \times (V-1)}`.
sv: är densiteten för data :math:`\dfrac{E}{V \times (V-1)}`.
zh_hans: 是数据:math:`\dfrac{E}{V \times (V-1)}`的密度。

source: OUT ROWS
sv: UT RÄDER

source: is the number of records returned by the queries.
sv: är antalet poster som returneras av sökningarna.
zh_hans: 是查询返回的记录数。

source: is the average execution time in seconds of pgr_floydWarshall.
sv: är den genomsnittliga exekveringstiden i sekunder för pgr_floydWarshall.
zh_hans: 是 pgr_floydWarshall 的平均执行时间（以秒为单位）。

source: is the average execution time in seconds of pgr_johnson.
sv: är den genomsnittliga exekveringstiden i sekunder för pgr_johnson.
zh_hans: 是 pgr_johnson 的平均执行时间（以秒为单位）。

source: Two
sv: Två
zh_hans: 二

source: This test is with a bounding box The density of the passed graph higher than of the Test One. For each <SIZE> 30 tests were executed to get the average The tested edge query is:
sv: Detta test är med en avgränsande box Densiteten i den godkända grafen högre än i test ett. För varje <SIZE> utfördes 30 tester för att få fram genomsnittet Den testade kantfrågan är:
zh_hans: 该测试带有边界框。通过的图形的密度高于测试一的密度。 对于每个 <SIZE> 执行 30 次测试以获得平均值，测试的边缘查询为：

source: The tested queries
sv: De testade frågorna
zh_hans: 测试的查询

source: is the size of the bounding box.
sv: är storleken på den avgränsande rutan.
zh_hans: 是边界框的大小。

source: Bidirectional A* - Family of functions
sv: Dubbelriktad A* - Familj av funktioner
zh_hans: 双向A* - 函数族

source: The bidirectional A* (pronounced "A Star") algorithm is based on the A* algorithm.
sv: Den dubbelriktade algoritmen A* (uttalas "A Star") är baserad på A*-algoritmen.
zh_hans: 双向A*（发音为"A星"）算法基于A*算法。

source: Based on A* algorithm, the bidirectional search finds a shortest path from a starting vertex (``start_vid``) to an ending vertex (``end_vid``). It runs two simultaneous searches: one forward from the ``start_vid``, and one backward from the ``end_vid``, stopping when the two meet in the middle. This implementation can be used with a directed graph and an undirected graph.
sv: Baserat på A*-algoritmen hittar den dubbelriktade sökningen den kortaste vägen från ett startvertex (``start_vid``) till ett slutvertex (``end_vid``). Den kör två samtidiga sökningar: en framåt från ``start_vid`` och en bakåt från ``slut_vid``, och stannar när de två möts i mitten. Den här implementationen kan användas med en riktad graf och en oriktad graf.
zh_hans: 基于A*算法，双向搜索找到从起始顶点(``start_vid``)到结束顶点(``end_vid``)的最短路径。 它同时运行两项搜索：一项从 ``start_vid`` 向前搜索，一项从 ``end_vid``向后搜索，当两者在中间相遇时停止。 该实现可以与有向图和无向图一起使用。

source: For large graphs where there is a path bewtween the starting vertex and ending vertex:
sv: För stora grafer där det finns en väg mellan start- och slutvertexen:
zh_hans: 对于起始顶点和结束顶点之间存在路径的大型图:

source: It is expected to terminate faster than pgr_aStar
sv: Den förväntas avslutas snabbare än pgr_aStar

source: Bidirectional Dijkstra - Family of functions
sv: Dubbelriktad Dijkstra - Familj av funktioner
zh_hans: 双向 Dijkstra - 函数族

source: Synopsis
sv: Sammanfattning
zh_hans: 概要

source: Based on Dijkstra's algorithm, the bidirectional search finds a shortest path a starting vertex to an ending vertex.
sv: Baserat på Dijkstras algoritm hittar den dubbelriktade sökningen den kortaste vägen från en startpunkt till en slutpunkt.
zh_hans: 基于 Dijkstra 算法，双向搜索找到起始顶点到结束顶点的最短路径。

source: It runs two simultaneous searches: one forward from the source, and one backward from the target, stopping when the two meet in the middle.
sv: Den kör två samtidiga sökningar: en framåt från källan och en bakåt från målet, och stannar när de två möts i mitten.
zh_hans: 它同时运行两项搜索：一项从源向前搜索，一项从目标向后搜索，当两者在中间相遇时停止。

source: This implementation can be used with a directed graph and an undirected graph.
sv: Denna implementation kan användas med en riktad graf och en oriktad graf.
zh_hans: 该实现可以与有向图和无向图一起使用。

source: A negative value on a cost column is interpreted as the edge does not exist.
sv: Ett negativt värde i en kostnadskolumn tolkas som att kanten inte existerar.
zh_hans: 成本列上的负值被解释为边不存在。

source: When there is no path:
sv: När det inte finns någon väg:
zh_hans: 当没有路径时：

source: When the starting vertex and ending vertex are the same.
sv: När startvertex och slutvertex är desamma.
zh_hans: 当起始顶点和结束顶点相同时。

source: The **aggregate cost** of the non included values :math:`(v, v)` is :math:`0`
sv: Den **samlade kostnaden** för de icke inkluderade värdena :math:`(v, v)` är :math:`0`
zh_hans: 未包含值:math:`(v, v)`的**aggregate cost**为:math:`0`

source: When the starting vertex and ending vertex are the different and there is no path:
sv: När startvertex och slutvertex är olika och det inte finns någon väg:
zh_hans: 当起始顶点和结束顶点不同且不存在路径时：

source: The **aggregate cost** the non included values :math:`(u, v)` is :math:`\infty`
sv: Den **samlade kostnaden** för de icke inkluderade värdena :math:`(u, v)` är :math:`\infty`
zh_hans: 未包含值:math:`(u, v)`的**aggregate cost**是:math:`\infty`

source: For optimization purposes, any duplicated value in the starting vertices or on the ending vertices are ignored.
sv: För optimeringsändamål ignoreras alla duplicerade värden i startpunkterna eller på slutpunkterna.
zh_hans: 出于优化目的，起始顶点或结束顶点中的任何重复值都将被忽略。

source: Running time (worse case scenario): :math:`O((V \log V + E))`
sv: Körtid (värsta tänkbara scenario): :math:`O((V \log V + E))`
zh_hans: 运行时间（最坏情况）：:math:`O((V \log V + E))`

source: It is expected to terminate faster than pgr_dijkstra
sv: Det förväntas avslutas snabbare än pgr_dijkstra
zh_hans: 预计终止速度比 pgr_dijkstra 更快

source: Chinese Postman Problem - Family of functions (Experimental)
sv: Problem med kinesisk brevbärare - Familj av funktioner (Experimentell)
zh_hans: 中国邮递员问题 - 函数族（实验）

source: **The main characteristics are:**
sv: **De viktigaste egenskaperna är:**
zh_hans: **主要特点是：**

source: Process is done only on edges with **positive** costs.
sv: Processen utförs endast på kanter med **positiva** kostnader.
zh_hans: 仅在具有**正**成本的边缘进行处理。

source: Running time: :math:`O(E * (E + V * logV))`
sv: Drifttid: :math:`O(E * (E + V * logV))`
zh_hans: 运行时间：:math:`O(E * (E + V * logV))`

source: Graph must be connected.
sv: Grafen måste vara ansluten.
zh_hans: 图必须是连通的。

source: An Edges SQL that represents a **directed** graph with the following columns
sv: En Edges SQL som representerar en **riktad** graf med följande kolumner
zh_hans: 表示具有以下列的有向图的 Edges SQL

source: Coloring - Family of functions
sv: Färgläggning - Familj av funktioner
zh_hans: 着色 - 函数族

source: Returns set of |result_edge_color|
sv: Returnerar uppsättning av |result_edge_color|

source: ``color``
sv: ``färg``

source: Color of the edge.
sv: Färg på kanten.

source: The minimum value of color is 1.
sv: Det minsta värdet för färg är 1.
zh_hans: 颜色的最小值为 1。

source: Returns set of |result_node_color|
sv: Returnerar uppsättning av |result_node_color|

source: Identifier of the node.
sv: Identifierare för noden.

source: Color of the node.
sv: Färg på noden.

source: Components - Family of functions
sv: Komponenter - Familj av funktioner
zh_hans: 分量 - 函数族

source: Contraction - Family of functions
sv: Sammandragning - Familj av funktioner
zh_hans: 收缩 - 函数族

source: In large graphs, like road graphs or electric networks, graph contraction can be used to speed up some graph algorithms. Contraction can reduce the size of the graph by removing some of the vertices and edges and adding edges that represent a sequence of original edges (the original ones can be kept in some methods). In this way, it decreases the total time and space used by graph algorithms, particularly those searching for an optimal path.
sv: I stora grafer, t.ex. väggrafer eller elnät, kan grafkontraktion användas för att snabba upp vissa grafalgoritmer. Kontraktion kan minska storleken på grafen genom att ta bort några av topparna och kanterna och lägga till kanter som representerar en sekvens av ursprungliga kanter (de ursprungliga kanterna kan behållas i vissa metoder). På så sätt minskar den totala tiden och utrymmet som används av grafalgoritmer, särskilt de som söker efter en optimal väg.

source: This implementation gives a flexible framework for adding contraction algorithms in the future. Currently, it supports three algorithms.
sv: Denna implementering ger ett flexibelt ramverk för att lägga till sammandragningsalgoritmer i framtiden. För närvarande stöder den tre algoritmer.

source: Dead end contraction
sv: Kontraktion i återvändsgränd
zh_hans: 死端收缩

source: Linear contraction
sv: Linjär sammandragning
zh_hans: 线性收缩

source: Contraction hierarchies
sv: Sammandragningshierarkier

source: The two first ones can be combined through a iterative procedure, via the ``pgr_contraction`` method. The third one is implemented on its own.
sv: De två första kan kombineras genom ett iterativt förfarande, via metoden ``pgr_contraction``. Den tredje är implementerad på egen hand.

source: All functions allow the user to forbid contraction on a set of nodes.
sv: Alla funktioner gör det möjligt för användaren att förbjuda sammandragning på en uppsättning noder.

source: Cost - Category
sv: Kostnad - Kategori
zh_hans: 成本 - 类别

source: Each function works as part of the family it belongs to.
sv: Varje funktion fungerar som en del av den familj den tillhör.
zh_hans: 每个函数都是其所属家族的一部分。

source: Returns the sum of the costs of the shortest path of each pair combination of nodes requested.
sv: Returnerar summan av kostnaderna för den kortaste vägen för varje begärd parkombination av noder.
zh_hans: 返回所请求的每对节点组合的最短路径的成本总和。

source: Let be the case the values returned are stored in a table, so the unique index would be the pair: ``(start_vid, end_vid)``.
sv: Låt oss anta att de värden som returneras lagras i en tabell, så det unika indexet skulle vara paret: ``(start_vid, end_vid)``.
zh_hans: 假设返回的值存储在表中，因此唯一索引将是一对：``(start_vid, end_vid)``。

source: Depending on the function and its parameters, the results can be symmetric.
sv: Beroende på funktionen och dess parametrar kan resultaten vara symmetriska.
zh_hans: 根据函数及其参数，结果可能是对称的。

source: The **aggregate cost** of :math:`(u, v)` is the same as for :math:`(v, u)`.
sv: Den **samlade kostnaden** för :math:`(u, v)` är densamma som för :math:`(v, u)`.
zh_hans: :math:`(u, v)`的**总成本**与 :math:`(v, u)`的相同。

source: Any duplicated value in the start or end vertex identifiers are ignored.
sv: Eventuella duplicerade värden i start- eller slutvertexidentifierarna ignoreras.
zh_hans: 起始或结束顶点标识符中的任何重复值都将被忽略。

source: The returned values are ordered:
sv: De returnerade värdena är ordnade:
zh_hans: 返回值是有序的：

source: ``start_vid`` ascending
sv: ``start_vid`` stigande
zh_hans: ``start_vid`` 升序

source: ``end_vid`` ascending
sv: ``end_vid`` stigande
zh_hans: ``end_vid``升序

source: Cost Matrix - Category
sv: Kostnadsmatris - Kategori
zh_hans: 成本矩阵 - 类别

source: This collection of functions will return a cost matrix in form of a table.
sv: Denna samling funktioner returnerar en kostnadsmatris i form av en tabell.
zh_hans: 该函数集合将以表格形式返回成本矩阵。

source: Can be used as input to :doc:`pgr_TSP`.
sv: Kan användas som indata till :doc:`pgr_TSP`.
zh_hans: 可用作 :doc:`pgr_TSP` 的输入。

source: Use directly when the resulting matrix is symmetric and there is no :math:`\infty` value.
sv: Används direkt när den resulterande matrisen är symmetrisk och det inte finns något :math:`\infty`-värde.
zh_hans: 当得到的矩阵是对称且没有 :math:`\infty`值时直接使用。

source: It will be the users responsibility to make the matrix symmetric.
sv: Det är användarens ansvar att göra matrisen symmetrisk.
zh_hans: 用户有责任使矩阵对称。

source: By using geometric or harmonic average of the non symmetric values.
sv: Genom att använda geometriskt eller harmoniskt medelvärde av de icke symmetriska värdena.
zh_hans: 通过使用非对称值的几何平均或调和平均。

source: By using max or min the non symmetric values.
sv: Genom att använda max eller min används de icke symmetriska värdena.
zh_hans: 通过使用 max 或 min 非对称值。

source: By setting the upper triangle to be the mirror image of the lower triangle.
sv: Genom att ställa in den övre triangeln så att den blir en spegelbild av den nedre triangeln.
zh_hans: 通过将上三角形设置为下三角形的镜像。

source: By setting the lower triangle to be the mirror image of the upper triangle.
sv: Genom att ställa in den nedre triangeln så att den blir en spegelbild av den övre triangeln.
zh_hans: 通过将下三角形设置为上三角形的镜像。

source: It is also the users responsibility to fix an :math:`\infty` value.
sv: Det är också användarens ansvar att åtgärda ett :math:`\infty`-värde.
zh_hans: 确定:math:`\infty`值也是用户的责任。

source: Returns the sum of the costs of the shortest path for pair combination of nodes in the graph.
sv: Returnerar summan av kostnaderna för den kortaste vägen för parkombinationer av noder i grafen.
zh_hans: 返回图中节点对组合的最短路径的成本总和。

source: When the starting vertex and ending vertex are the same, there is no path.
sv: När startvertex och slutvertex är desamma finns det ingen väg.
zh_hans: 当起始顶点和结束顶点相同时，就没有路径。

source: The aggregate cost in the non included values `(v, v)` is `0`.
sv: Den sammanlagda kostnaden för de icke inkluderade värdena `(v, v)` är `0`.
zh_hans: 未包含值`(v, v)` 中的总成本为`0`。

source: When the starting vertex and ending vertex are the different and there is no path.
sv: När startvertex och slutvertex är olika och det inte finns någon väg.
zh_hans: 当起始顶点和结束顶点不同且不存在路径时。

source: The aggregate cost in the non included values `(u, v)` is :math:`\infty`.
sv: Den sammanlagda kostnaden för de icke inkluderade värdena `(u, v)` är :math:`\infty`.
zh_hans: 未包含值 `(u, v)` 中的总成本为 :math:`\infty` 。

source: Let be the case the values returned are stored in a table:
sv: Om så är fallet lagras de värden som returneras i en tabell:
zh_hans: 假设返回的值存储在表中：

source: The unique index would be the pair: ``(start_vid, end_vid)``.
sv: Det unika indexet skulle vara paret: ``(start_vid, end_vid)``.
zh_hans: 唯一索引将是一对： ``(start_vid, end_vid)``。

source: The aggregate cost of `(u, v)` is the same as for `(v, u)`.
sv: Den sammanlagda kostnaden för `(u, v)` är densamma som för `(v, u)`.
zh_hans: `(u, v)`的总成本与 `(v, u)`相同。

source: Any duplicated value in the **start vids** are ignored.
sv: Alla duplicerade värden i **start vids** ignoreras.
zh_hans: **start vids**中的任何重复值都会被忽略。

source: Used in:
sv: Används i:
zh_hans: 用于：

source: `Edges SQL`_ as described below
sv: `Edges SQL`_ enligt beskrivningen nedan
zh_hans: `Edges SQL`_ 如下所述

source: **start vids**
sv: **starta videor**

source: Array of identifiers of starting vertices.
sv: Array med identifierare för startpunkter.
zh_hans: 起始顶点的标识符数组。

source: `Points SQL`_
sv: `Punkt SQL`_

source: `Points SQL`_ as described below
sv: `Points SQL`_ enligt beskrivningen nedan
zh_hans: `Points SQL`_ 如下所述

source: Points SQL
sv: Punkt SQL
