Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: building contraction with a set of forbidden vertices
sv: bygga sammandragning med en uppsättning förbjudna toppar

source: Contraction process steps details
sv: Detaljer för sammandragningsprocessens steg

source: Shortcut building process
sv: Genväg till byggprocessen

source: A vertex ``v`` is contracted by adding shortcuts replacing former paths of the form ``(u, v, w)`` by an edge ``(u, w)``. The shortcut ``(u, w)`` is only needed when ``(u, v, w)`` is the only shortest path between ``u`` and ``w``.
sv: En topp ``v`` dras samman genom att lägga till genvägar som ersätter tidigare vägar av formen ``(u, v, w)`` med en kant ``(u, w)``. Genvägen ``(u, w)`` behövs bara när ``(u, v, w)`` är den enda kortaste vägen mellan ``u`` och ``w``.

source: When all shortcuts have been added for a given vertex ``v``, the incident edges of ``v`` are removed and another vertex is contracted with the remaining graph.
sv: När alla genvägar har lagts till för ett givet toppunkt ``v`` tas de infallande kanterna för ``v`` bort och ett nytt toppunkt dras samman med den återstående grafen.

source: The procedure is destructive for the graph and a copy is made to be able to manipulate it again as a whole. The contraction process adds all discovered shortcuts to the edge set ``E`` and attributes a metric to each contracted vertex. This metric is giving what is called the *contraction hierarchy*.
sv: Förfarandet är destruktivt för grafen och en kopia görs för att kunna manipulera den igen som en helhet. Kontraktionsprocessen lägger till alla upptäckta genvägar till kantuppsättningen ``E`` och tilldelar en metrik till varje kontraherad vertex. Denna metrik ger det som kallas *kontraktionshierarkin*.

source: Initialize the queue with a first vertices order
sv: Initiera kön med en ordning för första toppar

source: For each vertex ``v`` of the graph, a contraction of ``v`` is built:
sv: För varje topp ``v`` i grafen byggs en sammandragning av ``v``:

source: Adjacent edges are removed.
sv: Intilliggande kanter tas bort.

source: Shortcuts are built from predecessors of ``v`` to successors of ``v`` if and only if the path through ``v`` corresponds to the only shortest path between the predecessor and the successor of ``v`` in the graph. The *edge difference* metric here takes the value of -2.
sv: Genvägar byggs från föregångare till ``v`` till efterföljare till ``v`` om och endast om vägen genom ``v`` motsvarar den enda kortaste vägen mellan föregångaren och efterföljaren till ``v`` i grafen. Måttet *kantskillnad* antar här värdet -2.

source: Then the following vertex is contracted. The process goes on until each node of the graph has been contracted. At the end, there are no more edges in the graph, which has been destroyed by the process.
sv: Därefter kontraheras följande toppunkt. Processen fortsätter tills varje nod i grafen har dragits samman. I slutet finns det inte längre några kanter i grafen, som har förstörts av processen.

source: This first contraction will give a vertices order, given by ordering them in ascending order on the metric (edge difference). A total vertices order is built. If ``u < v``, then ``u`` is less important than ``v``. The algorithm keeps the vertices into a queue in this order.
sv: Denna första sammandragning ger en vertices-ordning, som ges genom att ordna dem i stigande ordning på metriken (kantskillnaden). En total vertices-ordning byggs upp. Om ``u < v``, så är ``u`` mindre viktig än ``v``. Algoritmen håller topparna i en kö i denna ordning.

source: A hierarchy will now be constructed by contracting again the vertices in this order.
sv: En hierarki kommer nu att konstrueras genom att åter kontrahera topparna i denna ordning.

source: Build the final vertex order
sv: Bygg den slutliga toppunktsordningen

source: Once the first order built, the algorithm uses it to browse the graph once again. For each vertex taken in the queue, the algorithm simulates contraction and calculates its edge difference. If the computed value is greater than the one of the next vertex to be contracted, then the algorithm puts it back in the queue (heuristic approach). Otherwise it contracts it permanently.
sv: När den första ordern har byggts använder algoritmen den för att bläddra igenom grafen igen. För varje toppunkt som tas upp i kön simulerar algoritmen sammandragning och beräknar dess kantskillnad. Om det beräknade värdet är större än värdet för nästa toppunkt som ska dras ihop, lägger algoritmen tillbaka den i kön (heuristisk metod). I annat fall dras den in permanent.

source: Add shortcuts to the initial graph
sv: Lägga till genvägar till den initiala grafen

source: At the end, the algorithm takes the initial graph (before edges deletions) and adds the shortcut edges to it. It gives you the contracted graph, ready to use with a specialized Dijkstra algorithm, which takes into account the order of the nodes in the hierarchy.
sv: I slutet tar algoritmen den ursprungliga grafen (före borttagning av kanter) och lägger till genvägskanterna till den. På så sätt får man en sammandragen graf, redo att användas med en specialiserad Dijkstra-algoritm, som tar hänsyn till nodernas ordning i hierarkin.

source: Use the contraction
sv: Använd sammandragning

source: Build the contraction
sv: Bygg sammandragningen

source: Add shortcuts and hierarchy in the existing tables
sv: Lägg till genvägar och hierarki i befintliga tabeller

source: Add new columns in the `vertices` and `edges` tables to store the results:
sv: Lägg till nya kolumner i tabellerna `vertices` och `edges` för att lagra resultaten:

source: Update and insert the results in the two tables.
sv: Uppdatera och infoga resultaten i de två tabellerna.

source: Use a Dijkstra shortest path algorithm on it
sv: Använd en Dijkstra-algoritm för kortaste vägen på den

source: Then you can use any Dijkstra-like algorithm, waiting for the adapted one which will take into account the built vertices hierarchy. For example:
sv: Sedan kan du använda vilken Dijkstra-liknande algoritm som helst och vänta på den anpassade algoritmen som tar hänsyn till den uppbyggda toppunktshierarkin. Till exempel:

source: ``pgr_contractionLinear`` - Proposed
sv: ``pgr_contractionLinear`` - Föreslagen

source: ``pgr_contractionLinear`` — Performs graph contraction and returns the contracted vertices and edges.
sv: ``pgr_contractionLinear`` - Utför grafkontraktion och returnerar de kontraherade topparna och kanterna.

source: Linear contraction on an undirected graph.
sv: Linjär sammandragning på en odelad graf.

source: The green nodes are linear nodes and will not be part of the contracted graph.
sv: De gröna noderna är linjära noder och kommer inte att vara en del av den kontrakterade grafen.

source: All edges adjacent will not be part of the contracted graph.
sv: Alla angränsande kanter kommer inte att vara en del av den kontraherade grafen.

source: The red lines will be new edges of the contracted graph.
sv: De röda linjerna kommer att vara nya kanter i den kontraherade grafen.

source: **contraction Order**
sv: **kontraktsbeställning**

source: Number of times the contraction operations on ``contraction_order`` will be performed.
sv: Antal gånger som sammandragningsoperationerna på ``contraction_order`` kommer att utföras.
zh_hans: 对于 ``contraction_order`` 上的收缩操作将执行的次数。

source: A node connects two (or more) `linear` edges when
sv: En nod förbinder två (eller fler) `linjära` kanter när

source: The number of adjacent vertices is 2.
sv: Antalet angränsande hörn är 2.
zh_hans: 相邻顶点的数量为2。

source: In case of a directed graph, a node is considered a `linear` node when
sv: I en riktad graf anses en nod vara en "linjär" nod när
zh_hans: 在有向图的情况下，当满足以下条件时，节点被视为`线性`节点：

source: Linearity is symmetrical.
sv: Linjäriteten är symmetrisk.

source: Linearity is not symmetrical
sv: Linjäriteten är inte symmetrisk

source: Graph where linearity is not symmetrical.
sv: Graf där linjäriteten inte är symmetrisk.

source: When the graph is processed as a directed graph, linearity is not symmetrical, therefore the graph can not be contracted.
sv: När grafen bearbetas som en riktad graf är linjäriteten inte symmetrisk, och grafen kan därför inte dras ihop.

source: When the same graph is processed as an undirected graph, linearity is symmetrical, therefore the graph can be contracted.
sv: När samma graf behandlas som en odelad graf är linjäriteten symmetrisk och grafen kan därför krympas.

source: The three edges can be replaced by one undirected edge
sv: De tre kanterna kan ersättas med en ostyrd kant

source: Edge :math:`1 - 3`.
sv: Kant :math:`1 - 3`.

source: With cost: :math:`4`.
sv: Med kostnad: :math:`4`.

source: Contracted vertices in the edge: :math:`\{2\}`.
sv: Sammandragna hörn i kanten: :math:`\{2\}`.

source: Linearity is symmetrical
sv: Linjäriteten är symmetrisk
zh_hans: 线性是对称的

source: Graph where linearity is symmetrical.
sv: Graf där linjäriteten är symmetrisk.

source: The four edges can be replaced by two directed edges.
sv: De fyra kanterna kan ersättas av två riktade kanter.

source: Edge :math:`3 - 1`.
sv: Kant :math:`3 - 1`.

source: With cost: :math:`6`.
sv: Med kostnad: :math:`6`.

source: The four edges can be replaced by one undirected edge.
sv: De fyra kanterna kan ersättas med en ostyrd kant.

source: Step by step linear contraction
sv: Steg för steg linjär sammandragning

source: The linear contraction will stop when there are no more linear edges. For example from the following graph there are linear edges
sv: Den linjära sammandragningen upphör när det inte längre finns några linjära kanter. Till exempel från följande graf finns det linjära kanter

source: The vertex :math:`3` is removed from the graph
sv: Toppunkten :math:`3` tas bort från grafen

source: The edges :math:`2 \rightarrow 3` and :math:`w \rightarrow z` are removed from the graph.
sv: Kanterna :math:`2 \rightarrow 3` och :math:`w \rightarrow z` tas bort från grafen.

source: A new edge :math:`2 \rightarrow 4` is inserted represented with red color.
sv: En ny kant :math:`2 \rightarrow 4` infogas representerad med röd färg.

source: Contracting vertex :math:`2`:
sv: Kontraherande vertex :math:`2`:

source: The vertex :math:`2` is removed from the graph
sv: Toppunkten :math:`2` tas bort från grafen

source: The edges :math:`1 \rightarrow 2` and :math:`2 \rightarrow 3` are removed from the graph.
sv: Kanterna :math:`1 \rightarrow 2` och :math:`2 \rightarrow 3` tas bort från grafen.

source: A new edge :math:`1 \rightarrow 3` is inserted represented with red color.
sv: En ny kant :math:`1 \rightarrow 3` infogas representerad med röd färg.

source: Edge :math:`1 \rightarrow 3` has the information of cost and the nodes that were contracted.
sv: Edge :math:`1 \rightarrow 3` har information om kostnad och de noder som kontrakterades.

source: Create the contracted graph.
sv: Skapa den kontraherade grafen.

source: ``pgr_cuthillMckeeOrdering`` - Experimental
sv: ``pgr_cuthillMckeeOrdering`` - Experimentell
zh_hans: ``pgr_cuthillMckeeOrdering`` - 实验

source: ``pgr_cuthillMckeeOrdering`` — Returns the reverse Cuthill-Mckee ordering of an undirected graphs
sv: ``pgr_cuthillMckeeOrdering`` - Returnerar den omvända Cuthill-Mckee-ordningen för en ostyrd graf
zh_hans: ``pgr_cuthillMckeeOrdering`` — 返回无向图的反向 Cuthill-Mckee 排序

source: In numerical linear algebra, the Cuthill-McKee algorithm (CM), named after Elizabeth Cuthill and James McKee, is an algorithm to permute a sparse matrix that has a symmetric sparsity pattern into a band matrix form with a small bandwidth.
sv: Inom numerisk linjär algebra är Cuthill-McKee-algoritmen (CM), uppkallad efter Elizabeth Cuthill och James McKee, en algoritm för att permutera en gles matris som har ett symmetriskt gleshetsmönster till en bandmatrisform med liten bandbredd.
zh_hans: 在数值线性代数中，Cuthill-McKee算法（CM），以Elizabeth Cuthill和James McKee的名字命名，是一种用于对具有对称稀疏模式的稀疏矩阵进行置换的算法，以使其转化为带状矩阵形式，带宽较小。

source: The vertices are basically assigned a breadth-first search order, except that at each step, the adjacent vertices are placed in the queue in order of increasing degree.
sv: Topparna tilldelas i princip en bredd-första sökordning, förutom att de intilliggande topparna i varje steg placeras i kön i stigande grad.
zh_hans: 顶点基本上按照广度优先搜索的顺序进行分配，不过在每一步中，相邻的顶点按照递增的度数顺序排列放入队列。

source: The implementation is for **undirected** graphs.
sv: Implementationen är för **undirected** grafer.
zh_hans: 该实现适用于**无向**图。

source: The bandwidth minimization problems are considered NP-complete problems.
sv: Problemen med att minimera bandbredden anses vara NP-kompletta problem.
zh_hans: 带宽最小化问题被认为是NP完全问题。

source: The running time complexity is: :math:`O(m log(m)|V|)`
sv: Körtidskomplexiteten är: :math:`O(m log(m)|V|)`
zh_hans: 运行时间复杂度为：:math:`O(m log(m)|V|)`

source: where :math:`|V|` is the number of vertices,
sv: där :math:`|V|` är antalet toppar,
zh_hans: 其中 :math:`|V|`是顶点数，

source: Returns set of |result-node-order|
sv: Returnerar uppsättning av |result-node-order|

source: Graph ordering of pgRouting :doc:`sampledata`
sv: Grafisk ordning av pgRouting :doc:`sampledata`
zh_hans: pgRouting :doc:`sampledata` 的图形排序

source: Returns set of ``(seq, node)``
sv: Returnerar uppsättning av ``(seq, node)``
zh_hans: 返回 ``(seq, node)`` 的集合

source: Sequence of the order starting from 1.
sv: Ordningsföljd med början från 1.
zh_hans: 从1开始的顺序序列。

source: New ordering in reverse order.
sv: Ny beställning i omvänd ordning.
zh_hans: 新的逆序排列。

source: `Boost: Cuthill-McKee Ordering <https://www.boost.org/libs/graph/doc/cuthill_mckee_ordering.html>`__
sv: `Boost: Cuthill-McKee Beställning <https://www.boost.org/libs/graph/doc/cuthill_mckee_ordering.html>`__
zh_hans: `Boost: Cuthill-McKee 排序 <https://www.boost.org/libs/graph/doc/cuthill_mckee_ordering.html>`__

source: `Wikipedia: Cuthill-McKee Ordering <https://en.wikipedia.org/wiki/Cuthill%E2%80%93McKee_algorithm>`__
sv: `Wikipedia: Cuthill-McKee-ordning <https://en.wikipedia.org/wiki/Cuthill%E2%80%93McKee_algoritm>`__
zh_hans: `Wikipedia: Cuthill-McKee 排序 <https://en.wikipedia.org/wiki/Cuthill%E2%80%93McKee_algorithm>`__

source: ``pgr_dagShortestPath`` - Experimental
sv: ``pgr_dagShortestPath`` - Experimentell

source: ``pgr_dagShortestPath`` — Returns the shortest path for weighted directed acyclic graphs(DAG). In particular, the DAG shortest paths algorithm implemented by Boost.Graph.
sv: ``pgr_dagShortestPath`` - Returnerar den kortaste vägen för viktade riktade acykliska grafer (DAG). I synnerhet är DAG-algoritmen för kortaste vägar implementerad av Boost.Graph.

source: Shortest Path for Directed Acyclic Graph(DAG) is a graph search algorithm that solves the shortest path problem for weighted directed acyclic graph, producing a shortest path from a starting vertex (``start_vid``) to an ending vertex (``end_vid``).
sv: Shortest Path for Directed Acyclic Graph(DAG) är en grafsökningsalgoritm som löser problemet med kortaste vägen för viktad riktad acyklisk graf, vilket ger en kortaste väg från ett startvertex (``start_vid``) till ett slutvertex (``end_vid``).
zh_hans: 有向无环图（DAG）的最短路径是一种图搜索算法，用于解决加权有向无环图的最短路径问题，找到从起始顶点（``start_vid``）到结束顶点（``end_vid``）的最短路径。

source: This implementation can only be used with a **directed** graph with no cycles i.e. directed acyclic graph.
sv: Denna implementation kan endast användas med en **riktad** graf utan cykler, dvs. en riktad acyklisk graf.
zh_hans: 这个实现只能用于**有向**图，且没有循环，即有向无环图。

source: The algorithm relies on topological sorting the dag to impose a linear ordering on the vertices, and thus is more efficient for DAG's than either the Dijkstra or Bellman-Ford algorithm.
sv: Algoritmen förlitar sig på topologisk sortering av DAG för att införa en linjär ordning på topparna och är därmed effektivare för DAG än både Dijkstra- och Bellman-Ford-algoritmen.
zh_hans: 该算法依靠对 DAG 进行拓扑排序来对顶点进行线性排序，因此对于 DAG 来说比 Dijkstra 或 Bellman-Ford 算法更有效。

source: Process is valid for weighted directed acyclic graphs only. otherwise it will throw warnings.
sv: Processen är endast giltig för viktade riktade acykliska grafer. annars kommer den att ge varningar.
zh_hans: 该过程仅对加权有向无环图有效。 否则它会抛出警告。

source: The `agg_cost` the non included values `(v, v)` is `0`
sv: Den `agg_cost` de icke inkluderade värdena `(v, v)` är `0`
zh_hans: `agg_cost`中未包括的值`(v, v)`的成本为`0`

source: The `agg_cost` the non included values `(u, v)` is :math:`\infty`
sv: Den `agg_cost` de icke inkluderade värdena `(u, v)` är :math:`\infty`
zh_hans: `agg_cost`中未包括的值 `(u, v)`是数学符号中的:math:`\infty`

source: Running time: :math:`O(| start\_vids | * (V + E))`
sv: Drifttid: :math:`O(| start\_vids | * (V + E))`
zh_hans: 运行时间：:math:`O(| start\_vids | * (V + E))`

source: From vertex :math:`5` to vertex :math:`11` on a **directed** graph
sv: Från toppunkten :math:`5` till toppunkten :math:`11` på en **riktad** graf
zh_hans: 在**有向**图上，从顶点:math:`5`到顶点 :math:`11`

source: From vertex :math:`5` to vertices :math:`\{7, 11\}`
sv: Från toppunkten :math:`5` till toppunkterna :math:`{7, 11\}`
zh_hans: 从顶点:math:`5`到顶点 :math:`\{7, 11\}`

source: From vertices :math:`\{5, 10\}` to vertex :math:`11`
sv: Från topparna :math:`\{5, 10\}` till topp :math:`11`
zh_hans: 从顶点:math:`\{5, 10\}`到顶点 :math:`11`

source: From vertices :math:`\{5, 15\}` to vertices :math:`\{11, 17\}` on an **undirected** graph
sv: Från topparna :math:`\{5, 15\}` till topparna :math:`\{11, 17\}` i en **omdirigerad** graf
zh_hans: 在**无向**图上，从顶点:math:`\{5, 15\}`到顶点:math:`\{11, 17\}`

source: Return columns
sv: Returnera kolumner
zh_hans: 返回列

source: Making **start_vids** the same as **end_vids**
sv: Gör **start_vids** till samma sak som **end_vids**
zh_hans: 使 **start_vids** 与 **end_vids** 相同

source: `Boost: DAG shortest paths <https://www.boost.org/libs/graph/doc/dag_shortest_paths.html>`__
sv: `Boost: DAG kortaste vägar <https://www.boost.org/libs/graph/doc/dag_shortest_paths.html>`__

source: ``pgr_degree``
sv: ``pgr_grad``

source: ``pgr_degree`` — For each vertex in an undirected graph, return the count of edges incident to the vertex.
sv: ``pgr_degree`` - För varje toppunkt i en odelad graf, returnera antalet kanter som är kopplade till toppunktet.
zh_hans: ``pgr_degree`` —对于无向图中的每个顶点，返回与该顶点关联的边的计数。

source: Error messages adjustment.
sv: Justering av felmeddelanden.

source: New signature with only Edges SQL.
sv: Ny signatur med endast Edges SQL.

source: Calculates the degree of the vertices of an undirected graph
sv: Beräknar graden för topparna i en odelad graf

source: The degree (or valency) of a vertex of a graph is the number of edges that are incident to the vertex.
sv: Graden (eller valensen) för ett toppunkt i en graf är antalet kanter som är angränsande till toppunktet.

source: A loop contributes 2 to a vertex's degree.
sv: En loop bidrar med 2 till en topps grad.

source: A vertex with degree 0 is called an isolated vertex.
sv: Ett toppunkt med grad 0 kallas ett isolerat toppunkt.

source: Isolated vertex is not part of the result
sv: Isolerad toppunkt är inte en del av resultatet

source: Vertex not participating on the subgraph is considered and isolated vertex.
sv: Vertex som inte deltar i undergrafen betraktas som en isolerad vertex.

source: There can be a ``dryrun`` execution and the code used to get the answer will be shown in a PostgreSQL ``NOTICE``.
sv: Det kan finnas en ``dryrun`` exekvering och koden som används för att få svaret kommer att visas i en PostgreSQL ``NOTICE``.

source: The code can be used as base code for the particular application requirements.
sv: Koden kan användas som baskod för de specifika applikationskraven.

source: No ordering is performed.
sv: Ingen beställning utförs.

source: RETURNS SETOF |result-degree|
sv: RETURNERAR SETOF |resultat-grad|

source: Edges
sv: Kanter

source: example
sv: exempel

source: Get the degree of the vertices defined on the edges table
sv: Hämta graden för de toppar som definieras i tabellen edges

source: Edges and Vertices
sv: Kanter och toppar

source: Extracting the vertex information
sv: Extrahera information om toppunkt
zh_hans: 提取顶点信息

source: ``pgr_degree`` can use :doc:`pgr_extractVertices` embedded in the call.
sv: ``pgr_degree`` kan använda :doc:`pgr_extractVertices` inbäddad i anropet.

source: For decent size networks, it is best to prepare your vertices table before hand and use it on ``pgr_degree`` calls. (See `Using a vertex table`_)
sv: För nätverk av anständig storlek är det bäst att förbereda vertex-tabellen i förväg och använda den vid anrop av ``pgr_degree``. (Se `Användning av en vertex-tabell`_)

source: Calculate the degree of the nodes:
sv: Beräkna nodernas grad:

source: `Vertex SQL`_ as described below
sv: `Vertex SQL`_ enligt beskrivningen nedan
zh_hans: `Vertex SQL`_如下所述

source: When true do not process and get in a NOTICE the resulting query.
sv: När det är sant bearbeta inte och få i ett NÄRVARO den resulterande frågan.
zh_hans: 当为真时，不要处理查询，而是获取一个通知（NOTICE）来显示查询的结果。

source: For the `Edges and Vertices`_ signature:
sv: För signaturen `Edges and Vertices`_:

source: For the `Edges`_ signature:
sv: För signaturen `Edges`_:

source: Array of identifiers of the edges that have the vertex ``id`` as *first end point*.
sv: Array med identifierare för de kanter som har toppunkten ``id`` som *första slutpunkt*.
zh_hans: 以顶点``id``作为*第一个端点*的边的标识符数组。

source: When missing, ``out_edges`` must exist.
sv: När den saknas måste ``out_edges`` finnas.
zh_hans: 当缺失时，``out_edges``必须存在。

source: ``out_edges``
sv: ``ut_kanter``

source: Array of identifiers of the edges that have the vertex ``id`` as *second end point*.
sv: Array med identifierare för de kanter som har toppunkten ``id`` som *andra slutpunkt*.
zh_hans: 以顶点``id``作为*第二个端点*的边的标识符数组。

source: When missing, ``in_edges`` must exist.
sv: När den saknas måste ``in_edges`` finnas.
zh_hans: 缺失时，``in_edges`` 必须存在。

source: Vertex identifier
sv: Identifierare för toppunkt
zh_hans: 顶点标识符

source: ``degree``
sv: "grad

source: Number of edges that are incident to the vertex ``id``
sv: Antal kanter som är angränsande till toppunkten ``id``
zh_hans: 与顶点 ``id`` 关联的边数

source: Degree of a loop
sv: Grad av en slinga

source: Using the `Edges`_ signature.
sv: Använda signaturen `Edges`_.

source: Using the `Edges and Vertices`_ signature.
sv: Använda signaturen `Edges and Vertices`_.

source: Degree of a sub graph
sv: Grad av en undergraf
zh_hans: 子图的度数

source: For the following is a subgraph of the :doc:`sampledata`:
sv: För följande är en delgraf av :doc:`sampledata`:

source: The vertices not participating on the edge are considered isolated
sv: De hörn som inte deltar i kanten betraktas som isolerade

source: their degree is 0 in the subgraph and
sv: deras grad är 0 i undergrafen och

source: their degree is not shown in the output.
sv: deras examen visas inte i utdata.

source: Using a vertex table
sv: Använda en toppunktstabell

source: For decent size networks, it is best to prepare your vertices table before hand and use it on ``pgr_degree`` calls.
sv: För nätverk av anständig storlek är det bäst att förbereda vertices-tabellen i förväg och använda den vid anrop av ``pgr_degree``.

source: Extract the vertex information and save into a table:
sv: Extrahera toppunktsinformationen och spara i en tabell:

source: Dry run execution
sv: Utförande av provkörning
zh_hans: 试运行执行

source: To get the query generated used to get the vertex information, use ``dryrun => true``.
sv: Använd ``dryrun => true`` för att få den fråga som genereras för att få fram toppunktsinformationen.
zh_hans: 要获取生成的用于获取顶点信息的查询，请使用 ``dryrun => true``。

source: The results can be used as base code to make a refinement based on the backend development needs.
sv: Resultaten kan användas som baskod för att göra en förfining baserad på behoven för backend-utvecklingen.
zh_hans: 结果可以作为基础代码，根据后端开发需求进行细化。
