Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: have opening and closing times for the start and ending locations.
sv: ha öppnings- och stängningstider för start- och slutplatserna.
zh_hans: 有开始和结束地点的开放和关闭时间。

source: have a capacity.
sv: har en kapacitet.
zh_hans: 具有容量

source: The orders
sv: Beställningarna
zh_hans: 订单

source: Have pick up and delivery locations.
sv: Har upphämtnings- och leveransplatser.
zh_hans: 有提货和送货地点。

source: Have opening and closing times for the pickup and delivery locations.
sv: Ha öppet- och stängningstider för upphämtnings- och leveransplatserna.
zh_hans: 有提货和送货地点的开放和关闭时间。

source: Have pickup and delivery duration service times.
sv: Har servicetider för upphämtning och leveranstid.
zh_hans: 有取货和送货持续时间的服务时间。

source: have a demand request for moving goods from the pickup location to the delivery location.
sv: har en begäran om att få flytta varor från upphämtningsplatsen till leveransplatsen.
zh_hans: 有将货物从取货地点移动到交货地点的需求请求。

source: Time based calculations:
sv: Tidsbaserade beräkningar:
zh_hans: 基于时间的计算：

source: Travel time between customers is :math:`distance / speed`
sv: Restiden mellan kunder är :math:`avstånd / hastighet`
zh_hans: 客户之间的旅行时间为:math:`distance / speed`

source: Pickup and delivery order pair is done by the same vehicle.
sv: Hämtning och leverans av orderparet sker med samma fordon.
zh_hans: 取货和送货订单对由同一辆车完成。

source: A pickup is done before the delivery.
sv: En upphämtning görs före leveransen.
zh_hans: 送货前会进行取货。

source: Pick & deliver
sv: Hämta och leverera
zh_hans: 取货 & 送货

source: Used in :doc:`pgr_pickDeliverEuclidean`
sv: Används i :doc:`pgr_pickDeliverEuclidean`
zh_hans: 用于:doc:`pgr_pickDeliverEuclidean`

source: `Orders SQL`_
sv: beställningar SQL

source: `Orders SQL`_ as described below.
sv: `Orders SQL`_ enligt beskrivningen nedan.
zh_hans: `Orders SQL`_如下所述。

source: `Vehicles SQL`_
sv: fordon SQL

source: `Vehicles SQL`_ as described below.
sv: `Vehicles SQL`_ enligt beskrivningen nedan.
zh_hans: `Vehicles SQL`_ 如下所述。

source: Used in :doc:`pgr_pickDeliver`
sv: Används i :doc:`pgr_pickDeliver`
zh_hans: 用于:doc:`pgr_pickDeliver`

source: `Matrix SQL`_ as described below.
sv: `Matrix SQL`_ enligt beskrivningen nedan.
zh_hans: `Matrix SQL`_ 如下所述。

source: Pick-Deliver optional parameters
sv: Pick-Deliver valfria parametrar
zh_hans: 取货-送货可选参数

source: ``factor``
sv: ``faktor``

source: Travel time multiplier. See :ref:`pd_factor`
sv: Multiplikator för restid. Se :ref:`pd_factor`
zh_hans: 旅行时间乘数。 请参阅:ref:`pd_factor`

source: ``max_cycles``
sv: ``max_cykler``

source: Maximum number of cycles to perform on the optimization.
sv: Maximalt antal cykler som ska utföras på optimeringen.
zh_hans: 执行优化的最大周期数。

source: Initial solution to be used.
sv: Initial lösning som ska användas.
zh_hans: 要使用的初始解决方案。

source: ``1`` One order per truck
sv: ``1`` En order per lastbil
zh_hans: ``1`` 每辆卡车一份订单

source: ``2`` Push front order.
sv: ``2`` Tryck på främre order.
zh_hans: ``2`` 提前订单

source: ``3`` Push back order.
sv: ``3`` Tryck tillbaka order.
zh_hans: ``3`` 推迟订单

source: ``4`` Optimize insert.
sv: ``4`` Optimera insättning.
zh_hans: ``4`` 优化插入。

source: ``5`` Push back order that allows more orders to be inserted at the back
sv: ``5`` Push back-order som gör det möjligt att lägga in fler order på baksidan
zh_hans: ``5`` 推迟订单，允许在后面插入更多订单

source: ``6`` Push front order that allows more orders to be inserted at the front
sv: ``6`` Push front order som gör det möjligt att lägga in fler order längst fram
zh_hans: ``6`` 提前订单，允许在前面插入更多订单

source: Orders SQL
sv: Beställningar SQL
zh_hans: 订单 SQL

source: Common columns for the orders SQL in both implementations:
sv: Gemensamma kolumner för order SQL i båda implementationerna:
zh_hans: 两种实现中订单 SQL 的公共列：

source: Identifier of the pick-delivery order pair.
sv: Identifierare för orderparet plockning-leverans.
zh_hans: 提货-交货订单对的标识符。

source: ``demand``
sv: ``efterfrågan``

source: |ANY-NUMERICAL|
sv: |ANY-NUMERISK|

source: Number of units in the order
sv: Antal enheter i ordern
zh_hans: 订单中的单位数量

source: The time, relative to 0, when the pickup location opens.
sv: Tidpunkten, relativt till 0, när upphämtningsplatsen öppnas.
zh_hans: 相对于0的时间，提货地点开放。

source: The time, relative to 0, when the pickup location closes.
sv: Tidpunkten, relativt till 0, när upphämtningsplatsen stängs.
zh_hans: 提货地点关闭的时间（相对于 0）。

source: The duration of the loading at the pickup location.
sv: Varaktigheten av lastningen på upphämtningsplatsen.
zh_hans: 在取货地点装载的持续时间。

source: When missing: 0 time units are used
sv: När den saknas: 0 tidsenheter används
zh_hans: 缺失时：使用 0 个时间单位

source: The time, relative to 0, when the delivery location opens.
sv: Tidpunkten, relativt till 0, när leveransplatsen öppnas.
zh_hans: 交货地点开放的时间（相对于 0）。

source: The time, relative to 0, when the delivery location closes.
sv: Tidpunkten, relativt till 0, när leveransplatsen stängs.
zh_hans: 交货地点关闭的时间（相对于 0）。

source: The duration of the unloading at the delivery location.
sv: Varaktigheten av lossningen på leveransplatsen.
zh_hans: 在交货地点卸货的持续时间。

source: For :doc:`pgr_pickDeliver` the pickup and delivery identifiers of the locations are needed:
sv: För :doc:`pgr_pickDeliver` behövs identifierarna för upphämtning och leverans av platserna:
zh_hans: 对于:doc:`pgr_pickDeliver`，需要位置的取货和送货标识符：

source: The node identifier of the pickup, must match a vertex identifier in the `Matrix SQL`_.
sv: Pickupens nodidentifierare måste matcha en vertexidentifierare i `Matrix SQL`_.
zh_hans: 取货的节点标识符必须与`Matrix SQL`_ 中的顶点标识符匹配。

source: The node identifier of the delivery, must match a vertex identifier in the `Matrix SQL`_.
sv: Leveransens nodidentifierare måste matcha en vertexidentifierare i `Matrix SQL`_.
zh_hans: 送货的节点标识符必须与 `Matrix SQL`_中的顶点标识符匹配。

source: For :doc:`pgr_pickDeliverEuclidean` the :math:`(x, y)` values of the locations are needed:
sv: För :doc:`pgr_pickDeliverEuclidean` behövs :math:`(x, y)`-värdena för platserna:
zh_hans: 对于 :doc:`pgr_pickDeliverEuclidean`，这需要位置的:math:`(x, y)`值：

source: Vehicles SQL
sv: Fordon SQL
zh_hans: 车辆 SQL

source: Common columns for the vehicles SQL in both implementations:
sv: Gemensamma kolumner för fordon SQL i båda implementationerna:
zh_hans: 两种实现中车辆 SQL 的公共列：

source: Identifier of the vehicle.
sv: Identifierare av fordonet.
zh_hans: 车辆的标识符。

source: ``capacity``
sv: ``Kapacitet``

source: Maiximum capacity units
sv: Enheter med maximal kapacitet
zh_hans: 最大容量单位

source: ``start_open``
sv: ``start_öppna``

source: The time, relative to 0, when the starting location opens.
sv: Tidpunkten, relativt 0, när startplatsen öppnas.
zh_hans: 起始位置打开的时间（相对于 0）。

source: The time, relative to 0, when the starting location closes.
sv: Tidpunkten, relativt 0, när startplatsen stängs.
zh_hans: 起始位置关闭的时间（相对于 0）。

source: The duration of the loading at the starting location.
sv: Längden på lastningen vid startplatsen.
zh_hans: 在起始位置加载的持续时间。

source: When missing: A duration of :math:`0` time units is used.
sv: När den saknas: En varaktighet på :math:`0` tidsenheter används.
zh_hans: 缺失时：使用 :math:`0` 个时间单位的持续时间。

source: The time, relative to 0, when the ending location opens.
sv: Tidpunkten, relativt 0, då slutplatsen öppnas.
zh_hans: 结束位置打开的时间（相对于 0）。

source: When missing: The value of ``start_open`` is used
sv: När den saknas: Värdet på ``start_open`` används
zh_hans: 缺失时：使用``start_open``的值

source: The time, relative to 0, when the ending location closes.
sv: Tidpunkten, relativt till 0, när slutplatsen stängs.
zh_hans: 结束位置关闭的时间（相对于 0）。

source: When missing: The value of ``start_close`` is used
sv: När den saknas: Värdet på ``start_close`` används
zh_hans: 缺失时：使用``start_close``的值

source: The duration of the loading at the ending location.
sv: Längden på lastningen vid slutplatsen.
zh_hans: 在结束位置加载的持续时间。

source: When missing: A duration in ``start_service`` is used.
sv: När den saknas: En varaktighet i ``start_service`` används.
zh_hans: 缺失时：使用 ``start_service`` 中的持续时间。

source: For :doc:`pgr_pickDeliver` the starting and ending identifiers of the locations are needed:
sv: För :doc:`pgr_pickDeliver` behövs start- och slutidentifierare för platserna:
zh_hans: 对于 :doc:`pgr_pickDeliver`，需要位置的开始和结束标识符：

source: The node identifier of the start location, must match a vertex identifier in the `Matrix SQL`_.
sv: Startplatsens nodidentifierare måste matcha en vertexidentifierare i `Matrix SQL`_.
zh_hans: 起始位置的节点标识符必须与 `Matrix SQL`_ 中的顶点标识符匹配。

source: The node identifier of the end location, must match a vertex identifier in the `Matrix SQL`_.
sv: Nodeidentifieraren för slutpositionen måste matcha en vertexidentifierare i `Matrix SQL`_.
zh_hans: 结束位置的节点标识符必须与 `Matrix SQL`_ 中的顶点标识符匹配。

source: When missing: ``end_node_id`` is used.
sv: När den saknas: ``end_node_id`` används.
zh_hans: 缺少时：使用``end_node_id``。

source: When missing: ``start_x`` is used.
sv: När den saknas: ``start_x`` används.
zh_hans: 缺失时：使用``start_x``值。

source: When missing: ``start_y`` is used.
sv: När den saknas: ``start_y`` används.
zh_hans: 缺失时：使用``start_y``值。

source: Set of |matrix-result|
sv: Uppsättning av |matris-resultat|
zh_hans: |matrix-result|的集合

source: Identifier of the starting vertex.
sv: Identifierare för startvertexen.
zh_hans: 起始顶点的标识符。

source: ``end_vid``
sv: ``slut_vid``

source: Identifier of the ending vertex.
sv: Identifierare för det avslutande toppunktet.
zh_hans: 结束顶点的标识符。

source: Aggregate cost from ``start_vid`` to ``end_vid``.
sv: Sammanlagd kostnad från ``start_vid`` till ``slut_vid``.
zh_hans: 从 ``start_vid`` 到 ``end_vid`` 的总成本。

source: Sequential value starting from **1**.
sv: Sekventiellt värde med början från **1**.
zh_hans: 从**1**开始的顺序值。

source: ``vehicle_seq``
sv: ``fordon_seq``

source: Sequential value starting from **1** for current vehicles. The :math:`n_{th}` vehicle in the solution.
sv: Sekventiellt värde med början från **1** för aktuella fordon. Fordonet :math:`n_{th}` i lösningen.
zh_hans: 当前车辆从 **1** 开始的顺序值。 解决方案中的第 :math:`n_{th}` 辆车。

source: Value :math:`-2` indicates it is the summary row.
sv: Värdet :math:`-2` anger att det är den sammanfattande raden.
zh_hans: 值 :math:`-2` 表示它是汇总行

source: ``vehicle_id``
sv: ``fordon_id``

source: Current vehicle identifier.
sv: Aktuell fordonsidentifiering.
zh_hans: 当前车辆标识符。

source: Summary row has the **total capacity violations**.
sv: Sammanfattningsraden har **totala kapacitetsöverträdelser**.

source: A capacity violation happens when overloading or underloading a vehicle.
sv: En kapacitetsöverträdelse inträffar när ett fordon överlastas eller underlastas.
zh_hans: 当车辆超载或欠载时，就会发生容量违规。

source: ``stop_seq``
sv: ``stopp_seq``

source: Sequential value starting from **1** for the stops made by the current vehicle. The :math:`m_{th}` stop of the current vehicle.
sv: Sekventiellt värde med början från **1** för de stopp som görs av det aktuella fordonet. Stoppet :math:`m_{th}` för det aktuella fordonet.
zh_hans: 当前车辆停止的顺序值，从 **1** 开始。 当前第:math:`m_{th}`车辆的停止。

source: Summary row has the **total time windows violations**.
sv: Sammanfattning rad har **total tid fönster överträdelser**.

source: A time window violation happens when arriving after the location has closed.
sv: En överträdelse av tidsfönstret inträffar när man anländer efter att platsen har stängt.
zh_hans: 在该地点关闭后到达时，会发生时间窗口违规。

source: ``stop_type``
sv: ``stopp_typ``

source: Kind of stop location the vehicle is at
sv: Typ av stopplats som fordonet befinner sig på
zh_hans: 车辆所在的停车位置类型

source: ``order_id``
sv: beställning_id

source: Pickup-Delivery order pair identifier.
sv: Identifierare för orderparet hämtning-leverans.
zh_hans: 取货-送货订单对标识符。

source: Value :math:`-1`: When no order is involved on the current stop location.
sv: Värde :math:`-1`: När ingen order är involverad på den aktuella stoppositionen.
zh_hans: 值:math:`-1`: 当前停留位置没有订单参与。

source: ``cargo``
sv: "last

source: Cargo units of the vehicle when leaving the stop.
sv: Fordonets lastenheter när det lämnar hållplatsen.
zh_hans: 车辆离开停车点时的货物单位。

source: Value :math:`-1` on solution summary row.
sv: Värde :math:`-1` på raden för lösningssammanfattning.
zh_hans: 值:math:`-1`在解决方案摘要行。

source: ``travel_time``
sv: ``resetid``

source: Travel time from previous ``stop_seq`` to current ``stop_seq``.
sv: Restid från föregående ``stop_seq`` till aktuell ``stop_seq``.
zh_hans: 从前一个 ``stop_seq`` 到当前 ``stop_seq`` 的行程时间。

source: Summary has the **total traveling time**:
sv: Sammanfattning har **total restid**:
zh_hans: 总结一下**总的行程时间**：

source: The sum of all the ``travel_time``.
sv: Summan av alla ``travel_time``.
zh_hans: 所有 ``travel_time`` 的总和。

source: ``arrival_time``
sv: ankomsttid

source: Time spent waiting for current location to open.
sv: Tidsåtgång för att vänta på att den aktuella platsen ska öppnas.
zh_hans: 等待当前位置打开所花费的时间。

source: ``wait_time``
sv: ``Vänta_tid``

source: Summary row has the **total waiting time**:
sv: Sammanfattning rad har **total väntetid**:
zh_hans: 摘要行包含**总等待时间**：

source: The sum of all the ``wait_time``.
sv: Summan av alla ``wait_time``.
zh_hans: 所有 ``wait_time`` 的总和。

source: ``service_time``
sv: ``service_tid``

source: Service duration at current location.
sv: Servicens varaktighet på den aktuella platsen.
zh_hans: 当前位置的服务持续时间。

source: Summary row has the **total service time**:
sv: Sammanfattningsraden har **total servicetid**:
zh_hans: 摘要行包含**总服务时间**：

source: The sum of all the ``service_time``.
sv: Summan av alla ``service_time``.
zh_hans: 所有``service_time``的总和。

source: ``departure_time``
sv: tidpunkt för avresa

source: The time at which the vehicle departs from the stop.
sv: Den tidpunkt då fordonet avgår från hållplatsen.
zh_hans: 车辆离开车站的时间。

source: The ending location has the **total time** used by the current vehicle.
sv: Slutplatsen har den **totala tid** som använts av det aktuella fordonet.
zh_hans: 结束位置有当前车辆使用的**总时间**。

source: Summary row has the **total solution time**:
sv: Sammanfattningsraden har den **totala lösningstiden**:
zh_hans: 摘要行包含**总解决问题时间**：

source: Summary Row
sv: Sammanfattande rad
zh_hans: 摘要行

source: Continues the sequence
sv: Fortsätter sekvensen
zh_hans: 继续序列

source: **total capacity violations**:
sv: **överträdelser av total kapacitet**:
zh_hans: **总容量违规**：

source: **total time windows violations**:
sv: **Totalt antal överträdelser av tidsfönster**:
zh_hans: **总时间窗口违规**：

source: **total traveling time**:
sv: **total restid**:
zh_hans: **总行程时间**：

source: **total waiting time**:
sv: **total väntetid**:
zh_hans: **总行程时间**：

source: **total service time**:
sv: **total servicetid**:
zh_hans: **总服务时间**：

source: Handling Parameters
sv: Parametrar för hantering
zh_hans: 处理参数

source: To define a problem, several considerations have to be done, to get consistent results. This section gives an insight of how parameters are to be considered.
sv: För att definiera ett problem måste flera överväganden göras för att få konsekventa resultat. Detta avsnitt ger en inblick i hur parametrar ska beaktas.
zh_hans: 要定义问题，必须考虑多种因素才能获得一致的结果。 本节深入了解如何考虑参数。

source: `Capacity and Demand Units Handling`_
sv: "Hantering av enheter för kapacitet och efterfrågan
zh_hans: `容量和需求单位处理`_

source: `Locations`_
sv: `Lokaliseringar`_
zh_hans: `位置`_

source: `Time Handling`_
sv: tidshantering
zh_hans: `时间处理`_

source: `Factor Handling`_
sv: "Faktorhantering
zh_hans: `因素处理`_

source: Capacity and Demand Units Handling
sv: Hantering av kapacitets- och efterfrågeenheter
zh_hans: 容量和需求单位处理

source: The `capacity` of a vehicle, can be measured in:
sv: Ett fordons "kapacitet" kan mätas i:
zh_hans: 车辆的`容量`可以通过以下方式测量：

source: Volume units like :math:`m^3`.
sv: Volymenheter som :math:`m^3`.
zh_hans: 体积单位如:math:`m^3`。

source: Area units like :math:`m^2` (when no stacking is allowed).
sv: Areaenheter som :math:`m^2` (när ingen stapling är tillåten).
zh_hans: 面积单位如:math:`m^2`（不允许堆叠时）。

source: Weight units like :math:`kg`.
sv: Viktenheter som :math:`kg`.
zh_hans: 重量单位如:math:`kg`。

source: Number of boxes that fit in the vehicle.
sv: Antal lådor som får plats i fordonet.
zh_hans: 车辆内可容纳的箱子数量。

source: Number of seats in the vehicle
sv: Antal sittplatser i fordonet
zh_hans: 车内座位数

source: The `demand` request of the pickup-deliver orders must use the same units as the units used in the vehicle's `capacity`.
sv: Begäran om hämtnings- och leveransorder måste använda samma enheter som de enheter som används i fordonets "kapacitet".
zh_hans: 取货-送货订单的`需求`请求必须使用与车辆`容量`中使用的单位相同的单位。

source: To handle problems like: 10 (equal dimension) boxes of apples and 5 kg of feathers that are to be transported (not packed in boxes).
sv: För att hantera problem som t.ex: 10 (lika stora) lådor med äpplen och 5 kg fjädrar som ska transporteras (inte packas i lådor).
zh_hans: 处理以下问题：10 箱（尺寸相等）苹果和 5 千克羽毛的运输（不装箱）。

source: If the vehicle's **capacity** is measured in `boxes`, a conversion of `kg of feathers` to `number of boxes` is needed.
sv: Om fordonets **kapacitet** mäts i `lådor`, behövs en omvandling av `kg fjädrar` till `antal lådor`.
zh_hans: 如果车辆的 **容量**以`箱子`来衡量，则需要将`羽毛的千克`换算为`箱子的数量`。

source: If the vehicle's **capacity** is measured in `kg`, a conversion of `box of apples` to `kg` is needed.
sv: Om fordonets **kapacitet** mäts i `kg`, krävs en omvandling av `låda äpplen` till `kg`.
zh_hans: 如果车辆的**容量**以`kg`为单位，则需要将`一箱苹果`换算为`kg`。

source: Showing how the 2 possible conversions can be done
sv: Visar hur de 2 möjliga konverteringarna kan göras
zh_hans: 显示如何完成两种可能的转换

source: Let: - :math:`f\_boxes`: number of boxes needed for `1` kg of feathers. - :math:`a\_weight`: weight of `1` box of apples.
sv: Låt: - :math:`f\_boxes`: antal boxar som behövs för `1` kg fjädrar. - :math:`a\_weight`: vikten på `1` låda med äpplen.
zh_hans: 设：- :math:`f\_boxes`：`1`公斤羽毛所需的箱子数量。- :math:`a\_weight`：`1`箱子苹果的重量。

source: Capacity Units
sv: Kapacitetsenheter
zh_hans: 容量单位

source: apples
sv: äpplen
zh_hans: 苹果

source: feathers
sv: fjädrar
zh_hans: 羽毛

source: boxes
sv: lådor
zh_hans: 箱子

source: Locations
sv: Platser
zh_hans: 位置

source: When using :doc:`pgr_pickDeliverEuclidean`:
sv: När du använder :doc:`pgr_pickDeliverEuclidean`:
zh_hans: 当使用 :doc:`pgr_pickDeliverEuclidean`：

source: The vehicles have :math:`(x, y)` pairs for start and ending locations.
sv: Fordonen har :math:`(x, y)`-par för start- och slutplatser.
zh_hans: 车辆有起点和终点:math:`(x, y)`对。

source: The orders Have :math:`(x, y)` pairs for pickup and delivery locations.
sv: Beställningarna har :math:`(x, y)`-par för upphämtnings- och leveransplatser.
zh_hans: 订单有取货和送货地点:math:`(x, y)`对。

source: When using :doc:`pgr_pickDeliver`:
sv: När du använder :doc:`pgr_pickDeliver`:
zh_hans: 当使用:doc:`pgr_pickDeliver`:

source: The vehicles have identifiers for the start and ending locations.
sv: Fordonen har identifierare för start- och slutplatserna.
zh_hans: 车辆具有起始位置和结束位置的标识符。

source: The orders have identifiers for the pickup and delivery locations.
sv: Beställningarna har identifierare för upphämtnings- och leveransplatserna.
zh_hans: 订单具有取货和送货地点的标识符。

source: All the identifiers are indices to the given matrix.
sv: Alla identifierare är index till den givna matrisen.
zh_hans: 所有标识符都是给定矩阵的索引。

source: Time Handling
sv: Tidshantering
zh_hans: 时间处理

source: The times are relative to **0**. All time units have to be converted to a **0** reference and the same time units.
sv: Tiderna är relativa till **0**. Alla tidsenheter måste konverteras till en referens på **0** och samma tidsenheter.
zh_hans: 时间是相对于 **0** 的。所有时间单位都必须转换为 **0** 参考和相同的时间单位。

source: Suppose that a vehicle's driver starts the shift at 9:00 am and ends the shift at 4:30 pm and the service time duration is 10 minutes with 30 seconds.
sv: Anta att en fordonsförare börjar sitt skift kl. 9.00 och slutar kl. 16.30 och att servicetiden är 10 minuter och 30 sekunder.
zh_hans: 假设车辆驾驶员上午 9:00 开始换班，下午 4:30 结束换班，服务时间为 10 分钟 30 秒。

source: Meaning of 0
sv: Betydelsen av 0
zh_hans: 0的含义

source: time units
sv: tidsenheter
zh_hans: 时间单位

source: 10 min 30 secs
sv: 10 min 30 sek

source: hours
sv: timmar
zh_hans: 小时

source: minutes
sv: minuter
zh_hans: 分钟

source: Factor handling
sv: Hantering av faktorer
zh_hans: 因素处理

source: ``factor`` acts as a multiplier to convert from distance values to time units the matrix values or the euclidean values.
sv: ``factor`` fungerar som en multiplikator för att konvertera matrisvärden eller euklidiska värden från avståndsvärden till tidsenheter.
zh_hans: `因子``充当乘数，将距离值转换为时间单位、矩阵值或欧几里得值。

source: When the values are already in the desired time units
sv: När värdena redan är i önskad tidsenhet
zh_hans: 当值已处于所需时间单位时

source: ``factor`` should be **1**
sv: ``faktor`` bör vara **1**
zh_hans: ``因数``应为 **1**

source: When ``factor`` > 1 the travel times are faster
sv: När ``faktor`` > 1 är restiderna snabbare
zh_hans: 当``因子`` > 1 时，行程时间更快

source: When ``factor`` < 1 the travel times are slower
sv: När ``faktor`` < 1 är restiderna långsammare
zh_hans: 当 ``因子`` < 1 时，行程时间会变慢

source: For the :doc:`pgr_pickDeliverEuclidean`:
sv: För :doc:`pgr_pickDeliverEuclidean`:
zh_hans: 用于:doc:`pgr_pickDeliverEuclidean`:

source: Working with time units in seconds, and x/y in lat/lon: Factor: would depend on the location of the points and on the average velocity say 25m/s is the velocity.
sv: Arbeta med tidsenheter i sekunder och x/y i lat/lon: Faktor: skulle bero på punkternas läge och på medelhastigheten, säg att 25 m/s är hastigheten.
zh_hans: 使用以秒为单位的时间单位，以及以纬度/经度为单位的 x/y： 因子：取决于点的位置和平均速度，例如 25m/s 是速度。

source: Latitude
sv: Latitud
zh_hans: 纬度

source: Conversion
sv: Konvertering
zh_hans: 转换

source: Factor
sv: Faktor
zh_hans: 因素

source: 1 longitude degree is (78846.81m)/(25m/s)
sv: 1 longitudgrad är (78846,81m)/(25m/s)
zh_hans: 1经度为(78846.81m)/(25m/s)

source: 1 longitude degree is (111319.46 m)/(25m/s)
sv: 1 longitudgrad är (111319,46 m)/(25m/s)
zh_hans: 1经度为(111319.46 m)/(25m/s)

source: For the :doc:`pgr_pickDeliver`:
sv: För :doc:`pgr_pickDeliver`:
zh_hans: 用于:doc:`pgr_pickDeliver`:

source: Given :math:`v = d / t` therefore :math:`t = d / v` And the ``factor`` becomes :math:`1 / v`
sv: Med tanke på :math:`v = d / t` därför :math:`t = d / v` Och ``faktorn`` blir :math:`1 / v`
zh_hans: 给定 :math:`v = d / t` 因此:math:`t = d / v` 并且``因子``变为:math:`1 / v`

source: Velocity
sv: Hastighet
zh_hans: 速度

source: Distance
sv: Avstånd
zh_hans: 距离

source: Time
sv: Tid
zh_hans: 时间

source: For the following equivalences :math:`10m/s \approx 600m/min \approx 36 km/hr`
sv: För följande ekvivalenser :math:`10m/s \approx 600m/min \approx 36 km/tim`
zh_hans: 对于以下等价 :math:`10m/s \approx 600m/min \approx 36 km/hr`

source: Working with time units in seconds and the matrix been in meters: For a 1000m length value on the matrix:
sv: Arbeta med tidsenheter i sekunder och matrisen i meter: För ett 1000m längdvärde på matrisen:

source: Units
sv: Enheter
zh_hans: 单位

source: velocity
sv: hastighet
zh_hans: 速度

source: Result
sv: Resultat
zh_hans: 结果

source: seconds
sv: sekunder
zh_hans: 秒

source: Hours
sv: Timmar
zh_hans: 小时

source: A* - Family of functions
sv: A* - Familj av funktioner
zh_hans: A* - 函数族

source: The A* (pronounced "A Star") algorithm is based on Dijkstra's algorithm with a heuristic that allow it to solve most shortest path problems by evaluation only a sub-set of the overall graph.
sv: Algoritmen A* (uttalas "A Star") är baserad på Dijkstras algoritm med en heuristik som gör att den kan lösa de flesta problem med kortaste vägen genom att endast utvärdera en delmängd av den totala grafen.
zh_hans: A*（发音为“A星”）算法基于 Dijkstra 算法，其启发式算法使其能够通过仅评估整个图的子集来解决大多数最短路径问题。

source: The main Characteristics are:
sv: De viktigaste egenskaperna är:
zh_hans: 主要特点是：

source: Process works for directed and undirected graphs.
sv: Processen fungerar för riktade och oriktade grafer.
zh_hans: 流程适用于有向图和无向图。

source: Ordering is:
sv: Beställning är:
zh_hans: 顺序是
