Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Any other value will be considered as ``r``
zh_hans: 任何其他值将被视为 ``r``

source: Point :math:`-1` corresponds to the closest edge from point `(2.9,1.8)`.
zh_hans: 点 :math:`-1`对应于距离点 `(2.9,1.8)`最近的边。

source: Point :math:`-2` corresponds to the next close edge from point `(2.9,1.8)`.
zh_hans: 点 :math:`-2`对应于点`(2.9,1.8)` 的下一个闭合边。

source: pgr_trsp_withPoints - Proposed
zh_hans: pgr_trsp_withPoints - 拟议

source: ``pgr_trsp_withPoints`` (`One to One`_)
zh_hans: ``pgr_trsp_withPoints`` (`一对一`_)

source: ``pgr_trsp_withPoints`` (`One to Many`_)
zh_hans: ``pgr_trsp_withPoints`` (`一对多`_)

source: ``pgr_trsp_withPoints`` (`Many to One`_)
zh_hans: ``pgr_trsp_withPoints`` (`多对一`_)

source: ``pgr_trsp_withPoints`` (`Many to Many`_)
zh_hans: ``pgr_trsp_withPoints`` (`多对多`_)

source: ``pgr_trsp_withPoints`` (`Combinations`_)
zh_hans: ``pgr_trsp_withPoints`` (`组合`_)

source: Modify the graph to include points defined by points_sql. Using Dijkstra algorithm, find the shortest path(s)
zh_hans: 修改图以包括由points_sql 定义的点。 使用 Dijkstra 算法，找到最短路径

source: Driving side can not be ``b``
zh_hans: 驾驶侧不可能为 ``b``

source: The agg_cost the non included values (v, v) is 0
zh_hans: 不包含的值 (v, v) 的 agg_cost 为 0

source: The agg_cost the non included values (u, v) is ∞
zh_hans: 不包含的值 (u, v) 的 agg_cost 为 ∞

source: For optimization purposes, any duplicated value in the start_vids or end_vids are ignored.
zh_hans: 出于优化目的，start_vid 或 end_vid 中的任何重复值都将被忽略。

source: The returned values are ordered: - start_vid ascending - end_vid ascending
zh_hans: 返回值按以下顺序排列： - start_vid 升序 - end_vid 升序

source: From point :math:`1` to vertex :math:`10` with details on a left driving side configuration on a directed graph with details.
zh_hans: 从点 :math:`1`到顶点 :math:`10`，在有向图上显示左侧驾驶侧配置的详细信息。

source: From point :math:`1` to point :math:`3` and vertex :math:`7`.
zh_hans: 从点:math:`1`到点 :math:`3`和顶点 :math:`7`。

source: From point :math:`1` and vertex :math:`6` to point :math:`3`.
zh_hans: 从点:math:`1`和顶点 :math:`6`到点 :math:`3`。

source: From point :math:`1` and vertex :math:`6` to point :math:`3` and vertex :math:`1`.
zh_hans: 从点:math:`1`和顶点 :math:`6`到点 :math:`3`和顶点:math:`1`。

source: From point :math:`1` to vertex :math:`10` and from vertex :math:`6` to point :math:`3` with right side driving configuration.
zh_hans: 从点:math:`1`到顶点 :math:`10`以及从顶点 :math:`6`到点 :math:`3`，采用右侧驾驶配置。

source: Pass in front or visits.
zh_hans: 从前面经过或参观。

source: Which path (if any) passes in front of point :math:`6` or vertex :math:`11` with right side driving topology.
zh_hans: 哪条路径（如果有）通过右侧驱动拓扑的点 :math:`6`或顶点 :math:`11`前面。

source: Show details on undirected graph.
zh_hans: 显示无向图的详细信息。

source: From point :math:`1` and vertex :math:`6` to point :math:`3` to vertex :math:`1` on an undirected graph, with details.
zh_hans: 无向图上从点:math:`1`和顶点:math:`6`到点 :math:`3`到顶点 :math:`1` 的详细信息。

source: pgr_turnRestrictedPath - Experimental
zh_hans: pgr_turnRestrictedPath - 实验性

source: ``pgr_turnRestrictedPath`` Using Yen's algorithm Vertex -Vertex routing with restrictions
zh_hans: ``pgr_turnRestrictedPath``使用 Yen 算法顶点- 带限制的顶点路由

source: New experimental function
zh_hans: 新实验功能

source: From vertex :math:`3` to vertex :math:`8` on a directed graph
zh_hans: 有向图上从顶点 :math:`3`到顶点:math:`8`

source: From vertex :math:`3` to vertex :math:`8` on an undirected graph
zh_hans: 无向图中从顶点:math:`3`到顶点:math:`8`

source: From vertex :math:`3` to vertex :math:`8` with more alternatives
zh_hans: 从一个顶点 :math:`3`到另一个顶点 :math:`8`有更多的选择

source: pgr_vrpOneDepot - Experimental
zh_hans: pgr_vrpOneDepot -实验

source: ``pgr_withPoints`` - Proposed
zh_hans: ``pgr_withPoints`` -拟议

source: pgr_withPoints(Combinations)
zh_hans: pgr_withPoints（组合）

source: When the starting vertex and ending vertex are the same, there is no path. - The agg_cost the non included values (v, v) is 0
zh_hans: 当起始顶点和结束顶点相同时，就没有路径。 - 非包含值 (v, v) 的 agg_cost 为 0

source: When the starting vertex and ending vertex are the different and there is no path: - The agg_cost the non included values (u, v) is ∞
zh_hans: 当起始顶点和结束顶点不同并且没有路径时： - 不包含的值 (u, v) 的 agg_cost 为 ∞

source: From point :math:`1` to vertex :math:`10` with details
zh_hans: 从点 :math:`1`到顶点:math:`10`的细节

source: From point :math:`1` and vertex :math:`6` to point :math:`3`
zh_hans: 从点 :math:`1`和顶点 :math:`6`到点 :math:`3`

source: From point :math:`1` to vertex :math:`10`, and from vertex :math:`6` to point :math:`3` with **right** side driving.
zh_hans: 从点 :math:`1`到顶点 :math:`10`，以及从顶点 :math:`6` 到点:math:`3` ，**右侧**行驶。

source: Value in [``r``, ``l``, ``b``] indicating if the driving side is:
zh_hans: [``r``, ``l``, ``b``] 中的值指示驱动侧是否为：

source: ``r`` for right driving side.
zh_hans: ``r`` 代表右驾驶侧。

source: ``l`` for left driving side.
zh_hans: ``l``代表左驾驶侧。

source: ``b`` for both.
zh_hans: ``b``对于两者。

source: ``pgr_withPointsCost`` - Proposed
zh_hans: ``pgr_withPointsCost`` -拟议

source: ``pgr_withPointsCost`` - Calculates the shortest path and returns only the aggregate cost of the shortest path(s) found, for the combination of points given.
zh_hans: ``pgr_withPointsCost`` -对于给定的点组合，计算最短路径并仅返回找到的最短路径的总成本。

source: pgr_withPointsCost(Combinations)
zh_hans: pgr_withPointsCost（组合）

source: Modify the graph to include points defined by points_sql. Using Dijkstra algorithm, return only the aggregate cost of the shortest path(s) found.
zh_hans: 修改图以包括由points_sql 定义的点。 使用 Dijkstra 算法，仅返回找到的最短路径的总成本。

source: The returned values are in the form of a set of `(start_vid, end_vid, agg_cost)`.
zh_hans: 返回值的形式为一组`(start_vid, end_vid, agg_cost)`。

source: For optimization purposes, any duplicated value in the `start_vids` or `end_vids` is ignored.
zh_hans: 出于优化目的， `start_vids`或 `end_vids` 中的任何重复值都将被忽略。

source: Running time: :math:`O(| start\_vids | * (V \log V + E))`
zh_hans: 运行时间：:math:`O(| start\_vids | * (V \log V + E))`

source: From point :math:`1` to vertex :math:`10` with defaults
zh_hans: 使用默认值从点 :math:`1`到顶点:math:`10`

source: From point :math:`15` and vertex :math:`6` to point :math:`3` and vertex :math:`1`
zh_hans: 从点:math:`15`和顶点 :math:`6`到点 :math:`3` 和顶点:math:`1`

source: Identifier of the starting vertex or point.
zh_hans: 起始顶点或点的标识符。

source: When positive: is a vertex’s identifier.
zh_hans: 当为正时： 是顶点的标识符。

source: When negative: is a point’s identifier.
zh_hans: 当负数时：是点的标识符。

source: Identifier of the ending vertex or point.
zh_hans: 结束顶点或点的标识符。

source: ``pgr_withPointsCostMatrix`` - proposed
zh_hans: ``pgr_withPointsCostMatrix`` - 拟议

source: ``pgr_withPointsDD`` - Proposed
zh_hans: ``pgr_withPointsDD`` - 拟议

source: Point :math:`-1` corresponds to the closest edge from point :math:`(2.9,1.8)`.
zh_hans: 点:math:`-1`对应于距离点 :math:`(2.9,1.8)`最近的边。

source: Point :math:`-2` corresponds to the next close edge from point :math:`(2.9,1.8)`.
zh_hans: 点:math:`-2`对应于点 :math:`(2.9,1.8)`的下一个闭合边。

source: pgr_withPointsKSP - Proposed
zh_hans: pgr_withPointsKSP -拟议

source: Standarizing output columns to |nksp-result|
zh_hans: 标准化输出列为 |nksp-result|

source: ``pgr_withPointsKSP`` (One to One)
zh_hans: ``pgr_withPointsKSP`` (一对一)

source: ``pgr_withPointsKSP`` (One to Many)
zh_hans: ``pgr_withPointsKSP`` (一对多)

source: ``pgr_withPointsKSP`` (Many to One)
zh_hans: ``pgr_withPointsKSP`` (多对一)

source: ``pgr_withPointsKSP`` (Many to Many)
zh_hans: ``pgr_withPointsKSP`` (多对多)

source: ``pgr_withPointsKSP`` (Combinations)
zh_hans: ``pgr_withPointsKSP`` (组合)

source: Deprecated signature:
zh_hans: 已弃用的签名：

source: `Points SQL`_ query as described.
zh_hans: 按照描述的方式执行 `Points SQL`_ 查询。

source: ``pgr_withPointsVia`` - Proposed
zh_hans: ``pgr_withPointsVia`` -拟议

source: New **proposed** function ``pgr_withPointsVia`` (`One Via`_)
zh_hans: 新 **拟议**的函数 ``pgr_withPointsVia`` (`One Via`_)

source: Find the route that visits the vertices :math:`\{ -6, 15, -1\}` in that order on a **directed** graph.
zh_hans: 在**有向**图上按顺序访问顶点 :math:`\{ -6, 15, -1\}` 的路线。

source: :doc:`pgr_withPoints` - Route from/to points anywhere on the graph.
zh_hans: :doc:`pgr_withPoints` - 从/到图表上任意点的路线。

source: :doc:`pgr_withPointsCost` - Costs of the shortest paths.
zh_hans: :doc:`pgr_withPointsCost` - 最短路径的成本。

source: :doc:`pgr_withPointsCostMatrix` - Costs of the shortest paths.
zh_hans: :doc:`pgr_withPointsCostMatrix` - 最短路径的成本。

source: :doc:`pgr_withPointsKSP` - K shortest paths.
zh_hans: :doc:`pgr_withPointsKSP` -K 最短路径。

source: :doc:`pgr_withPointsDD` - Driving distance.
zh_hans: :doc:`pgr_withPointsDD` -行驶距离。

source: :doc:`pgr_withPointsVia` - Via routing
zh_hans: :doc:`pgr_withPointsVia` -通过路由

source: These proposed functions do not modify the database.
zh_hans: 这些拟议的功能不会修改数据库。

source: :doc:`pgr_degree` - Returns a set of vertices and corresponding count of incidet edges to the vertex.
zh_hans: :doc:`pgr_degree` -返回一组顶点以及该顶点对应的关联边数。

source: :doc:`pgr_extractVertices` - Extracts vertex information based on the edge table information.
zh_hans: :doc:`pgr_extractVertices` - 根据边表信息提取顶点信息。

source: :doc:`withPoints-family` - Functions based on Dijkstra algorithm.
zh_hans: :doc:`withPoints-family` -基于 Dijkstra 算法的函数。

source: pgRouting 3.6.0 Release Notes
zh_hans: pgRouting 3.6.0 发布说

source: `#2516 <https://github.com/pgRouting/pgrouting/pull/2516>`__ Standarize output pgr_aStar
zh_hans: `#2516 <https://github.com/pgRouting/pgrouting/pull/2516>`__标准化输出pgr_aStar

source: Developer mailing list: https://lists.osgeo.org/mailman/listinfo/pgrouting-dev
zh_hans: 开发者邮件列表：https://lists.osgeo.org/mailman/listinfo/pgrouting-dev

source: Topology - Family of Functions
zh_hans: Topology - 函数族

source: The pgRouting's topology of a network represented with a graph in form of two tables: and edge table and a vertex table.
zh_hans: pgRouting 的网络拓扑以两个表形式的图表示：边表和顶点表。

source: Attributes associated to the tables help to indicate if the graph is directed or undirected, if an edge is one way on a directed graph, and depending on the final application needs, suitable topology(s) need to be created.
zh_hans: 与表关联的属性有助于指示图是有向的还是无向的，边是否是有向图上的单向，并且根据最终应用程序的需要，需要创建合适的拓扑。

source: pgRouting suplies some functions to create a routing topology and to analyze the topology.
zh_hans: pgRouting 提供一些函数来创建路由拓扑并分析拓扑。

source: Additional functions to create a graph:
zh_hans: 创建图表的附加函数：

source: Additional functions to analyze a graph:
zh_hans: 用于分析图表的附加函数：

source: Transformation - Family of functions (Experimental)
zh_hans: Transformation - 函数族（实验）

source: Aditionaly there are 2 categories under this family
zh_hans: 此外，该家族下还有 2 个类别

source: In other words, find a continuos route that visits all the vertices in the order given.
zh_hans: 换句话说，找到一条按给定顺序访问所有顶点的连续路线。

source: **Used on:**
zh_hans: **用于:**

source: Used on all Via functions
zh_hans: 用于所有 Via 函数

source: Used on
zh_hans: 用于

source: For this section the following city (see :doc:`sampledata`) some interesing points such as restaurant, supermarket, post office, etc. will be used as example.
zh_hans: 对于本节，将使用以下城市（参见:doc:`示例数据`）一些有趣的点（例如餐馆、超市、邮局等）作为示例。

source: In the the folowwing images:
zh_hans: 在下面的图片中：

source: Prefered usage on **undirected** graphs
zh_hans: **无向**图上的首选用法

source: Problem
zh_hans: 问题

source: Arrival to point ``-2`` can be achived only via vertex **16**.
zh_hans: 只能通过顶点 **16**才能到达点 ``-2``。

source: Edge ``(-2, 17)`` with cost ``0.6`` (the remaing cost)
zh_hans: 边``(-2, 17)``的成本为``0.6``（剩余成本）

source: Arrival to point ``-2`` can be achived only via vertex **17**.
zh_hans: 只能通过顶点 **17 **才能到达点 ``-2`` 。

source: Arrival to point ``-2`` can be achived via vertices **16** or **17**.
zh_hans: 可以通过顶点 **16**或 **17**到达点 ``-2`` 。

source: pgr_withPoints is pgr_dijkstra **with points**
zh_hans: pgr_withPoints 是**带有点**的 pgr_dijkstra

source: pgr_withPointsCost is pgr_dijkstraCost **with points**
zh_hans: pgr_withPointsCost 是**带有点**的 pgr_dijkstraCost

source: pgr_withPointsCostMatrix is pgr_dijkstraCostMatrix **with points**
zh_hans: pgr_withPointsCostMatrix 是**带有点**的 pgr_dijkstraCostMatrix

source: pgr_withPointsKSP is pgr_ksp **with points**
zh_hans: pgr_withPointsKSP 是**带有点**的 pgr_ksp

source: pgr_withPointsDD is pgr_drivingDistance **with points**
zh_hans: pgr_withPointsDD 是**带有点**的 pgr_drivenDistance

source: pgr_withPointsvia is pgr_dijkstraVia **with points**
zh_hans: pgr_withPointsvia 是**带有点**的 pgr_dijkstraVia

source: :doc:`pgr_bdDijkstraCostMatrix` - Bidirectional Dijkstra algorithm to create a matrix of costs of the shortest paths.
zh_hans: :doc:`pgr_bdDijkstraCostMatrix` - 创建最短路径成本矩阵的双向 Dijkstra 算法。

source: The edges :math:`v \rightarrow w` and :math:`w \rightarrow z` are removed from the graph.
zh_hans: 从图中删除边 :math:`v \rightarrow w` 和 :math:`w \rightarrow z`。

source: The edges :math:`u \rightarrow v` and :math:`v \rightarrow z` are removed from the graph.
zh_hans: 从图中删除边 :math:`u \rightarrow v` 和 :math:`v \rightarrow z`。

source: :doc:`pgr_createTopology` - create a topology based on the geometry.
zh_hans: :doc:`pgr_createTopology` - 根据几何形状创建拓扑。

source: :doc:`pgr_analyzeGraph` - to analyze the edges and vertices of the edge table.
zh_hans: :doc:`pgr_analyzeGraph` - 分析边表的边和顶点。

source: :doc:`pgr_nodeNetwork` - to create nodes to a not noded edge table.
zh_hans: :doc:`pgr_nodeNetwork` -为无节点边表创建节点。

source: Also ``l`` could be used as **driving side**
zh_hans: 此外，``l`` 也可用作**行驶方向**

source: Returned on `Many to One`_ and `Many to Many`_
zh_hans: `多对一`_和 `多对多`_的返回值

source: Visualy, The first image is the `optimal solution <https://www.math.uwaterloo.ca/tsp/world/witour.html>`__ and the second image is the solution obtained with ``pgr_TSPeuclidean``.
zh_hans: 从视觉上看，第一幅图像是 `最优解 <https://www.math.uwaterloo.ca/tsp/world/witour.html>`__ ，第二幅图像是使用 ``pgr_TSPeuclidean``获得的解。

source: The edge table to be analyzed must contain a source column and a target column filled with id's of the vertices of the segments and the corresponding vertices table <edge_table>_vertices_pgr that stores the vertices information.
zh_hans: 待分析的边表必须包含源列和目标列，其中填充了线段顶点的id以及对应的存储顶点信息的顶点表<edge_table>_vertices_pgr。

source: ``text`` Target column name of the network table. Default value is ``target``.
zh_hans: ``text``网络表的Target列名称。 默认值为 ``target``。

source: ``text`` Condition to select a subset or rows. Default value is ``true`` to indicate all rows.
zh_hans: ``text`` 用于选择子集或行的条件。默认值为``true``，表示选择所有行。

source: Returns the analysis of the section of the network defined by ``rows_where``
zh_hans: 返回由``rows_where`` 定义的网络部分的分析结果

source: ``integer`` Indicator that the vertex might have a problem.
zh_hans: ``integer``指示顶点可能有问题。

source: ``boolean`` flag to treat oneway NULL values as bi-directional. Default value is ``true``.
zh_hans: ``boolean``将单向 NULL 值视为双向的标志。 默认值为 ``true``。

source: ``integer`` Indicator that the vertex might have a problem. See :doc:`pgr_analyzeGraph <pgr_analyzeGraph>`.
zh_hans: ``integer``指示顶点可能有问题。 请参阅 :doc:`pgr_analyzeGraph <pgr_analyzeGraph>`。

source: It is well-known that the shortest paths between a single source and all other vertices can be found using Breadth First Search in :math:`O(|E|)` in an unweighted graph, i.e. the distance is the minimal number of edges that you need to traverse from the source to another vertex. We can interpret such a graph also as a weighted graph, where every edge has the weight :math:`1`. If not alledges in graph have the same weight, that we need a more general algorithm, like Dijkstra's Algorithm which runs in :math:`O(|E|log|V|)` time.
zh_hans: 众所周知，在无权重图中，使用广度优先搜索（Breadth First Search）可以在 :math:`O(|E|)`内找到单个源点与所有其他顶点之间的最短路径，也就是说，距离是指从源点到另一个顶点所需的最少边数。我们也可以把这样的图解释为加权图，其中每条边的权重为 :math:`1`。如果图中不是所有边的权重都相同，我们就需要一种更通用的算法，比如 Dijkstra 算法，它的运行时间为 :math:`O(|E|log|V||)`。

source: ``text`` Condition to SELECT a subset or rows. Default value is ``true`` to indicate all rows that where ``source`` or ``target`` have a null value, otherwise the condition is used.
zh_hans: ``text`` 用于选择行的条件。默认值为``true`` ，表示选择所有具有空值的 ``source``或``target`` 的行，否则将使用指定的条件。

source: ``boolean`` Clean any previous topology. Default value is ``false``.
zh_hans: ``boolean`` 清除先前的拓扑。默认值为 ``false``。

source: ``integer`` Indicator that the vertex might have a problem. See :doc:`pgr_analyzeGraph`.
zh_hans: ``integer``指示顶点可能有问题。 请参阅 :doc:`pgr_analyzeGraph`。

source: The reconstruction of the vertices table function accepts the following parameters:
zh_hans: 顶点表重建函数接受以下参数：

source: ``text`` Condition to SELECT a subset or rows. Default value is ``true`` to indicate all rows.
zh_hans: ``text`` 用于选择行的条件。默认值为 ``true`` 表示选择所有行。

source: :doc:`topology-functions` for an overview of a topology for routing algorithms.
zh_hans: :doc:`topology-functions`用于路由算法的拓扑概述。

source: pgr_drivingDistance(`Edges SQL`_, **Root vid**, **distance**, [``directed``])
zh_hans: pgr_bdDijkstra(`Edges SQL`_, **start vid**, **end vids**, [``directed``])

source: ``pgr_hawickCircuits`` — Returns the list of cirucits using hawick circuits algorithm.
zh_hans: ``pgr_hawickCircuits`` — 使用 Hawick 回路算法返回回路列表。

source: The output table will have for ``edge_table_noded``
zh_hans: 输出表中将包含``edge_table_noded``内容

source: From point :math:`15` and vertex :math:`6` to point :math:`3` and vertex :math:`1`
zh_hans: 从点 :math:`15` 和顶点 :math:`6` 到点 :math:`3` 和顶点 :math:`1`

source: Returns set of ``(edge_id, color_id)``
zh_hans: 返回 ``(edge_id, color_id)`` 的集合

source: Be aware of the existance of the additional result Columns.
zh_hans: 注意附加结果列的存在。

source: :doc:`sampledata`: a small graph used in the documentation examples
zh_hans: :doc:`sampledata`: 文档示例中使用的小图形

source: Capacity information, used in the :doc:`flow-family` functions does not need to change when splitting edges.
zh_hans: 分割边时，在 :doc:`flow-family` 函数中使用的容量信息不需要改变。

source: Result columns for a path
zh_hans: 路径的结果列

source: Used in functions that return one path solution
zh_hans: 在返回一个路径解的函数中使用

source: Result columns standarized to: |nksp-result|
zh_hans: 结果列标准化为|nksp-result|

source: Returns set of |old-generic-result|
zh_hans: 返回 |old-generic-result| 的集合

source: Returns set of |result-1-1|
zh_hans: 返回 |result-1-1| 的集合

source: Returns set of |result-1-m|
zh_hans: 返回 |result-1-m| 的集合

source: Returns set of |result-m-1|
zh_hans: 返回 |result-m-1| 的集合

source: Returns set of |result-bfs|
zh_hans: 返回 |result-bfs| 的集合

source: We get the sameresult as the simplest way to use the function.
zh_hans: 我们得到的结果与使用该函数的最简单方法相同。

source: Returns set of |result-disjoint-1-1|
zh_hans: 返回 |result-disjoint-1-1|的集合

source: Returns set of |result-disjoint-1-m|
zh_hans: 返回|result-disjoint-1-m|的集合

source: Returns set of |result-disjoint-m-m|
zh_hans: 返回|result-disjoint-m-m|的集合

source: Before image
zh_hans: 图片前

source: After image
zh_hans: 图像后

source: Returns set of |ksp-result|
zh_hans: 返回 |ksp-result| 的集合

source: Returns set of |old-pid-result|
zh_hans: 返回 |old-pid-result| 的集合

source: Returns set of |pid-1-m|
zh_hans: 返回 |pid-1-m| 的集合

source: Returns set of |pid-m-1|
zh_hans: 返回 |pid-m-1| 的集合

source: Returns set of |pid-m-m|
zh_hans: 返回 |pid-m-m| 的集合

source: Returns set of |matrix-pid|
zh_hans: 返回|matrix-pid|的集合

source: ``text`` Network table name. (may contain the schema name AS well)
zh_hans: ``text``网络表名称。（可能包括模式名称）

source: When the arguments are given in the order described:
zh_hans: 当参数按描述的顺序给出时：

source: We get the same result AS the simplest way to use the function.
zh_hans: 我们得到与使用该函数的最简单方法相同的结果。

source: The vertices table is a requierment of the :doc:`pgr_analyzeGraph` and the :doc:`pgr_analyzeOneWay` functions.
zh_hans: 顶点表是 :doc:`pgr_analyzeGraph`和 :doc:`pgr_analyzeOneWay` 函数的必需条件。

source: The results can be used as base code to make a refinement based on the back end development needs.
zh_hans: 结果可以作为基础代码，根据后端开发需求进行细化。

source: The subway stations are on the following vertices :math:`\{ 1, 10, 11\}`
zh_hans: 地铁站位于以下顶点上 :math:``{ 1, 10, 11\}`

source: RETURNS SET OF |via-result|
zh_hans: 返回 |via-result| 的集合

source: Weight of the edge (``source``, ``target``)
zh_hans: 边(``source``, ``target``)的权重

source: ``text`` Geometry column name of the network table. Default value is ``the_geom``.
zh_hans: ``text``网络表的几何列名称。 默认值为 ``the_geom``。

source: ``text`` Primary key column name of the network table. Default value is ``id``.
zh_hans: ``text``网络表的主键列名称。 默认值为``id``。

source: From vertex :math:`6` to vertex :math:`10` on a **directed** graph
zh_hans: 在**有向**图上从顶点 :math:`6`到顶点 :math:`10`

source: From point :math:`1` and vertex :math:`6` to point :math:`3` and vertex :math:`1`
zh_hans: 从点 :math:`1`和顶点 :math:`6`到点:math:`3`和顶点 :math:`1`
