Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Point **1** located on edge ``(6, 5)``
sv: Punkt **1** belägen på kanten ``(6, 5)``
zh_hans: 点** 1 **位于边``(6, 5)``

source: Point **2** located on edge ``(16, 17)``
sv: Punkt **2** belägen på kanten ``(16, 17)``
zh_hans: 点** 2 **位于边缘 ``(16, 17)``

source: Point **3** located on edge ``(8, 12)``
sv: Punkt **3** belägen på kanten ``(8, 12)``
zh_hans: 点 **3** 位于边缘``(8, 12)``

source: Point **4** located on edge ``(1, 3)``
sv: Punkt **4** belägen på kanten ``(1, 3)``
zh_hans: 点 **4 **位于边 ``(1, 3)``

source: Point **5** located on edge ``(10, 11)``
sv: Punkt **5** belägen på kanten ``(10, 11)``
zh_hans: 点 **5** 位于边缘 ``(10, 11)``

source: Point **6** located on edges ``(6, 7)`` and ``(7, 6)``
sv: Punkt **6** belägen på kanterna ``(6, 7)`` och ``(7, 6)``
zh_hans: 点** 6** 位于边``(6, 7)``和``(7, 6)``

source: Point **1** located on edge ``(5, 6)``
sv: Punkt **1** belägen på kanten ``(5, 6)``
zh_hans: 点 **1 **位于边 ``(5, 6)``

source: Point **2** located on edge ``(17, 16)``
sv: Punkt **2** belägen på kanten ``(17, 16)``
zh_hans: 点** 2** 位于边 ``(17, 16)``

source: Point **4** located on edge ``(3, 1)``
sv: Punkt **4** belägen på kanten ``(3, 1)``
zh_hans: 点 4 位于边``(3, 1)``

source: Like having all points to be considered in both sides ``b``
sv: Som att ha alla punkter att överväga på båda sidor ``b``
zh_hans: 就像双方都要考虑所有点 ``b``

source: Preferred usage on **undirected** graphs
sv: Företrädesvis användning på **undirected** grafer

source: On the :doc:`TRSP-family` this option is not valid
sv: På :doc:`TRSP-family` är detta alternativ inte giltigt
zh_hans: 在 :doc:`TRSP-family`上，此选项无效

source: Point **1** located on edge ``(5, 6)`` and ``(6, 5)``
sv: Punkt **1** belägen på kanten ``(5, 6)`` och ``(6, 5)``
zh_hans: 点**1**位于边``(5, 6)``和 ``(6, 5)``

source: Point **2** located on edge ``(17, 16)``and ``16, 17``
sv: Punkt **2** belägen på kanten ``(17, 16)`` och ``16, 17``
zh_hans: 点**2**位于边``(17, 16)``和 ``16, 17``

source: Point **4** located on edge ``(3, 1)`` and ``(1, 3)``
sv: Punkt **4** belägen på kanten ``(3, 1)`` och ``(1, 3)``
zh_hans: 点 **4**位于边``(3, 1)``和``(1, 3)``

source: Creating temporary vertices
sv: Skapa tillfälliga vertikaler
zh_hans: 创建临时顶点

source: This section will demonstrate how a temporary vertex is created internally on the graph.
sv: I detta avsnitt visas hur ett tillfälligt toppunkt skapas internt i grafen.
zh_hans: 本节将演示如何在图内部创建临时顶点。

source: For edge:
sv: För kant:
zh_hans: 对于边:

source: insert point:
sv: infoga punkt:
zh_hans: 插入点：

source: On a right hand side driving network
sv: På ett körfält med höger sida
zh_hans: 在右侧行驶网络

source: Arrival to point ``-2`` can be achieved only via vertex **16**.
sv: Ankomst till punkt ``-2`` kan endast ske via toppunkt **16**.

source: Does not affects edge ``(17, 16)``, therefore the edge is kept.
sv: Påverkar inte kanten ``(17, 16)``, därför behålls kanten.
zh_hans: 不影响边``(17, 16)``，因此边被保留。

source: It only affects the edge ``(16, 17)``, therefore the edge is removed.
sv: Det påverkar bara kanten ``(16, 17)``, därför tas kanten bort.
zh_hans: 它只影响边``(16, 17)``，因此边被移除。

source: Create two new edges:
sv: Skapa två nya kanter:
zh_hans: 创建两条新边：

source: Edge ``(16, -2)`` with cost ``0.4`` (original cost * fraction == :math:`1 * 0.4`)
sv: Kant ``(16, -2)`` med kostnad ``0.4`` (ursprunglig kostnad * fraktion == :math:`1 * 0.4`)
zh_hans: 边``(16, -2)``的成本为``0.4``（原始成本*分数==:math:`1 * 0.4`）

source: Edge ``(-2, 17)`` with cost ``0.6`` (the remaining cost)
sv: Kant ``(-2, 17)`` med kostnad ``0,6`` (den återstående kostnaden)

source: The total cost of the additional edges is equal to the original cost.
sv: Den totala kostnaden för de extra kanterna är lika stor som den ursprungliga kostnaden.
zh_hans: 附加边的总成本等于原始成本。

source: If more points are on the same edge, the process is repeated recursevly.
sv: Om fler punkter ligger på samma kant upprepas processen om och om igen.
zh_hans: 如果同一条边上有更多点，则递归地重复该过程。

source: On a left hand side driving network
sv: På en vänster sida av körfältet
zh_hans: 在左侧驾驶网络上

source: Arrival to point ``-2`` can be achieved only via vertex **17**.
sv: Ankomst till punkt ``-2`` kan endast ske via toppunkt **17**.

source: Does not affects edge ``(16, 17)``, therefore the edge is kept.
sv: Påverkar inte kanten ``(16, 17)``, därför behålls kanten.
zh_hans: 不影响边 ``(16, 17)``，因此保留边。

source: It only affects the edge ``(17, 16)``, therefore the edge is removed.
sv: Det påverkar bara kanten ``(17, 16)``, därför tas kanten bort.
zh_hans: 它只影响边 ``(17, 16)``，因此边被移除。

source: Work with the original edge ``(16, 17)`` as the fraction is a fraction of the original:
sv: Arbeta med den ursprungliga kanten ``(16, 17)`` eftersom bråkdelen är en bråkdel av den ursprungliga:
zh_hans: 使用原始边``(16, 17)``，因为分数是原始边的分数：

source: Flip the Edges and add them to the graph:
sv: Vänd på kanterna och lägg till dem i grafen:
zh_hans: 翻转边并将它们添加到图中：

source: Edge ``(17, -2)`` becomes ``(-2, 16)`` with cost ``0.4`` and is added to the graph.
sv: Kanten ``(17, -2)`` blir ``(-2, 16)`` med kostnaden ``0,4`` och läggs till i grafen.
zh_hans: 边 ``(17, -2)``变为 ``(-2, 16)``，成本为``0.4``，并添加到图中。

source: Edge ``(-2, 16)`` becomes ``(17, -2)`` with cost ``0.6`` and is added to the graph.
sv: Kanten ``(-2, 16)`` blir ``(17, -2)`` med kostnaden ``0,6`` och läggs till i grafen.
zh_hans: 边 ``(-2, 16)`` 变为 ``(17, -2)``，成本为 ``0.6``，并添加到图中。

source: When driving side does not matter
sv: När körsidan inte spelar någon roll
zh_hans: 当驾驶侧无关紧要时

source: Arrival to point ``-2`` can be achieved via vertices **16** or **17**.
sv: Ankomst till punkt ``-2`` kan uppnås via topparna **16** eller **17**.

source: Affects the edges ``(16, 17)`` and ``(17, 16)``, therefore the edges are removed.
sv: Påverkar kanterna ``(16, 17)`` och ``(17, 16)``, därför tas kanterna bort.
zh_hans: 影响边 ``(16, 17)`` 和 ``(17, 16)``，因此边被移除。

source: Create four new edges:
sv: Skapa fyra nya kanter:
zh_hans: 创建四个新边：

source: Flip the Edges and add all the edges to the graph:
sv: Vänd på Edges och lägg till alla kanter i grafen:
zh_hans: 翻转边并将所有边添加到图中：

source: Edge ``(16, -2)`` is added to the graph.
sv: Kanten ``(16, -2)`` läggs till i grafen.
zh_hans: 边 ``(16, -2)``被添加到图中。

source: Edge ``(-2, 17)`` is added to the graph.
sv: Kanten ``(-2, 17)`` läggs till i grafen.
zh_hans: 边``(-2, 17)``被添加到图中。

source: Edge ``(16, -2)`` becomes ``(-2, 16)`` with cost ``0.4`` and is added to the graph.
sv: Kanten ``(16, -2)`` blir ``(-2, 16)`` med kostnaden ``0,4`` och läggs till i grafen.
zh_hans: 边 ``(16, -2)``变为 ``(-2, 16)``，成本为 0.4，并添加到图中。

source: Edge ``(-2, 17)`` becomes ``(17, -2)`` with cost ``0.6`` and is added to the graph.
sv: Kanten ``(-2, 17)`` blir ``(17, -2)`` med kostnaden ``0,6`` och läggs till i grafen.
zh_hans: 边``(-2, 17)``变为``(17, -2)``，成本为``0.6``，并添加到图中。

source: withPoints - Family of functions
sv: withPoints - Familj av funktioner
zh_hans: withPoints -函数族

source: This family of functions belongs to the :doc:`withPoints-category` and the functions that compose them are based one way or another on dijkstra algorithm.
sv: Denna familj av funktioner tillhör :doc:`withPoints-category` och de funktioner som ingår i dem är på ett eller annat sätt baserade på dijkstra-algoritmen.
zh_hans: 这一系列函数属于:doc:`withPoints-category`，组成它们的函数以某种方式基于 dijkstra 算法。

source: Depending on the name:
sv: Beroende på namnet:
zh_hans: 取决于名称：

source: Parameter
zh_hans: 参数

source: Result Columns
zh_hans: 结果列

source: Returns SET OF ``(seq, depth, start_vid, node, edge, cost, agg_cost)``
zh_hans: 返回一组``(seq, depth, start_vid, node, edge, cost, agg_cost)``

source: Proposed
zh_hans: 建议

source: :doc:`pgr_depthFirstSearch` - Depth first search traversal of the graph.
zh_hans: :doc:`pgr_depthFirstSearch` - 图的深度优先搜索遍历。

source: :doc:`pgr_KSP` - Yen's algorithm based on pgr_dijkstra
zh_hans: :doc:`pgr_KSP` - 基于 pgr_dijkstra 的 Yen 算法

source: :doc:`pgr_withPointsKSP` - Yen's algorithm based on pgr_withPoints
zh_hans: :doc:`pgr_withPointsKSP` - 基于 pgr_withPoints 的 Yen 算法

source: :doc:`pgr_trsp` - Vertex - Vertex routing with restrictions.
zh_hans: :doc:`pgr_trsp` - Vertex - 有限制的顶点路由。

source: :doc:`pgr_trspVia` - Via Vertices routing with restrictions.
zh_hans: :doc:`pgr_trspVia` - 有限制的通过顶点路由。

source: :doc:`pgr_trsp_withPoints` - Vertex/Point routing with restrictions.
zh_hans: :doc:`pgr_trsp_withPoints` - 有限制的顶点/点路由。

source: :doc:`pgr_trspVia_withPoints` - Via Vertex/point routing with restrictions.
zh_hans: :doc:`pgr_trspVia_withPoints` - 通过有限制的顶点/点路由。

source: Read the :doc:`migration` about how to migrate from the deprecated TRSP functionality to the new signatures or replacement functions.
zh_hans: 阅读 :doc:`migration` 了解如何从已弃用的 TRSP 功能迁移到新的签名或替换功能。

source: Experimental
zh_hans: 实验性的

source: Might need a lot of feedback from the comunity.
zh_hans: 可能需要社区的大量反馈。

source: :doc:`pgr_turnRestrictedPath` - Routing with restrictions.
zh_hans: :doc:`pgr_turnRestrictedPath` - 有限制的路由。

source: :doc:`pgr_TSP` - When input is given as matrix cell information.
zh_hans: :doc:`pgr_TSP`- 当输入作为矩阵单元信息给出时。

source: :doc:`pgr_TSPeuclidean` - When input are coordinates.
zh_hans: :doc:`pgr_TSPeuclidean` - 当输入是坐标时。

source: A discussion about the work of Hamilton & Kirkman can be found in the book **Graph Theory (Biggs et al. 1976)**.
zh_hans: 关于Hamilton和Kirkman的工作的讨论可以在**《图论》（Biggs等人，1976年）**一书中找到。

source: And :math:`n-2` choices for the third city, etc.
zh_hans: 以及第三个城市有:math:`n-2`个选择等。

source: Multiplying these together we get :math:`(n-1)! = (n-1) (n-2) . . 1`.
zh_hans: 将它们相乘我们得到:math:`(n-1)! = (n-1) (n-2) . . 1`。

source: Implementation generates solutions that *are twice as long as the optimal tour in the worst case* when:
zh_hans: *在最坏的情况下，实施产生的解决方案的时间是最佳旅行的两倍*：

source: On an undirected graph:
zh_hans: 在无向图上：

source: `Boost's metric appro's metric approximation <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__
zh_hans: `Boost 的 metric appro 的 metric 近似 <https://www.boost.org/libs/graph/doc/metric_tsp_approx.html>`__

source: Vehicle Routing Functions - Category (Experimental)
zh_hans: 车辆路由功能 - 类别（实验）

source: :doc:`pgr_pickDeliver` - Pickup & Delivery using a Cost Matrix
zh_hans: :doc:`pgr_pickDeliver` - 使用成本矩阵的取货&送货

source: :doc:`pgr_pickDeliverEuclidean` - Pickup & Delivery with Euclidean distances
zh_hans: :doc:`pgr_pickDeliverEuclidean` - 使用欧几里得距离的取货&送货

source: :doc:`pgr_vrpOneDepot` - From a single depot, distributes orders
zh_hans: :doc:`pgr_vrpOneDepot` - 从单个仓库分发订单

source: Pick & Delivery
zh_hans: 取货 & 送货

source: :math:`x` value of the pick up location
zh_hans: 取货地点的:math:`x`值

source: :math:`y` value of the pick up location
zh_hans: 取货地点的:math:`y`值

source: :math:`x` value of the delivery location
zh_hans: 送货地点的:math:`x`值

source: :math:`y` value of the delivery location
zh_hans: 送货地点的:math:`y` 值

source: :math:`x` value of the starting location
zh_hans: 起始位置的:math:`x`值

source: :math:`y` value of the starting location
zh_hans: 起始位置的:math:`y`值

source: :math:`x` value of the ending location
zh_hans: 结束位置的:math:`x`值

source: :math:`y` value of the ending location
zh_hans: 结束位置的:math:`y`值

source: Matrix SQL
zh_hans: 矩阵SQL

source: Sumary row has the **total capacity violations**.
zh_hans: 摘要行有**总容量违规情况**。

source: Sumary row has the **total time windows violations**.
zh_hans: 摘要行包含**总时间窗口违规情况**。

source: :math:`-1`: at the solution summary row
zh_hans: :math:`-1`: 在解决方案摘要行

source: :math:`1`: Starting location
zh_hans: :math:`1`: 起始位置

source: :math:`2`: Pickup location
zh_hans: :math:`2`: 取货位置

source: :math:`3`: Delivery location
zh_hans: :math:`3`: 送货位置

source: :math:`6`: Ending location and indicates the vehicle's summary row
zh_hans: :math:`6`: 结束位置并指示车辆的摘要行

source: :math:`-1`: at the solution summary row.
zh_hans: :math:`-1`: 在解决方案摘要行。

source: :math:`0`: at the starting location.
zh_hans: :math:`0`: 在起始位置。

source: To handle problems like: 10 (equal dimension) boxes of apples and 5 kg of feathers that are to be transported (not packed in boxes).
zh_hans: 处理这样的问题：10箱（等尺寸）苹果和5公斤羽毛需要运输（不装箱）。

source: kg
zh_hans: 千克

source: Working with time units in seconds and the matrix been in meters: For a 1000m lenght value on the matrix:
zh_hans: 使用以秒为单位的时间单位和以米为单位的矩阵：对于矩阵上的 1000m 长度值：

source: The queries use the :doc:`sampledata` network.
zh_hans: 查询使用:doc:`sampledata` 网络。

source: :doc:`pgr_aStar` - A* algorithm for the shortest path.
zh_hans: :doc:`pgr_aStar` - A* 最短路径算法。

source: :doc:`pgr_aStarCost` - Get the aggregate cost of the shortest paths.
zh_hans: :doc:`pgr_aStarCost` - 获取最短路径的总成本。

source: :doc:`pgr_aStarCostMatrix` - Get the cost matrix of the shortest paths.
zh_hans: :doc:`pgr_aStarCostMatrix` - 获取最短路径的成本矩阵。

source: aStar optional Parameters
zh_hans: aStar可选参数

source: Working with cost/reverse_cost as length in degrees, x/y in lat/lon: Factor = 1 (no need to change units)
zh_hans: 使用 cost/reverse_cost 作为长度（以度为单位），x/y 以纬度/经度为单位：因子 = 1（无需更改单位）

source: Working with cost/reverse_cost as length in meters, x/y in lat/lon: Factor = would depend on the location of the points:
zh_hans: 使用 cost/reverse_cost 作为以米为单位的长度，以纬度/经度为单位的 x/y： Factor = 将取决于点的位置：

source: 1 longitude degree is 78846.81 m
zh_hans: 1经度为78846.81 m

source: :doc:`pgr_floydWarshall` - Floyd-Warshall's algorithm.
zh_hans: :doc:`pgr_floydWarshall` - Floyd-Warshall 算法。

source: :doc:`pgr_johnson` - Johnson's algorithm
zh_hans: :doc:`pgr_johnson` - Johnson算法

source: The `agg_cost` of `(u, v)` is the same as for `(v, u)`.
zh_hans: `(u, v)` 的 `agg_cost` 与 `(v, u)`相同。

source: When `start_vid` = `end_vid`, the `agg_cost` = 0.
zh_hans: 当`start_vid` = `end_vid`时，`agg_cost`= 0。

source: posgreSQL version 9.3
zh_hans: postgreSQL 版本 9.3

source: Data
zh_hans: 数据

source: Test
zh_hans: 测试

source: :doc:`pgr_bdAstar` - Bidirectional A* algorithm for obtaining paths.
zh_hans: :doc:`pgr_bdAstar` - 获取路径的双向A*算法。

source: :doc:`pgr_bdAstarCost` - Bidirectional A* algorithm to calculate the cost of the paths.
zh_hans: :doc:`pgr_bdAstarCost` - 双向 A* 算法计算路径成本。

source: :doc:`pgr_bdAstarCostMatrix` - Bidirectional A* algorithm to calculate a cost matrix of paths.
zh_hans: :doc:`pgr_bdAstarCostMatrix` - 用于计算路径成本矩阵的双向 A* 算法。

source: It is expected to terminate faster than pgr_astar
zh_hans: 预计终止速度比 pgr_astar 更快

source: Previous versions of this page
zh_hans: 此页面的先前版本

source: :doc:`pgr_bdDijkstra` - Bidirectional Dijkstra algorithm for the shortest paths.
zh_hans: :doc:`pgr_bdDijkstra` - 最短路径的双向 Dijkstra 算法。

source: :doc:`pgr_bdDijkstraCost` - Bidirectional Dijkstra to calculate the cost of the shortest paths
zh_hans: :doc:`pgr_bdDijkstraCost` - 双向 Dijkstra 计算最短路径的成本

source: :doc:`pgr_bdDijkstraCostMatrix` - Bidirectional Dijkstra algorithm to create a matrix of costs of the shortest paths.
zh_hans: :doc:`pgr_bdDijkstraCostMatrix` - 双向 Dijkstra 算法创建最短路径成本矩阵。

source: :doc:`pgr_sequentialVertexColoring` - Vertex coloring algorithm using greedy approach.
zh_hans: :doc:`pgr_sequentialVertexColoring` - 顶点着色算法采用贪心法。

source: :doc:`pgr_bipartite` - Bipartite graph algorithm using a DFS-based coloring approach.
zh_hans: :doc:`pgr_bipartite` - 使用基于 DFS 的着色方法的二分图算法。

source: :doc:`pgr_edgeColoring` - Edge Coloring algorithm using Vizing's theorem.
zh_hans: :doc:`pgr_edgeColoring` - 使用 Vizing 定理的边缘着色算法。

source: Returns SET OF ``(vertex_id, color_id)``
zh_hans: 返回``(vertex_id, color_id)``的集合

source: Identifier of the color of the vertex.
zh_hans: 顶点颜色的标识符。

source: Returns SET OF ``(edge_id, color_id)``
zh_hans: 返回``(edge_id, color_id)``的集合

source: Identifier of the color of the edge.
zh_hans: 边颜色的标识符。

source: `Boost: Sequential Vertex Coloring algorithm documentation <https://www.boost.org/libs/graph/doc/sequential_vertex_coloring.html>`__
zh_hans: `Boost：顺序顶点着色算法文档 <https://www.boost.org/libs/graph/doc/sequential_vertex_coloring.html>`__

source: `Boost: Edge Coloring Algorithm documentation <https://www.boost.org/libs/graph/doc/edge_coloring.html>`__
zh_hans: `Boost：边缘着色算法文档 <https://www.boost.org/libs/graph/doc/edge_coloring.html>`__

source: `Wikipedia: Graph Coloring <https://en.wikipedia.org/wiki/Graph_coloring>`__
zh_hans: `维基百科：图着色 <https://en.wikipedia.org/wiki/Graph_coloring>`__

source: :doc:`pgr_connectedComponents` - Connected components of an undirected graph.
zh_hans: :doc:`pgr_connectedComponents` - 无向图的连通分量。

source: :doc:`pgr_strongComponents` - Strongly connected components of a directed graph.
zh_hans: :doc:`pgr_strongComponents` - 有向图的强连通分量。

source: :doc:`pgr_biconnectedComponents` - Biconnected components of an undirected graph.
zh_hans: :doc:`pgr_biconnectedComponents` - 无向图的双连通分量。

source: :doc:`pgr_articulationPoints` - Articulation points of an undirected graph.
zh_hans: :doc:`pgr_articulationPoints` - 无向图的铰接点。

source: :doc:`pgr_bridges` - Bridges of an undirected graph.
zh_hans: :doc:`pgr_bridges` - 无向图的桥。

source: :doc:`pgr_makeConnected` - Details of edges to make graph connected.
zh_hans: :doc:`pgr_makeConnected` - 使图形连接的边的详细信息。

source: In large graphs, like the road graphs, or electric networks, graph contraction can be used to speed up some graph algorithms. Contraction reduces the size of the graph by removing some of the vertices and edges and, for example, might add edges that represent a sequence of original edges decreasing the total time and space used in graph algorithms.
zh_hans: 在大型图中，例如道路图或电网，图收缩可用于加速某些图算法。 收缩通过删除一些顶点和边来减小图的大小，例如，可能会添加表示原始边序列的边，从而减少图算法中使用的总时间和空间。

source: This implementation gives a flexible framework for adding contraction algorithms in the future, currently, it supports two algorithms:
zh_hans: 该实现为将来添加收缩算法提供了灵活的框架，目前它支持两种算法：

source: Allowing the user to:
zh_hans: 允许用户：

source: Forbid contraction on a set of nodes.
zh_hans: 禁止在一组节点上收缩。

source: Decide the order of the contraction algorithms and set the maximum number of times they are to be executed.
zh_hans: 决定收缩算法的顺序并设置它们要执行的最大次数。

source: Contraction of the leaf nodes of the graph.
zh_hans: 图的叶节点的收缩。

source: A node is considered a **dead end** node when
zh_hans: 当一个节点被认为是**死端**节点时

source: There are no outgoing edges and has at least one incoming edge.
zh_hans: 没有传出边缘，但至少有一个传入边缘。

source: There are no incoming edges and has at least one outgoing edge.
zh_hans: 没有传入边缘，但至少有一个传出边缘。

source: When the conditions are true then the `Operation: Dead End Contraction`_ can be done.
zh_hans: 当条件成立时，可以进行当条件成立时，可以进行`操作: 死端收缩`_

source: The green nodes are `dead end`_ nodes
zh_hans: 绿色节点是`死端`_节点

source: The blue nodes have an unlimited number of edges.
zh_hans: 蓝色节点具有无限数量的边。

source: Adjecent nodes
zh_hans: 相邻节点

source: Number of adjacent nodes
zh_hans: 相邻节点数

source: Number of incoming edges
zh_hans: 传入边数

source: Number of outgoing edges
zh_hans: 传出边数

source: From above, nodes :math:`\{a, b, d\}` are dead ends because the number of adjacent vertices is 1. No further checks are needed for those nodes.
zh_hans: 从上面来看，节点:math:`\{a, b, d\}`是死端，因为相邻顶点的数量为 1。不需要对这些节点进行进一步检查。

source: On the following table, nodes :math:`\{c, e\}` because the even that the number of adjacent vertices is not 1 for
zh_hans: 下表中，节点 :math:`\{c, e\}`因为相邻顶点数不为1的偶数为

source: Operation: Dead End Contraction
zh_hans: 操作：死端收缩

source: The dead end contraction will stop until there are no more dead end nodes. For example from the following graph where :math:`w` is the `dead end`_ node:
zh_hans: 死端收缩将停止，直到不再有死端节点。 例如，从下图中，其中:math:`w`是`死端`_节点：

source: After contracting :math:`w`, node :math:`v` is now a `dead end`_ node and is contracted:
zh_hans: 收缩 :math:`w`后，节点:math:`v`现在是一个`死端`_ 节点并且已收缩：

source: After contracting :math:`v`, stop. Node :math:`u` has the information of nodes that were contrcted.
zh_hans: 在收缩:math:`v`之后，停止。节点:math:`u`有已收缩节点的信息。

source: Node :math:`u` has the information of nodes that were contracted.
zh_hans: 节点:math:`u`有已收缩节点的信息。

source: In the algorithm, linear contraction is represented by 2.
zh_hans: 算法中，线性收缩用2表示。

source: Linear
zh_hans: 线性

source: In case of an undirected graph, a node is considered a `linear` node when
zh_hans: 在无向图的情况下，当满足以下条件时，节点被视为`线性`节点：

source: Linear vertex on undirected graph
zh_hans: 无向图上的线性顶点

source: The green nodes are `linear`_ nodes
zh_hans: 绿色节点是`线性`_节点

source: The blue nodes have an unlimited number of incoming and outgoing edges.
zh_hans: 蓝色节点具有无限数量的传入和传出边缘。

source: Undirected
zh_hans: 无向

source: Linear vertex on directed graph
zh_hans: 有向图上的线性顶点

source: The white node is not linear because the linearity is not symetrical.
zh_hans: 白色节点不是线性的，因为线性不对称。

source: It is possible to go :math:`y \rightarrow c \rightarrow z`
zh_hans: 它是可能去走:math:`y \rightarrow c \rightarrow z`

source: It's not possible to go :math:`z \rightarrow c \rightarrow y`
zh_hans: 不可能走:math:`z \rightarrow c \rightarrow y`

source: Is symmetrical?
zh_hans: 是对称的吗？

source: yes
zh_hans: 是

source: no
zh_hans: 否

source: Operation: Linear Contraction
zh_hans: 操作：线性收缩

source: The linear contraction will stop when there are no more linear nodes. For example from the following graph where :math:`v` and :math:`w` are `linear`_ nodes:
zh_hans: 当不再有线性节点时，线性收缩将停止。 例如，在下图中，其中:math:`v`和:math:`w`是`线性`_节点：

source: Contracting :math:`w`,
zh_hans: 收缩:math:`w`，

source: The vertex :math:`w` is removed from the graph
zh_hans: 顶点 :math:`w`已从图中移除

source: The edges :math:`v \rightarrow w` and :math:`w \rightarrow z` are removed from the graph.
zh_hans: 边:math:`v \rightarrow w`和:math:`w \rightarrow z`已从图中移除。

source: A new edge :math:`v \rightarrow z` is inserted represented with red color.
zh_hans: 插入一条新边 :math:`v \rightarrow z`，以红色表示。

source: Contracting :math:`v`:
zh_hans: 收缩:math:`v`：

source: The vertex :math:`v` is removed from the graph
zh_hans: 顶点:math:`v`已从图中移除

source: The edges :math:`u \rightarrow v` and :math:`v \rightarrow z` are removed from the graph.
zh_hans: 边:math:`u \rightarrow v`和 :math:`v \rightarrow z`已从图中移除。

source: A new edge :math:`u \rightarrow z` is inserted represented with red color.
zh_hans: 插入一条新边:math:`u \rightarrow z`，以红色表示。

source: Edge :math:`u \rightarrow z` has the information of nodes that were contracted.
zh_hans: 边:math:`u \rightarrow z`有收缩点的信息。

source: Contracting a graph, can be done with more than one operation. The order of the operations affect the resulting contracted graph, after applying one operation, the set of vertices that can be contracted by another operation changes.
zh_hans: 收缩一张图可以通过多个操作来完成。 操作的顺序会影响生成的收缩图，在应用一个操作后，可以由另一操作收缩的顶点集会发生变化。

source: This implementation, cycles ``max_cycles`` times through ``operations_order`` .
zh_hans: 此实现通过``operations_order``循环 ``max_cycles`` 次。

source: Original Data
zh_hans: 原始数据

source: The following query shows the original data involved in the contraction operation.
zh_hans: 以下查询显示了收缩操作所涉及的原始数据。

source: Contraction results
zh_hans: 收缩结果

source: The results do not represent the contracted graph. They represent the changes done to the graph after applying the contraction algorithm.
zh_hans: 结果不代表收缩图。 它们表示应用收缩算法后对图所做的更改。

source: Adding extra columns to the ``edge_table`` and ``edge_table_vertices_pgr`` tables, where:
zh_hans: 向``edge_table`` 和``edge_table_vertices_pgr`` 表添加额外的列，其中：

source: Store the `contraction results`_ in a table
zh_hans: 将`收缩结果`_存储在表中

source: The vertex table update
zh_hans: 顶点表更新

source: Fill ``contracted_vertices`` with the information from the results tha belong to the vertices.
zh_hans: 使用属于顶点的结果中的信息填充``contracted_vertices``。

source: The modified vertices table:
zh_hans: 修改后的顶点表：

source: The edge table update
zh_hans: 边缘表更新

source: The modified ``edge_table``.
zh_hans: 修改后的``edge_table``。

source: Contracted graph
zh_hans: 收缩图

source: Using the contracted graph with ``pgr_dijkstra``
zh_hans: 将收缩图与 ``pgr_dijkstra`` 一起使用

source: Using the `Edges that belong to the contracted graph.`_ on lines 11 to 20.
zh_hans: 使用`属于收缩图的边。`_ 第 11 至 20 行。

source: Case 1
zh_hans: 情况1

source: When both source and target belong to the contracted graph, a path is found.
zh_hans: 当源和目标都属于收缩图时，就找到了一条路径。
