Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: **point**
sv: **punkt**

source: The point geometry
sv: Punktgeometri

source: **points**
sv: **punkter**

source: An array of point geometries
sv: En array av punktgeometrier

source: **tolerance**
sv: **tolerans**

source: Max distance between geometries
sv: Max avstånd mellan geometrier

source: Limit output rows
sv: Begränsa utmatningsraderna

source: When ``false`` calculations are performed.
sv: När ``falska`` beräkningar utförs.

source: When ``true`` calculations are not performed and the query to do the calculations is exposed in a PostgreSQL ``NOTICE``.
sv: När `` sanna`` beräkningar inte utförs och frågan för att göra beräkningarna exponeras i en PostgreSQL ``NOTICE``.

source: ``geometry``
sv: ``geometri``

source: The ``LINESTRING`` geometry of the edge.
sv: Geometri för ``LINESTRING`` på kanten.

source: When :math:`cap = 1`, it is the closest edge.
sv: När :math:`cap = 1` är det den närmaste kanten.

source: Value in <0,1> that indicates the relative position from the first end-point of the edge.
sv: Värde i <0,1> som anger den relativa positionen från den första ändpunkten på kanten.

source: Value in ``[r, l]`` indicating if the point is:
sv: Värde i ``[r, l]`` som indikerar om punkten är:

source: At the right ``r`` of the segment.
sv: På höger sida av segmentet.

source: When the point is on the line it is considered to be on the right.
sv: När punkten ligger på linjen anses den ligga till höger.

source: At the left ``l`` of the segment.
sv: På vänster sida av segmentet.

source: ``distance``
sv: ``avstånd``

source: Distance from the point to the edge.
sv: Avstånd från punkten till kanten.

source: Original ``POINT`` geometry.
sv: Ursprunglig ``POINT`` geometri.

source: ``LINESTRING`` geometry that connects the original **point** to the closest point of the edge with identifier ``edge_id``
sv: ``LINESTRING`` geometri som förbinder den ursprungliga **punkten** med den närmaste punkten på kanten med identifieraren ``edge_id``

source: One point in an edge
sv: En punkt i en kant

source: The green node is the original point.
sv: Den gröna noden är den ursprungliga punkten.

source: ``geom`` has the value of the original point.
sv: ``geom`` har värdet av den ursprungliga punkten.

source: The geometry ``edge`` is a line that connects the original point with the edge :math:`sp \rightarrow ep` edge.
sv: Geometrin ``kant`` är en linje som förbinder den ursprungliga punkten med kanten :math:`sp \rightarrow ep` kant.

source: The point is located at the left of the edge.
sv: Punkten är placerad till vänster om kanten.

source: One point dry run execution
sv: En punkts provkörning

source: Using the query from the previous example:
sv: Använd frågan från föregående exempel:

source: Returns ``EMPTY SET``.
sv: Returnerar ``EMPTY SET``.

source: ``dryrun => true``
sv: ``dryrun => sant``

source: Generates a PostgreSQL ``NOTICE`` with the code used.
sv: Genererar en PostgreSQL ``NOTICE`` med den använda koden.

source: The generated code can be used as a starting base code for additional requirements, like taking into consideration the SRID.
sv: Den genererade koden kan användas som en baskod för ytterligare krav, t.ex. för att ta hänsyn till SRID.

source: Many points in an edge
sv: Många punkter i en kant

source: The green nodes are the **original points**
sv: De gröna noderna är **originalpunkterna**

source: The geometry ``geom``, marked as **g1** and **g2** are the **original points**
sv: Geometrin ``geom``, markerad som **g1** och **g2** är de **originalpunkter**

source: The geometry ``edge``, marked as **edge1** and **edge2** is a line that connects the **original point** with the closest point on the :math:`sp \rightarrow ep` edge.
sv: Geometrin ``kant``, markerad som **kant1** och **kant2** är en linje som förbinder **originalpunkten** med den närmaste punkten på :math:`sp \rightarrow ep`-kanten.

source: Many points dry run execution
sv: Utförande av torrkörning på många punkter

source: Do not process query
sv: Bearbeta inte förfrågan

source: Generate a PostgreSQL ``NOTICE`` with the code used to calculate all columns
sv: Generera en PostgreSQL ``NOTICE`` med koden som används för att beräkna alla kolumner

source: Find at most two routes to a given point
sv: Hitta högst två vägar till en given punkt

source: Using :doc:`pgr_withPoints`
sv: Använda :doc:`pgr_withPoints`

source: A point of interest table
sv: Ett bord för intressepunkter

source: Handling points outside the graph.
sv: Hantering av punkter utanför grafen.

source: Points of interest
sv: Attraktioner

source: Some times the applications work "on the fly" starting from a location that is not a vertex in the graph. Those locations, in pgRrouting are called points of interest.
sv: Ibland fungerar applikationerna "on the fly" med utgångspunkt från en plats som inte är ett vertex i grafen. Dessa platser kallas i pgRrouting för intressepunkter.

source: The information needed in the points of interest is ``pid``, ``edge_id``, ``side``, ``fraction``.
sv: Den information som behövs i intressepunkterna är ``pid``, ``edge_id``, ``side``, ``fraction``.

source: On this documentation there will be some 6 fixed points of interest and they will be stored on a table.
sv: På denna dokumentation kommer det att finnas cirka 6 fasta punkter av intresse och de kommer att lagras på ett bord.

source: A unique identifier.
sv: En unik identifierare.

source: Identifier of the nearest segment.
sv: Identifierare för det närmaste segmentet.

source: Is it on the left, right or both sides of the segment ``edge_id``.
sv: Är det på vänster, höger eller båda sidor av segmentet ``edge_id``.

source: Where in the segment is the point located.
sv: Var i segmentet är punkten belägen.

source: The geometry of the points.
sv: Punkternas geometri.

source: The distance between ``geom`` and the segment ``edge_id``.
sv: Avståndet mellan ``geom`` och segmentet ``edge_id``.

source: A segment that connects the ``geom`` of the point to the closest point on the segment ``edge_id``.
sv: Ett segment som förbinder punktens ``geom`` med den närmaste punkten på segmentet ``edge_id``.

source: ``newPoint``
sv: ``nyaPunkt``

source: A point on segment ``edge_id`` that is the closest to ``geom``.
sv: En punkt på segmentet ``edge_id`` som ligger närmast ``geom``.

source: Points of interest fill up
sv: Intressanta platser fylls upp

source: Inserting the points of interest.
sv: Infoga intressepunkterna.

source: Filling the rest of the table.
sv: Fyller resten av bordet.

source: Any other additional modification: In this manual, point :math:`6` can be reached from both sides.
sv: Någon annan ytterligare modifiering: I denna manual kan punkten :math:`6` nås från båda sidor.

source: The points of interest:
sv: De intressanta platserna:

source: ``pgr_floydWarshall`` - Returns the sum of the costs of the shortest path for each pair of nodes in the graph using Floyd-Warshall algorithm.
sv: ``pgr_floydWarshall`` - Returnerar summan av kostnaderna för den kortaste vägen för varje par av noder i grafen med hjälp av Floyd-Warshall-algoritmen.
zh_hans: ``pgr_floydWarshall`` - 使用 Floyd-Warshall 算法返回图中每对节点的最短路径成本之和。

source: The Floyd-Warshall algorithm, also known as Floyd's algorithm, is a good choice to calculate the sum of the costs of the shortest path for each pair of nodes in the graph, for *dense graphs*. We use Boost's implementation which runs in :math:`\Theta(V^3)` time,
sv: Floyd-Warshall-algoritmen, även känd som Floyds algoritm, är ett bra val för att beräkna summan av kostnaderna för den kortaste vägen för varje par noder i grafen, för *täta grafer*. Vi använder Boosts implementation som körs på :math:`\Theta(V^3)`-tid,
zh_hans: Floyd-Warshall算法，也被称为 Floyd算法，是计算图中每一对节点间最短路径的路径成本总和的一种良好选择，适用于*密集图*。我们使用Boost的实现，其运行时间为： :math:`\Theta(V^3)`，

source: For a directed subgraph with edges :math:`\{1, 2, 3, 4\}`.
sv: För en riktad delgraf med kanter :math:`\{1, 2, 3, 4\}`.
zh_hans: 对于有边 :math:`\{1, 2, 3, 4\}`的有向子图。

source: ``pgr_full_version`` — Get the details of pgRouting version information.
sv: ``pgr_full_version`` - Hämta detaljerna i versionsinformationen för pgRouting.
zh_hans: ``pgr_full_version`` — 获取pgRouting版本信息的详细信息。.

source: Get complete details of pgRouting version information
sv: Få fullständig information om pgRouting version information
zh_hans: 获取 pgRouting 版本信息的完整详细信息

source: RETURNS |result-version|
sv: RETURNS |resultat-version|

source: Information about when this documentation was built
sv: Information om när denna dokumentation skapades
zh_hans: 有关此文档何时构建的信息

source: ``build_type``
sv: ``byggnads_typ``

source: The Build type
sv: Typ av byggnad
zh_hans: 构建类型

source: ``compile_date``
sv: ``kompileringsdatum``

source: Compilation date
sv: Datum för sammanställning
zh_hans: 编译日期

source: ``library``
sv: ``bibliotek``

source: Library name and version
sv: Bibliotekets namn och version
zh_hans: 库名称和版本

source: Operative system
sv: Operativt system
zh_hans: 操作系统

source: pgsql used
sv: pgsql används
zh_hans: 使用pgsql

source: ``compiler``
sv: ``kompilator``

source: Compiler and version
sv: Kompilator och version
zh_hans: 编译器和版本

source: Git hash of pgRouting build
sv: Git-hash av pgRouting-byggnaden
zh_hans: pgRouting 构建的 Git 哈希

source: ``pgr_hawickCircuits`` - Experimental
sv: ``pgr_hawickCircuits`` - Experimentell

source: ``pgr_hawickCircuits`` — Returns the list of circuits using hawick circuits algorithm.
sv: ``pgr_hawickCircuits`` - Returnerar listan över kretsar som använder Hawick-kretsalgoritmen.

source: Hawick Circuit algorithm, is published in 2008 by Ken Hawick and Health A. James. This algorithm solves the problem of detecting and enumerating circuits in graphs. It is capable of circuit enumeration in graphs with directed-arcs, multiple-arcs and self-arcs with a memory efficient and high-performance im-plementation. It is an extension of Johnson's Algorithm of finding all the elementary circuits of a directed graph.
sv: Hawick Circuit algorithm, publicerades 2008 av Ken Hawick och Health A. James. Algoritmen löser problemet med att upptäcka och räkna upp kretsar i grafer. Den kan räkna upp kretsar i grafer med riktade arcs, multipla arcs och self-arcs med en minneseffektiv och högpresterande implementering. Den är en utvidgning av Johnsons algoritm för att hitta alla elementära kretsar i en riktad graf.
zh_hans: Hawick Circuit 算法由 Ken Hawick 和 Health A. James 于 2008 年发表。 该算法解决了图中电路的检测和枚举问题。 它能够在具有有向弧、多弧和自弧的图中进行电路枚举，并具有内存高效和高性能的实现。 它是寻找有向图所有基本电路的约翰逊算法的扩展。

source: There are 2 variations defined in the Boost Graph Library. Here, we have implemented only 2nd as it serves the most suitable and practical usecase. In this variation we get the circuits after filtering out the circuits caused by parallel edges. Parallel edge circuits have more use cases when you want to count the no. of circuits.Maybe in future, we will also implemenent this variation.
sv: Det finns 2 varianter definierade i Boost Graph Library. Här har vi bara implementerat den andra eftersom den är det mest lämpliga och praktiska användningsfallet. I den här varianten får vi kretsarna efter att ha filtrerat bort de kretsar som orsakas av parallella kanter. Parallella kantkretsar har fler användningsfall när du vill räkna antalet kretsar. Kanske i framtiden kommer vi också att implementera denna variation.
zh_hans: Boost Graph Library 中定义了 2 个变体。 在这里，我们只实现了第二个，因为它服务于最合适和最实用的用例。 在这个变体中，我们在过滤掉由平行边缘引起的电路后得到电路。 当您想要计算数量时，并行边缘电路有更多用例。 也许将来我们也会实现这种变化。

source: The algorithm implementation works only for directed graph
sv: Implementeringen av algoritmen fungerar endast för riktade grafer
zh_hans: 该算法实现仅适用于有向图

source: It is a variation of Johnson's algorithm for circuit enumeration.
sv: Det är en variant av Johnsons algoritm för kretsuppräkning.
zh_hans: 这是对于电路枚举的一种格式，基于Johnson的算法。

source: The algorithm outputs the distinct circuits present in the graph.
sv: Algoritmen matar ut de olika kretsar som finns i grafen.
zh_hans: 该算法输出图中存在的不同电路。

source: Time Complexity: :math:`O((V + E) (c + 1))`
sv: Tidskomplexitet: :math:`O((V + E) (c + 1))`
zh_hans: 时间复杂度：:math:`O((V + E) (c + 1))`

source: Circuits present in the pgRouting :doc:`sampledata`
sv: Kretsar som finns i pgRouting :doc:`sampledata`
zh_hans: pgRouting :doc:`示例数据`中存在的电路

source: Id of the circuit starting from ``1``
sv: Id för kretsen med början från ``1``
zh_hans: 电路id从``1``开始

source: Relative position in the path. Has value ``0`` for beginning of the path
sv: Relativ position i banan. Har värdet ``0`` för början av banan

source: Identifier of the starting vertex of the circuit.
sv: Identifierare av kretsens startvertex.
zh_hans: 电路起始顶点的标识符。

source: Identifier of the ending vertex of the circuit.
sv: Identifierare för kretsens slutpunkt.
zh_hans: 电路结束顶点的标识符。

source: Identifier of the node in the path from a vid to next vid.
sv: Identifierare av noden i sökvägen från en vid till nästa vid.
zh_hans: 从 vid 到下一个 vid 的路径中节点的标识符。

source: ``pgr_isPlanar`` - Experimental
sv: ``pgr_isPlanar`` - Experimentell
zh_hans: ``pgr_isPlanar`` - 实验

source: ``pgr_isPlanar`` — Returns a boolean depending upon the planarity of the graph.
sv: ``pgr_isPlanar`` - Returnerar ett boolean beroende på grafens planaritet.
zh_hans: ``pgr_isPlanar`` —根据图的平面性返回布尔值.

source: A graph is planar if it can be drawn in two-dimensional space with no two of its edges crossing. Such a drawing of a planar graph is called a plane drawing. Every planar graph also admits a straight-line drawing, which is a plane drawing where each edge is represented by a line segment. When a graph has :math:`K_5` or :math:`K_{3, 3}` as subgraph then the graph is not planar.
sv: En graf är plan om den kan ritas i ett tvådimensionellt rum utan att två av dess kanter korsar varandra. En sådan ritning av en plan graf kallas för en plan ritning. Varje plan graf kan också ritas med en rak linje, vilket är en plan ritning där varje kant representeras av ett linjesegment. När en graf har :math:`K_5` eller :math:`K_{3, 3}` som undergraf är grafen inte plan.
zh_hans: 如果一个图可以在二维空间中绘制，使得它的任意两条边都不相交，那么这个图就是平面图。这种平面图的绘制称为平面绘图。每个平面图也可以表示为一个直线绘图，即在平面绘图中，每条边都由一条线段表示。当一个图包含 :math:`K_5` 或 :math:`K_{3, 3}` 作为子图时，这个图就不是平面图。

source: This implementation use the Boyer-Myrvold Planarity Testing.
sv: Denna implementering använder Boyer-Myrvolds planaritetstest.
zh_hans: 此实施使用 Boyer-Myrvold 平面度测试。

source: It will return a boolean value depending upon the planarity of the graph.
sv: Den returnerar ett booleskt värde som beror på grafens planhet.
zh_hans: 它将根据图形的平面性返回一个布尔值。

source: Applicable only for **undirected** graphs.
sv: Gäller endast för **undirected** grafer.
zh_hans: 仅适用于**无向**图。

source: The algorithm does not considers traversal costs in the calculations.
sv: Algoritmen tar inte hänsyn till traversalkostnader i beräkningarna.
zh_hans: 该算法在计算中不考虑遍历成本。

source: Running time: :math:`O(|V|)`
sv: Speltid: :math:`O(|V|)`
zh_hans: 运行时间： :math:`O(|V|)`

source: RETURNS ``BOOLEAN``
sv: RETURNERAR ``BOOLEAN``

source: Returns a boolean ``(pgr_isplanar)``
sv: Returnerar en boolean ``(pgr_isplanar)```
zh_hans: 返回一个布尔值 ``(pgr_isplanar)``

source: `true` when the graph is planar.
sv: `true` när grafen är planar.
zh_hans: 当图形是平面时为`true`。

source: `false` when the graph is not planar.
sv: `false` när grafen inte är planar.
zh_hans: 当图形不是平面时为`false`。

source: The following edges will make the subgraph with vertices {10, 15, 11, 16, 13} a :math:`K_1` graph.
sv: Följande kanter kommer att göra undergrafen med topparna {10, 15, 11, 16, 13} till en :math:`K_1`-graf.
zh_hans: 以下边将构成具有顶点 {10, 15, 11, 16, 13} 的子图，这个子图是一个 :math:`K_1` 图。

source: The new graph is not planar because it has a :math:`K_5` subgraph. Edges in blue represent :math:`K_5` subgraph.
sv: Den nya grafen är inte plan eftersom den har en :math:`K_5`-undergraf. Kanter i blått representerar :math:`K_5` subgraf.
zh_hans: 新图不是平面图，因为它具有一个 :math:`K_5` 子图。蓝色的边代表 :math:`K_5` 子图。

source: ``pgr_johnson`` - Returns the sum of the costs of the shortest path for each pair of nodes in the graph using Floyd-Warshall algorithm.
sv: ``pgr_johnson`` - Returnerar summan av kostnaderna för den kortaste vägen för varje par av noder i grafen med hjälp av Floyd-Warshall-algoritmen.
zh_hans: ``pgr_johnson`` - 使用 Floyd-Warshall 算法返回图中每对节点的最短路径成本之和。.

source: The Johnson algorithm, is a good choice to calculate the sum of the costs of the shortest path for each pair of nodes in the graph, for *sparse graphs*. It uses the Boost's implementation which runs in :math:`O(V E \log V)` time,
sv: Johnson-algoritmen är ett bra val för att beräkna summan av kostnaderna för den kortaste vägen för varje par noder i grafen, för *glesa grafer*. Den använder Boosts implementation som körs på :math:`O(V E \log V)` tid,

source: ``pgr_kruskal`` — Minimum spanning tree of a graph using Kruskal's algorithm.
sv: ``pgr_kruskal`` - Minsta spännviddsträd för en graf med Kruskals algoritm.
zh_hans: ``pgr_kruskal`` — 使用 Kruskal 算法的图的最小生成树。

source: This algorithm finds the minimum spanning forest in a possibly disconnected graph using Kruskal's algorithm.
sv: Denna algoritm hittar den minsta spännvidden i en eventuellt frånkopplad graf med hjälp av Kruskals algoritm.
zh_hans: 该算法使用 Kruskal 算法在可能断开的图中找到最小生成森林。

source: EMPTY SET is returned when there are no edges in the graph.
sv: EMPTY SET returneras när det inte finns några kanter i grafen.
zh_hans: 当图中没有边时，返回 EMPTY SET。

source: Returns set of |result-mst|
sv: Returnerar uppsättning av |result-mst|
zh_hans: 返回 |result-mst| 的集合

source: Minimum spanning forest
sv: Skog med minsta spann
zh_hans: 最小生成森林

source: ``pgr_kruskalBFS`` — Kruskal's algorithm for Minimum Spanning Tree with breadth First Search ordering.
sv: ``pgr_kruskalBFS`` - Kruskals algoritm för minsta spännviddsträd med bredd först sökordning.
zh_hans: ``pgr_kruskalBFS`` — Kruskal 的最小生成树算法，具有广度优先搜索排序。

source: Added ``pred`` result columns.
sv: Lagt till ``pred`` resultatkolumner.

source: Visits and extracts the nodes information in Breath First Search ordering of the Minimum Spanning Tree created using Kruskal's algorithm.
sv: Besöker och extraherar nodinformationen i Breath First Search-ordningen i det minsta spännviddsträdet som skapats med Kruskals algoritm.
zh_hans: 访问并提取使用 Kruskal 算法创建的最小生成树的呼吸优先搜索排序中的节点信息。

source: Returned tree nodes from a root vertex are on Breath First Search order
sv: Returnerade trädnoder från en rotvertex är på Breath First Search-ordning
zh_hans: 从根顶点返回的树节点遵循广度优先搜索顺序

source: Breath First Search Running time: :math:`O(E + V)`
sv: Breath First Search Speltid: :math:`O(E + V)`
zh_hans: 广度优先搜索运行时间：:math:`O(E + V)`

source: The Minimum Spanning Tree having as root vertex :math:`6`
sv: Det minsta spännviddsträdet som har som rotvertex :math:`6``
zh_hans: 以根顶点为 :math:`6` 的最小生成树

source: The Minimum Spanning Tree starting on vertices :math:`\{9, 6\}` with :math:`depth \leq 3`
sv: Det minsta spännviddsträdet som börjar på topparna :math:`\{9, 6\}` med :math:`djup \leq 3`
zh_hans: 以顶点 :math:`\{9, 6\}` 为起点， :math:`depth \leq 3` 的最小生成树

source: ``pgr_kruskalDD`` — Catchament nodes using Kruskal's algorithm.
sv: ``pgr_kruskalDD`` - Fångar upp noder med hjälp av Kruskals algoritm.
zh_hans: ``pgr_kruskalDD`` — 使用 Kruskal 算法的汇流节点。

source: Using Kruskal's algorithm, extracts the nodes that have aggregate costs less than or equal to a **distance** from a **root** vertex (or vertices) within the calculated minimum spanning tree.
sv: Använd Kruskals algoritm för att extrahera de noder som har aggregerade kostnader som är mindre än eller lika med ett **avstånd** från en **rot**-vertex (eller vertex) inom det beräknade minsta spännvidden i trädet.
zh_hans: 使用 Kruskal 算法，在计算的最小生成树中提取总成本小于或等于距**根**顶点（或多个顶点）**距离**的节点。

source: Returned tree nodes from a root vertex are on Depth First Search order.
sv: Returnerade trädnoder från en rotvertex är på djupet först sökordning.
zh_hans: 从根顶点返回的树节点遵循深度优先搜索顺序。

source: Depth First Search running time: :math:`O(E + V)`
sv: Djup Första sökning Löptid: :math:`O(E + V)`
zh_hans: 深度优先搜索运行时间： :math:`O(E + V)`

source: The Minimum Spanning Tree starting on vertex :math:`6` with :math:`distance \leq 3.5`
sv: Det minsta spännviddsträdet som börjar på toppunkten :math:`6` med :math:`avstånd \leq 3.5`
zh_hans: 以顶点 :math:`6` 为起点的，总成本小于或等于 :math:`distance \leq 3.5` 的最小生成树

source: The Minimum Spanning Tree starting on vertices :math:`\{9, 6\}` with :math:`distance \leq 3.5`
sv: Det minsta spännviddsträdet som börjar på topparna :math:`\{9, 6\}` med :math:`avstånd \leq 3.5`
zh_hans: 以顶点:math:`\{9, 6\}` 为起点， :math:`distance \leq 3.5`的最小生成树

source: ``pgr_kruskalDFS`` — Kruskal's algorithm for Minimum Spanning Tree with Depth First Search ordering.
sv: ``pgr_kruskalDFS`` - Kruskals algoritm för minsta spännviddsträd med djup första sökordning.
zh_hans: ``pgr_kruskalDFS`` — 具有深度优先搜索排序的最小生成树 Kruskal 算法。

source: Visits and extracts the nodes information in Depth First Search ordering of the Minimum Spanning Tree created using Kruskal's algorithm.
sv: Besöker och extraherar nodernas information i Depth First Search-ordningen för det minsta spännviddsträdet som skapats med Kruskals algoritm.
zh_hans: 访问并提取使用 Kruskal 算法创建的最小生成树的深度优先搜索顺序中的节点信息。

source: Returned tree nodes from a root vertex are on Depth First Search order
sv: Returnerade trädnoder från en rotvertex är på djupet först sökordning
zh_hans: 从根顶点返回的树节点按深度优先搜索顺序

source: ``pgr_lengauerTarjanDominatorTree`` - Experimental
sv: ``pgr_lengauerTarjanDominatorTree`` - Experimentell

source: ``pgr_lengauerTarjanDominatorTree`` — Returns the immediate dominator of all vertices.
sv: ``pgr_lengauerTarjanDominatorTree`` - Returnerar den omedelbara dominatorn för alla toppar.
zh_hans: ``pgr_lengauerTarjanDominatorTree`` — 返回所有顶点的直接支配者。

source: The algorithm calculates the *immediate dominator* of each vertex called **idom**, once **idom** of each vertex is calculated then by making every **idom** of each vertex as its parent, the dominator tree can be built.
sv: Algoritmen beräknar den * omedelbara dominatorn * för varje toppunkt som kallas **idom **, när **idom ** för varje toppunkt har beräknats genom att göra varje **idom ** för varje toppunkt som dess förälder, kan dominatorträdet byggas.

source: The algorithm works in directed graph only.
sv: Algoritmen fungerar endast i riktade grafer.
zh_hans: 该算法仅适用于有向图。

source: The algorithm returns *idom* of each vertex.
sv: Algoritmen returnerar *idom* för varje toppunkt.
zh_hans: 该算法返回每个顶点的* idom*。

source: If the *root vertex* not present in the graph then it returns empty set.
sv: Om *rotvertexet* inte finns i grafen returneras en tom uppsättning.
zh_hans: 如果图中不存在*根顶点*，则返回空集。

source: Running time: :math:`O((V+E)log(V+E))`
sv: Drifttid: :math:`O((V+E)log(V+E))`
zh_hans: 运行时间：:math:`O((V+E)log(V+E))`

source: Returns set of |result-idom|
sv: Returnerar uppsättning av |resultat-idom|
zh_hans: 返回 |result-idom| 的集合

source: The dominator tree with root vertex :math:`5`
sv: Dominatorträdet med rotvertex :math:`5`
zh_hans: 具有根顶点 :math:`5`的支配树

source: SQL query as described above.
sv: SQL-fråga enligt beskrivningen ovan.
zh_hans: SQL 查询如上所述。

source: **root vertex**
sv: **Rot toppunkt**

source: Returns set of ``(seq, vertex_id, idom)``
sv: Returnerar uppsättning av ``(seq, vertex_id, idom)``
zh_hans: 返回集合``(seq, vertex_id, idom)``

source: Identifier of vertex .
sv: Identifierare för toppunkt .
zh_hans: 顶点的标识符。

source: Immediate dominator of vertex.
sv: Omedelbar dominator av toppunkt.
zh_hans: 顶点的直接支配者。

source: Dominator tree of another component.
sv: Dominant träd av en annan komponent.
zh_hans: 另一个组件的支配树。

source: `Wikipedia: dominator tree <https://en.wikipedia.org/wiki/Dominator_(graph_theory)>`__
sv: `Wikipedia: dominatorträd <https://en.wikipedia.org/wiki/Dominator_(grafteori)>`__
zh_hans: `维基百科:支配树<https://en.wikipedia.org/wiki/Dominator_(graph_theory)>`__
