Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgRouting-concepts.po
Languages: es

source: Residual capacity of the edge in the direction (source, target).
es: Capacidad residual de la arista en la dirección (origen, destino).

source: The cost of sending this flow through the edge in the direction (source, target).
es: El costo de enviar este flujo a través de la arista en la dirección (origen, destino).

source: The aggregate cost.
es: El costo agregado.

source: Advanced Topics
es: Tópicos avanzados

source: Routing Topology
es: Topología para Ruteo

source: Overview
es: Resumen

source: Typically when GIS files are loaded into the data database for use with pgRouting they do not have topology information associated with them. To create a useful topology the data needs to be "noded". This means that where two or more roads form an intersection there it needs to be a node at the intersection and all the road segments need to be broken at the intersection, assuming that you can navigate from any of these segments to any other segment via that intersection.
es: Normalmente cuando se cargan archivos GIS en la base de datos para su uso con pgRouting no tienen información de la topología asociada a ellos. Para crear una topología útil, los datos debe ser "noded". Esto significa que donde dos o más caminos forman una intersección allí debe existir y todos los segmentos de carretera necesitan estar partidos en la intersección, eso suponiendo que puede navegar a cualquier otro segmento mediante la intersección de cualquiera de estos segmentos.

source: You can use the :ref:`graph analysis functions <analytics>` to help you see where you might have topology problems in your data. If you need to node your data, we also have a function :doc:`pgr_nodeNetwork() <pgr_nodeNetwork>` that might work for you. This function splits ALL crossing segments and nodes them. There are some cases where this might NOT be the right thing to do.
es: Puedes utilizar :ref:`graph analysis functions <analytics>` para ayudarte a visualizar dónde podría haber problemas de topología en tus datos. Si necesitas crear nodos a partir de tus datos, también tenemos una función :doc:`pgr_nodeNetwork () <pgr_nodeNetwork>` que deberían funcionarte. Esta función divide TODOS los segmentos cruzados y los une. Hay algunos casos en los que esto podría NO ser lo correcto.

source: For example, when you have an overpass and underpass intersection, you do not want these noded, but pgr_nodeNetwork does not know that is the case and will node them which is not good because then the router will be able to turn off the overpass onto the underpass like it was a flat 2D intersection. To deal with this problem some data sets use z-levels at these types of intersections and other data might not node these intersection which would be ok.
es: Por ejemplo, cuando se tiene un cruce de puente o de un túnel, no quieres estos contengan un nodo, pero pgr_nodeNetwork no sabe que ese es el caso y va a crear un nodo, entonces el enrutador interpretará el puente o el paso a desnivel como si fuera una intersección plana en 2D. Para lidiar con este problema, se debe utilizar niveles z ya se para estos tipos de intersecciones o para otros casos en donde crear el nodo de la intersección no sea lo correcto.

source: For those cases where topology needs to be added the following functions may be useful. One way to prep the data for pgRouting is to add the following columns to your table and then populate them as appropriate. This example makes a lot of assumption like that you original data tables already has certain columns in it like ``one_way``, ``fcc``, and possibly others and that they contain specific data values. This is only to give you an idea of what you can do with your data.
es: Para los casos donde la topología debe construirse, las siguientes funciones pueden ser de utilidad. Una forma de preparar los datos para pgRouting es agregar los siguientes campos a la tabla y luego poblarlas según corresponda. Este ejemplo tiene como supuestos: que la tabla original ya tiene columnas como ``one_way``, ``fcc`` y posiblemente otras y que contienen valores de datos específicos. Esto es sólo para darle una idea de lo que se puede hacer con los datos.

source: The function :doc:`pgr_createTopology <pgr_createTopology>` will create the ``vertices_tmp`` table and populate the ``source`` and ``target`` columns. The following example populated the remaining columns. In this example, the ``fcc`` column contains feature class code and the ``CASE`` statements converts it to an average speed.
es: La función :doc:`pgr_createTopology <pgr_createTopology>` crea la tabla ``vertices_tmp`` y llena las columnas de ``source`` y ``target``. El siguiente ejemplo llenó las columnas restantes. Aquí, la columna ``fcc`` contiene código de clase de entidad y las declaraciones ``CASE`` lo convierten a una velocidad promedio.

source: Now your database should be ready to use any (most?) of the pgRouting algorithms.
es: Ahora su base de datos debe estar lista para usarse en cualquiera (mayoría?) de los algoritmos de pgRouting.

source: Graph Analytics
es: Análisis de gráficas

source: It is common to find problems with graphs that have not been constructed fully noded or in graphs with z-levels at intersection that have been entered incorrectly. An other problem is one way streets that have been entered in the wrong direction. We can not detect errors with respect to "ground" truth, but we can look for inconsistencies and some anomalies in a graph and report them for additional inspections.
es: Es común encontrar problemas con los gráficos que no se han construido completamente ligados con nodos o con gráficos con niveles z en intersecciónes que se han introducido incorrectamente. Otro problema es que las calles han sido introducidas en la dirección equivocada. No podemos detectar errores con respecto a la verdad respecto a la "tierra", pero podemos buscar inconsistencias y algunas anomalías en un gráfico y les reportarlas para inspecciones adicionales.

source: We do not current have any visualization tools for these problems, but I have used mapserver to render the graph and highlight potential problem areas. Someone familiar with graphviz might contribute tools for generating images with that.
es: Nosotros no tenemos herramientas de visualización para estos problemas, pero se ha utilizado MapServer para reproducir la gráfica y poner en relieve las áreas con problemas potenciales. Alguien familiarizado con graphviz podría contribuir con herramientas para generar imágenes para este propósito.

source: Analyze a Graph
es: Analizar un gráfico

source: With :doc:`pgr_analyzeGraph` the graph can be checked for errors. For example for table "mytab" that has "mytab_vertices_pgr" as the vertices table:
es: Con :doc:`pgr_analyzeGraph` el grafo puede revisarse en busca de errores. Por ejemplo, para la tabla "mytab" que incluye a "mytab_vertices_pgr" como la tabla de vértices:

source: In the vertices table "mytab_vertices_pgr":
es: En la tabla de vértices "mytab_vertices_pgr":

source: Deadends are identified by ``cnt=1``
es: Los callejones están identificados por ``cnt=1``

source: Potencial gap problems are identified with ``chk=1``.
es: Se identifican problemas potenciales brecha con``chk=1``.

source: For isolated road segments, for example, a segment where both ends are deadends. you can find these with the following query:
es: Si se tienen segmentos aislados de caminos, por ejemplo, un segmento en el cual los dos extremos son callejones sin salida, se pueden encontrar con la siguiente consulta:

source: If you want to visualize these on a graphic image, then you can use something like mapserver to render the edges and the vertices and style based on ``cnt`` or if they are isolated, etc. You can also do this with a tool like graphviz, or geoserver or other similar tools.
es: Si quieren visualizar en una imagen gráfica, entonces usted puede utilizar algo como MapServer para representar los bordes y los vértices y el estilizar en base a ``cnt`` o si están aislados, etc. También se puede hacer esto con una herramienta como graphviz o geoserver u otras herramientas similares.

source: Analyze One Way Streets
es: Analizar las calles unidireccionales

source: :doc:`pgr_analyzeOneWay` analyzes one way streets in a graph and identifies any flipped segments. Basically if you count the edges coming into a node and the edges exiting a node the number has to be greater than one.
es: :doc:`pgr_analyzeOneWay` analiza las calles unidireccionales de un grafo e identifica los segmentos volteados. Básicamente, si cuenta las aristas que entran en un nodo y las aristas bordes que salen de un nodo, el número tiene que ser mayor que uno.

source: This query will add two columns to the vertices_tmp table ``ein int`` and ``eout int`` and populate it with the appropriate counts. After running this on a graph you can identify nodes with potential problems with the following query.
es: Esta consulta agrega dos columnas a la tabla vertices_tmp ``ein int`` y ``eout int`` (ein = borde de entrada, eout=borde de salida) y las rellena con los conteos correspondientes. Después de su ejecución, en un grafo se pueden identificar los nodos con problemas potenciales utilizando la siguiente consulta.

source: The rules are defined as an array of text strings that if match the ``col`` value would be counted as true for the source or target in or out condition.
es: Las reglas se definen como un conjunto de cadenas de texto que si coinciden con el valor de ``col`` se considera como válido para el origen o destino dentro o fuera de la condición.

source: Example
es: Ejemplo

source: Lets assume we have a table "st" of edges and a column "one_way" that might have values like:
es: Supongamos que tenemos una tabla "st" de bordes y una columna "one_way" que podría tener valores como:

source: 'FT' - oneway from the source to the target node.
es: 'FT' - dirección unidireccional de la fuente para el nodo de destino.

source: 'TF' - oneway from the target to the source node.
es: 'TF' - dirección unidireccional desde el nodo destino hasta el nodo fuente.

source: 'B' - two way street.
es: 'B' - calle de doble sentido.

source: '' - empty field, assume twoway.
es: ''- campo vacío, suponer doble sentido.

source: <NULL> - NULL field, use two_way_if_null flag.
es: <NULL> - Campo NULL, usar bandera de two_way_if_null, es decir, doble sentido cuando nulo.

source: Then we could form the following query to analyze the oneway streets for errors.
es: Entonces se puede formar la siguiente consulta para analizar las calles unidireccionales para errores.

source: Typically these problems are generated by a break in the network, the one way direction set wrong, maybe an error related to z-levels or a network that is not properly noded.
es: Normalmente estos problemas son generados por una rotura en la red, la dirección un camino equivocado, quizás un error relacionado con niveles z o una red que no esté debidamente indicada con nodos.

source: The above tools do not detect all network issues, but they will identify some common problems. There are other problems that are hard to detect because they are more global in nature like multiple disconnected networks. Think of an island with a road network that is not connected to the mainland network because the bridge or ferry routes are missing.
es: Las herramientas anteriores no detectan todos los problemas de la red, pero identifican algunos problemas comunes. Hay otros problemas que son difíciles de detectar porque son más globales en su naturaleza como múltiples redes desconectadas. Piense usted en una isla con una red de carreteras que no está conectada a la red del continente porque faltan las rutas del puente o del ferry.

source: Performance Tips
es: Consejos de Rendimiento

source: For the Routing functions
es: Para las funciones de Ruteo

source: To get faster results bound your queries to the area of interest of routing to have, for example, no more than one million rows.
es: Para obtener resultados más rápidos, las consultas enlazan el área de interés para tener, por ejemplo, no más de un millón de filas.

source: Use an inner query SQL that does not include some edges in the routing function
es: Utilice una consulta SQL interna que no incluya algunas aristas en la función de ruteo

source: Integrating the inner query to the pgRouting function:
es: Integración de la consulta interna a la función pgRouting:

source: For the topology functions:
es: Para las funciones de topología:

source: When "you know" that you are going to remove a set of edges from the edges table, and without those edges you are going to use a routing function you can do the following:
es: Cuando "sabe" que va a eliminar un conjunto de bordes de la tabla de bordes, y sin esos bordes va a utilizar una función de enrrutamiento puede hacer el siguiente:

source: Analize the new topology based on the actual topology:
es: Analizar la topología nueva basada en la topología actual:

source: Or create a new topology if the change is permanent:
es: O crear una nueva topología si el cambio es permanente:

source: How to contribute
es: Cómo contribuir

source: Edit an existing `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`_ page.
es: Edita una página existente `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`_

source: Or create a new Wiki page
es: O crea una nueva página Wiki

source: Create a page on the `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`_
es: Crear una página en el `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`_

source: Give the title an appropriate name
es: Asigne al título un nombre apropiado

source: Adding Functionaity to pgRouting
es: Agregar funcionalidad a pgRouting

source: Consult the `developer's documentation <https://docs.pgrouting.org/doxy/2.4/index.html>`_
es: Consultar `developer's documentation <https://docs.pgrouting.org/doxy/2.4/index.html>`_

source: Indices and tables
es: Índices y tablas
