Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: To see the issues closed by this release see the `Git closed milestone for 2.6.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.6.2%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.6.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.6.2%22%20>`_ på Github.

source: `#1152 <https://github.com/pgRouting/pgrouting/issues/1152>`__ Fixes driving distance when vertex is not part of the graph
sv: `#1152 <https://github.com/pgRouting/pgrouting/issues/1152>`__ Korrigerar körsträcka när toppunkten inte är en del av grafen

source: `#1098 <https://github.com/pgRouting/pgrouting/issues/1098>`__ Fixes windows test
sv: `#1098 <https://github.com/pgRouting/pgrouting/issues/1098>`__ Åtgärdar Windows-test

source: `#1165 <https://github.com/pgRouting/pgrouting/issues/1165>`__ Fixes build for python3 and perl5
sv: `#1165 <https://github.com/pgRouting/pgrouting/issues/1165>`__ Fixar byggsätt för python3 och perl5

source: To see the issues closed by this release see the `Git closed milestone for 2.6.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.6.1%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.6.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.6.1%22%20>`_ på Github.

source: Fixes server crash on several functions.
sv: Fixar serverkrasch på flera funktioner.

source: Fixes for deprecated functions where also applied but not tested
sv: Fixar för föråldrade funktioner som också tillämpas men inte testas

source: Removed compilation warning for g++8
sv: Borttagen kompileringsvarning för g++8

source: Fixed a fallthrugh on Astar and bdAstar.
sv: Åtgärdat ett fel på Astar och bdAstar.

source: To see the issues closed by this release see the `Git closed milestone for 2.6.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.6.0%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.6.0 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.6.0%22%20>`_ på Github.

source: Fix pgr_trsp(text,integer,double precision,integer,double precision,boolean,boolean[,text])
sv: Fix pgr_trsp(text,heltal,dubbel precision,heltal,dubbel precision,boolean,boolean[,text])

source: without restrictions
sv: utan begränsningar

source: calls pgr_dijkstra when both end points have a fraction IN (0,1)
sv: anropar pgr_dijkstra när båda ändpunkterna har en fraktion IN (0,1)

source: calls pgr_withPoints when at least one fraction NOT IN (0,1)
sv: anropar pgr_withPoints när minst en fraktion INTE ÄR I (0,1)

source: with restrictions
sv: med begränsningar

source: calls original trsp code
sv: samtal original trsp kod

source: Internal code
sv: Intern kod

source: Cleaned the internal code of trsp(text,integer,integer,boolean,boolean [, text])
sv: Rensade den interna koden för trsp(text,heltal,heltal,boolean,boolean [, text])

source: Removed the use of pointers
sv: Tog bort användningen av pekare

source: Internal code can accept BIGINT
sv: Intern kod kan acceptera BIGINT

source: Cleaned the internal code of withPoints
sv: Rensade den interna koden för withPoints

source: To see the issues closed by this release see the `Git closed milestone for 2.5.5 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.5%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.5.5 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.5%22%20>`_ på Github.

source: Fixes driving distance when vertex is not part of the graph
sv: Fixar körsträcka när toppunkten inte är en del av grafen

source: Fixes windows test
sv: Åtgärdar Windows-test

source: Fixes build for python3 and perl5
sv: Fixar byggsätt för python3 och perl5

source: To see the issues closed by this release see the `Git closed milestone for 2.5.4 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.4%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.5.4 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.4%22%20>`_ på Github.

source: To see the issues closed by this release see the `Git closed milestone for 2.5.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.3%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.5.3 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.3%22%20>`_ på Github.

source: Fix for postgresql 11: Removed a compilation error when compiling with postgreSQL
sv: Fix för postgresql 11: Tog bort ett kompileringsfel vid kompilering med postgreSQL

source: To see the issues closed by this release see the `Git closed milestone for 2.5.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.2%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.5.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.2%22%20>`_ på Github.

source: Fix for postgresql 10.1: Removed a compiler condition
sv: Fix för postgresql 10.1: Tog bort ett kompilatorvillkor

source: To see the issues closed by this release see the `Git closed milestone for 2.5.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.1%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.5.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.5.1%22%20>`_ på Github.

source: Fixed prerequisite minimum version of: cmake
sv: Fixad förkunskapskrav för minsta version av: cmake

source: To see the issues closed by this release see the `Git closed issues for 2.5.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.5.0%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängdes av den här utgåvan, se `Git stängda problem för 2.5.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.5.0%22+is%3Aclosed>`_ på Github.

source: enhancement:
sv: förbättring:

source: Breaking change on:
sv: Bryter förändring på:

source: Added path_id, cost and agg_cost columns on the result
sv: Lagt till kolumnerna path_id, cost och agg_cost i resultatet

source: Parameter names changed
sv: Namn på parametrar ändrade

source: The many version results are the union of the One to One version
sv: Resultaten för många versioner är en sammanslagning av One to One-versionen

source: New Signatures
sv: Nya signaturer

source: Renamed functions
sv: Omdöpta funktioner
zh_hans: 重新命名的功能

source: Deprecated Function
sv: Föråldrad funktion
zh_hans: 已废弃的功能

source: To see the issues closed by this release see the `Git closed milestone for 2.4.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.4.2%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.4.2 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.4.2%22%20>`_ på Github.

source: Improvement
sv: Förbättring

source: Works for postgreSQL 10
sv: Fungerar för postgreSQL 10

source: Fixed: Unexpected error column "cname"
sv: Fast: Oväntad felkolumn "cname"

source: Replace __linux__ with __GLIBC__ for glibc-specific headers and functions
sv: Ersätt __linux__ med __GLIBC__ för glibc-specifika rubriker och funktioner

source: To see the issues closed by this release see the `Git closed milestone for 2.4.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.4.1%22%20>`_ on Github.
sv: För att se de problem som stängdes med den här utgåvan, se `Git-stängd milstolpe för 2.4.1 <https://github.com/pgRouting/pgrouting/issues?utf8=%E2%9C%93&q=milestone%3A%22Release%202.4.1%22%20>`_ på Github.

source: Fixed compiling error on macOS
sv: Fixat kompileringsfel på macOS

source: Condition error on pgr_withPoints
sv: Villkorligt fel på pgr_withPoints

source: To see the issues closed by this release see the `Git closed issues for 2.4.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.4.0%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängdes av den här utgåvan, se `Git stängda problem för 2.4.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.4.0%22+is%3Aclosed>`_ på Github.

source: Deprecated signatures.
sv: Föråldrade signaturer.

source: Bug fixes on proposed functions
sv: Buggfixar på föreslagna funktioner

source: TRSP original code is used with no changes on the compilation warnings
sv: TRSP:s originalkod används utan ändringar i sammanställningsvarningarna

source: To see the issues closed by this release see the `Git closed issues for 2.3.2 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.3.2%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängts av denna utgåva, se `Git stängda problem för 2.3.2 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.3.2%22+is%3Aclosed>`_ på Github.

source: Fixed pgr_gsoc_vrppdtw crash when all orders fit on one truck.
sv: Fixad pgr_gsoc_vrppdtw-krasch när alla order får plats på en lastbil.

source: Fixed pgr_trsp:
sv: Fixat pgr_trsp:

source: Alternate code is not executed when the point is in reality a vertex
sv: Alternativ kod utförs inte när punkten i själva verket är en topp

source: Fixed ambiguity on seq
sv: Fixad tvetydighet på seq

source: To see the issues closed by this release see the `Git closed issues for 2.3.1 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.3.1%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängts av denna utgåva, se `Git stängda problem för 2.3.1 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.3.1%22+is%3Aclosed>`_ på Github.

source: Leaks on proposed max_flow functions
sv: Läckor om föreslagna max_flow-funktioner

source: Regression error on pgr_trsp
sv: Regressionsfel på pgr_trsp

source: Types discrepancy on pgr_createVerticesTable
sv: Typer diskrepans på pgr_createVerticesTable

source: To see the issues closed by this release see the `Git closed issues for 2.3.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.3.0%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängdes av den här utgåvan, se `Git stängda problem för 2.3.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.3.0%22+is%3Aclosed>`_ på Github.

source: To see the issues closed by this release see the `Git closed issues for 2.2.4 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.2.4%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängts av denna utgåva, se `Git stängda problem för 2.2.4 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.2.4%22+is%3Aclosed>`_ på Github.

source: Bogus uses of extern "C"
sv: Felaktig användning av extern "C"

source: Build error on Fedora 24 + GCC 6.0
sv: Byggfel på Fedora 24 + GCC 6.0

source: Regression error pgr_nodeNetwork
sv: Regressionsfel pgr_nodeNetwork

source: To see the issues closed by this release see the `Git closed issues for 2.2.3 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.2.3%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängts av denna utgåva, se `Git stängda problem för 2.2.3 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.2.3%22+is%3Aclosed>`_ på Github.

source: Fixed compatibility issues with PostgreSQL 9.6.
sv: Fixade kompatibilitetsproblem med PostgreSQL 9.6.

source: To see the issues closed by this release see the `Git closed issues for 2.2.2 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.2.2%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängts av denna utgåva, se `Git stängda problem för 2.2.2 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.2.2%22+is%3Aclosed>`_ på Github.

source: Fixed regression error on pgr_drivingDistance
sv: Åtgärdat regressionsfel på pgr_drivingDistance

source: To see the issues closed by this release see the `Git closed issues for 2.2.1 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A2.2.1+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängts av denna utgåva, se `Git stängda problem för 2.2.1 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A2.2.1+is%3Aclosed>`_ på Github.

source: Server crash fix on pgr_alphaShape
sv: Fix för serverkrasch på pgr_alphaShape

source: Bug fix on With Points family of functions
sv: Buggfix för funktionerna i With Points-familjen

source: To see the issues closed by this release see the `Git closed issues for 2.2.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.2.0%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängdes av denna utgåva, se `Git stängda problem för 2.2.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.2.0%22+is%3Aclosed>`_ på Github.

source: Improvements
sv: Förbättringar

source: Adding a row_where and outall optional parameters
sv: Lägga till en row_where och outall valfria parametrar

source: Signature fix
sv: Signaturfix

source: Proposed Functionality
sv: Föreslagen funktionalitet
zh_hans: 建议的功能

source: Renamed and Deprecated Function
sv: Omdöpta och utfasade funktioner

source: To see the issues closed by this release see the `Git closed issues for 2.1.0 <https://github.com/pgRouting/pgrouting/issues?q=is%3Aissue+milestone%3A%22Release+2.1.0%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängdes av denna utgåva, se `Git stängda problem för 2.1.0 <https://github.com/pgRouting/pgrouting/issues?q=is%3Aissue+milestone%3A%22Release+2.1.0%22+is%3Aclosed>`_ på Github.

source: Refactored
sv: Refaktoriserad

source: Proposed functions from Steve Woodbridge, (Classified as Convenience by the author.)
sv: Föreslagna funktioner från Steve Woodbridge, (Klassificeras som bekvämlighet av författaren.)

source: Added proposed functions from GSoc Projects:
sv: Lagt till föreslagna funktioner från GSoc Projects:

source: No longer supported
sv: Stöds inte längre

source: Removed the 1.x legacy functions
sv: Borttagning av äldre funktioner från 1.x

source: Some bug fixes in other functions
sv: Några buggfixar i andra funktioner

source: Refactoring Internal Code
sv: Refaktorisering av intern kod

source: A C and C++ library for developer was created
sv: Ett C- och C++-bibliotek för utvecklare skapades

source: encapsulates postgreSQL related functions
sv: kapslar in postgreSQL-relaterade funktioner

source: encapsulates Boost.Graph graphs
sv: kapslar in Boost.Graph-grafer

source: Directed Boost.Graph
sv: Riktad Boost.graf

source: Undirected Boost.graph.
sv: Oriktad Boost.graf.

source: allow any-integer in the id's
sv: tillåta valfritt heltal i id:et

source: allow any-numerical on the cost/reverse_cost columns
sv: tillåta valfri numerisk i kostnads-/omvända_kostnadskolumnerna

source: Instead of generating many libraries: - All functions are encapsulated in one library - The library has the prefix 2-1-0
sv: Istället för att generera många bibliotek: - Alla funktioner är inkapslade i ett bibliotek - Biblioteket har prefixet 2-1-0

source: Minor bug fixes.
sv: Mindre buggfixar.

source: No track of the bug fixes were kept.
sv: Inga uppgifter om buggfixarna sparades.

source: To see the issues closed by this release see the `Git closed issues for 2.0.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.0.0%22+is%3Aclosed>`_ on Github.
sv: För att se de problem som stängdes av den här utgåvan, se `Git stängda problem för 2.0.0 <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+2.0.0%22+is%3Aclosed>`_ på Github.

source: With the release of pgRouting 2.0.0 the library has abandoned backwards compatibility to `pgRouting 1.0`_ releases. The main Goals for this release are:
sv: Med lanseringen av pgRouting 2.0.0 har biblioteket övergett bakåtkompatibilitet till `pgRouting 1.0`_-utgåvor. Huvudmålen för denna utgåva är:

source: Major restructuring of pgRouting.
sv: Stor omstrukturering av pgRouting.

source: Standardization of the function naming
sv: Standardisering av namngivning av funktioner

source: Preparation of the project for future development.
sv: Förberedelse av projektet för framtida utveckling.

source: As a result of this effort:
sv: Som ett resultat av denna insats:

source: pgRouting has a simplified structure
sv: pgRouting har en förenklad struktur

source: Significant new functionality has being added
sv: Betydande ny funktionalitet har lagts till

source: Documentation has being integrated
sv: Dokumentation har integrerats

source: Testing has being integrated
sv: Testning har integrerats

source: And made it easier for multiple developers to make contributions.
sv: Och gjort det enklare för flera utvecklare att bidra.

source: Important Changes
sv: Viktiga förändringar

source: Graph Analytics - tools for detecting and fixing connection some problems in a graph
sv: Graph Analytics - verktyg för att upptäcka och åtgärda vissa problem med kopplingar i en graf

source: A collection of useful utility functions
sv: En samling användbara nyttofunktioner

source: Two new All Pairs Short Path algorithms (pgr_apspJohnson, pgr_apspWarshall)
sv: Två nya algoritmer för korta vägar för alla par (pgr_apspJohnson, pgr_apspWarshall)

source: Bi-directional Dijkstra and A-star search algorithms (pgr_bdAstar, pgr_bdDijkstra)
sv: Dubbelriktade Dijkstra- och A-star-sökalgoritmer (pgr_bdAstar, pgr_bdDijkstra)

source: One to many nodes search (pgr_kDijkstra)
sv: Sökning från en till många noder (pgr_kDijkstra)

source: K alternate paths shortest path (pgr_ksp)
sv: K alternativa vägar kortaste vägen (pgr_ksp)

source: New TSP solver that simplifies the code and the build process (pgr_tsp), dropped "Gaul Library" dependency
sv: Ny TSP-lösare som förenklar koden och byggprocessen (pgr_tsp), har tagit bort beroendet av "Gaul Library"

source: Turn Restricted shortest path (pgr_trsp) that replaces Shooting Star
sv: Turn Begränsad kortaste väg (pgr_trsp) som ersätter Shooting Star

source: Dropped support for Shooting Star
sv: Slopat stöd för Shooting Star

source: Built a test infrastructure that is run before major code changes are checked in
sv: Byggt upp en testinfrastruktur som körs innan större kodändringar checkas in

source: Tested and fixed most all of the outstanding bugs reported against 1.x that existing in the 2.0-dev code base.
sv: Testat och åtgärdat de flesta av de utestående buggarna som rapporterats mot 1.x och som finns i 2.0-dev-kodbasen.

source: Improved build process for Windows
sv: Förbättrad byggprocess för Windows

source: Automated testing on Linux and Windows platforms trigger by every commit
sv: Automatiserad testning på Linux- och Windows-plattformar som utlöses av varje åtagande

source: Modular library design
sv: Modulär biblioteksdesign

source: Compatibility with PostgreSQL 9.1 or newer
sv: Kompatibilitet med PostgreSQL 9.1 eller nyare

source: Compatibility with PostGIS 2.0 or newer
sv: Kompatibilitet med PostGIS 2.0 eller nyare

source: Installs as PostgreSQL EXTENSION
sv: Installeras som PostgreSQL EXTENSION

source: Return types re factored and unified
sv: Returtyperna är faktorerade och enhetliga

source: Support for table SCHEMA in function parameters
sv: Stöd för tabellen SCHEMA i funktionsparametrar

source: Support for ``st_`` PostGIS function prefix
sv: Stöd för PostGIS-funktionsprefixet ``st_``

source: Added ``pgr_`` prefix to functions and types
sv: Lagt till prefixet ``pgr_`` för funktioner och typer

source: Better documentation: https://docs.pgrouting.org
sv: Bättre dokumentation: https://docs.pgrouting.org

source: shooting_star is discontinued
sv: shooting_star är avvecklad

source: To see the issues closed by this release see the `Git closed issues for 1.x <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+1.x%22+is%3Aclosed>`_ on Github. The following release notes have been copied from the previous ``RELEASE_NOTES`` file and are kept as a reference.
sv: För att se de problem som stängts av denna utgåva, se `Git stängda problem för 1.x <https://github.com/pgRouting/pgrouting/issues?q=milestone%3A%22Release+1.x%22+is%3Aclosed>`_ på Github. Följande release notes har kopierats från den tidigare filen ``RELEASE_NOTES`` och behålls som en referens.

source: Changes for release 1.05
sv: Ändringar för version 1.05

source: Changes for release 1.03
sv: Ändringar för version 1.03

source: Much faster topology creation
sv: Mycket snabbare skapande av topologi

source: Changes for release 1.02
sv: Ändringar för version 1.02

source: Shooting* bug fixes
sv: Fotografering* buggfixar

source: Compilation problems solved
sv: Kompileringsproblem lösta

source: Changes for release 1.01
sv: Ändringar för version 1.01

source: Changes for release 1.0
sv: Ändringar för version 1.0

source: Core and extra functions are separated
sv: Kärn- och extrafunktioner separeras

source: Cmake build process
sv: Byggprocess med Cmake

source: Changes for release 1.0.0b
sv: Ändringar för version 1.0.0b

source: Additional SQL file with more simple names for wrapper functions
sv: Ytterligare SQL-fil med enklare namn för wrapper-funktioner

source: Changes for release 1.0.0a
sv: Ändringar för version 1.0.0a

source: Shooting* shortest path algorithm for real road networks
sv: Algoritm för kortaste väg för verkliga vägnät

source: Several SQL bugs were fixed
sv: Flera SQL-buggar har åtgärdats

source: Changes for release 0.9.9
sv: Ändringar för version 0.9.9

source: PostgreSQL 8.2 support
sv: Stöd för PostgreSQL 8.2

source: Shortest path functions return empty result if they could not find any path
sv: Kortaste vägen-funktioner returnerar ett tomt resultat om de inte kunde hitta någon väg

source: Changes for release 0.9.8
sv: Ändringar för version 0.9.8

source: Renumbering scheme was added to shortest path functions
sv: Omnumreringssystem lades till för funktioner för kortaste vägen

source: Directed shortest path functions were added
sv: Directed shortest path-funktioner lades till

source: routing_postgis.sql was modified to use dijkstra in TSP search
sv: routing_postgis.sql modifierades för att använda dijkstra i TSP-sökning

source: Function Families
sv: Funktionsfamiljer

source: Sample Data
sv: Exempeldata

source: The documentation provides very simple example queries based on a small sample network that resembles a city. To be able to execute the majority of the examples queries, follow the instructions below.
sv: Dokumentationen innehåller mycket enkla exempel på frågor som baseras på ett litet exempelnätverk som liknar en stad. Följ instruktionerna nedan för att kunna utföra de flesta av exempelfrågorna.

source: Main graph
sv: Huvudgraf

source: A graph consists of a set of edges and a set of vertices.
sv: En graf består av en uppsättning kanter och en uppsättning hörn.

source: The following city is to be inserted into the database:
sv: Följande stad ska läggas in i databasen:
