Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Using the old structure of restrictions
zh_hans: 使用旧的限制结构

source: The new structure of restrictions is been used.
zh_hans: 使用了新的限制结构。

source: It is the second parameter.
zh_hans: 这是第二个参数。

source: The integral types of the ``sql`` can only be ``INTEGER``.
zh_hans: ``sql``的整型类型只能是``INTEGER``。

source: The floating point type of the ``sql`` can only be ``FLOAT``.
zh_hans: ``sql``的浮点类型只能是``FLOAT``。

source: For these migration guide the following points will be used:
zh_hans: 对于这些迁移指南，将使用以下几点：

source: :doc:`pgr_withPoints` when there are no restrictions,
zh_hans: :doc:`pgr_withPoints`当没有任何限制的时候，

source: :doc:`pgr_trsp_withPoints` (One to One) when there are restrictions.
zh_hans: :doc:`pgr_trsp_withPoints` (一对一) 当有限制时。

source: Migrating ``pgr_trsp`` (Edges) using ``pgr_withPoints``
zh_hans: 使用 ``pgr_withPoints``迁移 ``pgr_trsp``（边）

source: Use :doc:`pgr_withPoints` instead.
zh_hans: 请使用 :doc:`pgr_withPoints`。

source: Do not show details, as the deprecated function does not show details.
zh_hans: 不显示详细信息，因为已弃用的函数不显示详细信息。

source: On the points query do not include the ``side`` column.
zh_hans: 在点查询中不包括 ``side``列。

source: When the need of using strictly the same (meaningless) names and types, and node values of the function been migrated then:
zh_hans: 当需要使用严格相同（无意义）的名称和类型，并且函数的节点值被迁移时：

source: Migrating ``pgr_trsp`` (Edges) using ``pgr_trsp_withPoints``
zh_hans: 使用 ``pgr_trsp_withPoints`` 迁移 ``pgr_trsp`` （边）

source: The integral types of the ``Edges SQL`` can only be ``INTEGER``.
zh_hans: ``Edges SQL``的整数类型只能是 ``INTEGER``。

source: :doc:`pgr_dijkstraVia` when there are no restrictions,
zh_hans: :doc:`pgr_dijkstraVia`当无限制时，

source: :doc:`pgr_trspVia` when there are restrictions.
zh_hans: :doc:`pgr_trspVia`当有限制时。

source: Migrating ``pgr_trspViaVertices`` using ``pgr_dijkstraVia``
zh_hans: 使用 ``pgr_dijkstraVia``迁移 ``pgr_trspViaVertices``

source: Migrating ``pgr_trspViaVertices`` using ``pgr_trspVia``
zh_hans: 使用``pgr_trspVia``迁移 ``pgr_trspViaVertices``

source: And will travel thru the following Via points :math:`4\rightarrow3\rightarrow6`
zh_hans: 并将途经以下途经点： :math:`4\rightarrow3\rightarrow6`

source: :doc:`pgr_withPointsVia` when there are no restrictions,
zh_hans: :doc:`pgr_withPointsVia`当没有限制时，

source: :doc:`pgr_trspVia_withPoints` when there are restrictions.
zh_hans: :doc:`pgr_trspVia_withPoints`当有限制时。

source: Migrating ``pgr_trspViaEdges`` using ``pgr_withPointsVia``
zh_hans: 使用``pgr_withPointsVia``迁移``pgr_trspViaEdges``

source: Migrating ``pgr_trspViaEdges`` using ``pgr_trspVia_withPoints``
zh_hans: 使用``pgr_trspVia_withPoints``迁移``pgr_trspViaEdges``

source: :math:`V` is a set of vertices, also called nodes.
zh_hans: :math:`V`是一组顶点，也称为节点。

source: Edge :math:`2` (:math:`1 \frac{\;\;\;\;\;}{} 3`) is not part of the graph.
zh_hans: 边 :math:`2` (:math:`1 \frac{\;\;\;\;\;}{} 3`) 不是图的一部分。

source: The set of vertices :math:`V`:
zh_hans: 顶点 :math:`V`的集合：

source: Personal relationships, genealogy, file dependency problems can be solved using pgRouting. Those problems, normally, do not come with geometries associated with the graph.
zh_hans: 人际关系、家谱、文件依赖问题都可以使用pgRouting来解决。 通常，这些问题不会与与图形相关的几何图形相关。

source: :doc:`sampledata`: a small graph used on the documentation examples
zh_hans: :doc:`sampledata`: 文档示例中使用的小图

source: See :doc:`sampledata` for an example for building a topology.
zh_hans: 有关构建拓扑的示例，请参阅 :doc:`示例数据`。

source: :math:`1` when the edge exists in the graph
zh_hans: 当边存在于图中时为:math:`1`

source: :math:`-1` when the edge does not exist in the graph
zh_hans: 当图中不存在边时为:math:`-1`

source: That information is correct, for example, when in terms of vehicles, is it a tunnel or bride crossing over another road.
zh_hans: 这些信息是正确的，例如，在车辆方面，它是一个穿越另一条道路的隧道或桥梁。

source: Adding split edges
zh_hans: 添加分割边

source: For each pair of crossing edges a process similar to this one must be performed.
zh_hans: 对于每一对交叉边，必须执行与此类似的过程。

source: The columns inserted and the way are calculated are based on the application. For example, if the edges have a trait **name**, then that column is to be copied.
zh_hans: 插入的列和计算方式取决于应用程序。 例如，如果边具有特征**名称**，则将复制该列。

source: For pgRouting calculations
zh_hans: 用于 pgRouting 计算

source: **factor** based on the position of the intersection of the edges can be used to adjust the ``cost`` and ``reverse_cost`` columns.
zh_hans: 基于边相交位置的**因子**可用于调整``cost`` 和``reverse_cost`` 列。

source: Capacity information, used on the :doc:`flow-family` functions does not need to change when splitting edges.
zh_hans: 分割边时， :doc:`flow-family` 函数上使用的容量信息不需要更改。

source: Adding new vertices
zh_hans: 添加新的顶点

source: After adding all the split edges required by the application, the newly created vertices need to be added to the vertices table.
zh_hans: 添加应用程序所需的所有分割边后，需要将新创建的顶点添加到顶点表中。

source: Updating edges topology
zh_hans: 更新边拓扑

source: Removing the surplus edges
zh_hans: 去除多余的边

source: Once all significant information needed by the application has been transported to the new edges, then the crossing edges can be deleted.
zh_hans: 一旦应用程序所需的所有重要信息都已传输到新边，则可以删除交叉边。

source: There are other options to do this task, like creating a view, or a materialized view.
zh_hans: 还有其他选项可以完成此任务，例如创建视图或物化视图。

source: Updating vertices topology
zh_hans: 更新顶点拓扑

source: To keep the graph consistent, the vertices topology needs to be updated
zh_hans: 为了保持图的一致性，需要更新顶点拓扑

source: Checking for crossing edges
zh_hans: 检查交叉边

source: There are no crossing edges on the graph.
zh_hans: 图上没有交叉边。

source: Disconnected graphs
zh_hans: 断开连接的图

source: In this example, the component :math:`2` consists of vertices :math:`\{2, 4\}` and both vertices are also part of the dead end result set.
zh_hans: 在此示例中，组件 :math:`2`由顶点 :math:`\{2, 4\}` 组成，并且两个顶点也是死端结果集的一部分。

source: This graph needs to be connected.
zh_hans: 这个图需要连接起来。

source: With the original graph of this documentation, there would be 3 components as the crossing edge in this graph is a different component.
zh_hans: 对于本文档的原始图，将有 3 个组件，因为该图中的交叉边是不同的组件。

source: Prepare storage for connection information
zh_hans: 为连接信息准备存储

source: Save the vertices connection information
zh_hans: 保存顶点连接信息

source: Save the edges connection information
zh_hans: 保存边连接信息

source: Get the closest vertex
zh_hans: 获取最近的顶点

source: Using :doc:`pgr_findCloseEdges` the closest vertex to component :math:`1` is vertex :math:`4`. And the closest edge to vertex :math:`4` is edge :math:`14`.
zh_hans: 使用 :doc:`pgr_findCloseEdges` 距离组件 :math:`1` 最近的顶点是顶点 :math:`4` 。 距离顶点:math:`4`最近的边是 边 :math:`14`。

source: The ``edge`` can be used to connect the components, using the ``fraction`` information about the edge :math:`14` to split the connecting edge.
zh_hans: ``edge``可用于连接组件，利用边 :math:`14`的``fraction`` 信息来分割连接边。

source: There are three basic ways to connect the components
zh_hans: 连接组件有三种基本方法

source: The following query shows the three ways to connect the components:
zh_hans: 以下查询显示了连接组件的三种方式：

source: Checking components
zh_hans: 检查组件

source: Ignoring the edge that requires further work. The graph is now fully connected as there is only one component.
zh_hans: 忽略需要进一步工作的边缘。 该图现在已完全连接，因为只有一个组件。

source: That information is correct, for example, when the dead end is on the limit of the imported graph.
zh_hans: 例如，当死端位于导入图的极限时，该信息是正确的。

source: Visually node :math:`4` looks to be as start/ending of 3 edges, but it is not.
zh_hans: 从视觉上看，节点 :math:`4` 看起来是 3 条边的开始/结束，但事实并非如此。

source: Is that correct?
zh_hans: 那是对的吗？

source: When there are many dead ends, to speed up, the :doc:`contraction-family` functions can be used to divide the problem.
zh_hans: 当有很多死端时，为了加快速度，可以使用 :doc:`contraction-family` 函数来划分问题。

source: This information is correct, for example, when the application is taking into account speed bumps, stop signals.
zh_hans: 例如，当应用程序考虑减速带、停止信号时，此信息是正确的。

source: When there are many linear edges, to speed up, the :doc:`contraction-family` functions can be used to divide the problem.
zh_hans: 当线性边较多时，为了加快速度，可以使用:doc:`contraction-family`函数来划分问题。

source: There are several kinds of valid inner queries and also the columns returned are depending of the function. Which kind of inner query will depend on the function(s) requirements. To simplify variety of types, **ANY-INTEGER** and **ANY-NUMERICAL** is used.
zh_hans: 有多种有效的内部查询，返回的列也取决于函数。 哪种内部查询取决于函数的要求。 为了简化各种类型，使用 **ANY-INTEGER** 和 **ANY-NUMERICAL** 。

source: Used on combination signatures
zh_hans: 用于组合签名

source: When ``true`` departing from a visited vertex will not try to avoid using the edge used to reach it. In other words, U turn using the edge with same identifier is allowed.
zh_hans: 当 为``true``时，从已访问的顶点出发，不会试图避免使用用于到达它的边。换句话说，允许使用具有相同标识符的边来进行掉头。

source: When ``false`` when a departing from a visited vertex tries to avoid using the edge used to reach it. In other words, U turn using the edge with same identifier is used when no other path is found.
zh_hans: 当为``false``时，从已访问的顶点出发，尝试避免使用用于到达它的边。换句话说，只有在找不到其他路径时才使用具有相同标识符的边来进行掉头。

source: Return columns for a path
zh_hans: 返回路径的列

source: Used on functions that return one path solution
zh_hans: 用于返回单路径解决方案的函数

source: Returns set of ``(seq, path_seq [, start_vid] [, end_vid], node, edge, cost, agg_cost)``
zh_hans: 返回``(seq, path_seq [, start_vid] [, end_vid], node, edge, cost, agg_cost)``的集合

source: Identifier of the starting vertex. Returned when multiple starting vetrices are in the query.
zh_hans: 起始顶点的标识符。 当查询中有多个起始向量时返回。

source: Identifier of the ending vertex. Returned when multiple ending vertices are in the query.
zh_hans: 结束顶点的标识符。 当查询中有多个结束顶点时返回。

source: Used on functions the following:
zh_hans: 用于以下函数：

source: Returns set of ``(seq, path_seq [, start_pid] [, end_pid], node, edge, cost, agg_cost)``
zh_hans: 返回``(seq, path_seq [, start_pid] [, end_pid], node, edge, cost, agg_cost)``的集合

source: Relative position in the path.
zh_hans: 路径中的相对位置。

source: **1** For the first row of the path.
zh_hans: **1 **对于路径的第一行。

source: Identifier of a starting vertex/point of the path.
zh_hans: 路径起始顶点/点的标识符。

source: When positive is the identifier of the starting vertex.
zh_hans: 当正数时是起始顶点的标识符。

source: When negative is the identifier of the starting point.
zh_hans: 当负数时是起点的标识符。

source: Returned on `Many to One`_ and `Many to Many`_
zh_hans: 返回`多对一`_和`多对多`_

source: Identifier of an ending vertex/point of the path.
zh_hans: 路径结束顶点/点的标识符。

source: When positive is the identifier of the ending vertex.
zh_hans: 当正数时是结束顶点的标识符。

source: When negative is the identifier of the ending point.
zh_hans: 当负数时是终点的标识符。

source: Returned on `One to Many`_ and `Many to Many`_
zh_hans: 返回`一对多`_和`多对多`_

source: Identifier of the node in the path from ``start_pid`` to ``end_pid``.
zh_hans: 从``start_pid`` 到``end_pid``路径中节点的标识符。

source: When positive is the identifier of the a vertex.
zh_hans: 当正数时是顶点的标识符。

source: When negative is the identifier of the a point.
zh_hans: 当负数时是a点的标识符。

source: **-1** for the last row of the path.
zh_hans: **-1 **表示路径的最后一行。

source: **0** For the first row of the path.
zh_hans: **0** 表示路径的第一行。

source: Returns ``(seq, path_seq, start_vid, end_vid, node, edge, cost, agg_cost)``
zh_hans: 返回``(seq, path_seq, start_vid, end_vid, node, edge, cost, agg_cost)``

source: Multiple paths
zh_hans: 多条路径

source: Selective for multiple paths.
zh_hans: 多路径选择性。

source: The columns depend on the function call.
zh_hans: 这些列取决于函数调用。

source: Set of ``(seq, path_id, path_seq [, start_vid] [, end_vid], node, edge, cost, agg_cost)``
zh_hans: ``(seq, path_id, path_seq [, start_vid] [, end_vid], node, edge, cost, agg_cost)``集合

source: Non selective for multiple paths
zh_hans: 多路径非选择性

source: Regardless of the call, al the columns are returned.
zh_hans: 无论调用如何，都会返回所有列。

source: Returns set of ``(seq, path_id, path_seq, start_vid, end_vid, node, edge, cost, agg_cost)``
zh_hans: 返回集合``(seq, path_id, path_seq, start_vid, end_vid, node, edge, cost, agg_cost)``

source: Return columns for cost functions
zh_hans: 返回成本函数的列

source: Used in the following
zh_hans: 用于以下函数

source: Return columns for flow functions
zh_hans: 流函数的返回列

source: Edges SQL for the following
zh_hans: Edges SQL 适用于以下内容

source: Return columns for spanning tree functions
zh_hans: 返回生成树函数的列

source: Returns SET OF ``(edge, cost)``
zh_hans: 返回集合``(edge, cost)``

source: Wiki
zh_hans: 维基

source: Edit an existing `pgRouting Wiki <https://github.com/pgRouting/pgrouting/wiki>`__ page.
zh_hans: 编辑现有的 `pgRouting 维基 <https://github.com/pgRouting/pgrouting/wiki>`__ 页面。

source: Adding Functionaity to pgRouting
zh_hans: 向 pgRouting 添加功能

source: Installation
zh_hans: 安装

source: To upgrade pgRouting in the database to version 3.6.0 use the following command:
zh_hans: 要将数据库中的 pgRouting 升级到版本 3.5.1，请使用以下命令：

source: PostGIS version >= 2.2
zh_hans: PostGIS版本 >= 2.2

source: Individuals in this release (in alphabetical order)
zh_hans: 本版本的个人贡献者 (按字母顺序)

source: And all the people that give us a little of their time making comments, finding issues, making pull requests etc. in any of our products: osm2pgrouting, pgRouting, pgRoutingLayer, workshop.
zh_hans: 并且所有那些花一点时间为我们的任何产品提供评论、发现问题、提交请求等的人们，包括 osm2pgrouting、pgRouting、pgRoutingLayer 和 workshop。

source: The Migration guide from 2.6 can be found at https://github.com/pgRouting/pgrouting/wiki/Migration-Guide.
zh_hans: 2.6 版的迁移指南可以在 https://github.com/pgRouting/pgrouting/wiki/Migration-Guide 找到。

source: Version 3.6.0
zh_hans: 版本3.6.0

source: Return columns standarized to: |nksp-result|
zh_hans: 返回标准化后的列：|nksp-result|

source: ``pgr_ksp`` (One to One)
zh_hans: ``pgr_ksp`` (一对一)

source: New overload functions:
zh_hans: 新的重载函数：

source: ``pgr_ksp`` (One to Many)
zh_hans: ``pgr_ksp`` (一对多)

source: ``pgr_ksp`` (Many to One)
zh_hans: ``pgr_ksp`` (多对一)

source: ``pgr_ksp`` (Many to Many)
zh_hans: ``pgr_ksp`` (多对多)

source: ``pgr_ksp`` (Combinations)
zh_hans: ``pgr_ksp`` (组合)

source: Version 2.1.0
zh_hans: 版本2.1.0

source: Version 2.0.0
zh_hans: 版本2.0.0

source: **Official** function
zh_hans: **官方** 函数

source: Has value **1** for the first of a path from ``start_vid`` to ``end_vid``
zh_hans: 从``start_vid``到 ``end_vid``的第一个路径的值为 **1**

source: Identifier of the node in the path from ``start_vid`` to ``end_vid``
zh_hans: 从``start_vid`` 到 ``end_vid``路径中节点的标识符

source: :math:`0` for the last ``node`` of the path.
zh_hans: :math:`0`为路径的最后一个``node``。

source: Aggregate cost from **start vid** to ``node``.
zh_hans: 从 **start vid**到``node``的总成本。

source: ``pgr_TSP`` - Aproximation using *metric* algorithm.
zh_hans: ``pgr_TSP`` -使用*metric*算法的近似方法。

source: Version 3.2.1
zh_hans: 版本3.2.1

source: The Simulated Annealing Algorithm related parameters are ignored: max_processing_time, tries_per_temperature, max_changes_per_temperature, max_consecutive_non_changes, initial_temperature, final_temperature, cooling_factor, randomize
zh_hans: Simulated Annealing算法相关参数被忽略：max_processing_time、tries_per_temper、max_changes_per_tempere、max_consecutive_non_changes、initial_temper、final_temper、cooling_factor、randomize

source: Version 2.3.0
zh_hans: 版本2.3.0

source: The solutions generated is garanteed to be *twice as long as the optimal tour in the worst case*
zh_hans: 生成的解决方案保证是*最坏情况下最优路径时间的两倍*

source: It is **not garanteed** that the solution will be, in the worse case, twice as long as the optimal tour, due to the fact that `end_vid` is forced to be in a fixed position.
zh_hans: 在最坏情况下，**不能保证**解决方案将是最优路径的两倍长，因为 `end_vid` 被强制设置在固定位置。

source: It is **not garanteed** that the solution will be, in the worse case, twice as long as the optimal tour
zh_hans: **不能保证**在最坏情况下解决方案将是最优路径的两倍长

source: The minimum value of the ``agg_cost`` all instances of edge `(u, v)` is going to be considered as the ``agg_cost`` of edge `(u, v)`
zh_hans: 边 `(u, v)` 的所有实例的 ``agg_cost`` 最小值将被视为边`(u, v)`的 ``agg_cost``

source: When the data is incomplete, but it is a connected graph:
zh_hans: 当数据不完整，但是是连通图时：

source: the missing values will be calculated with dijkstra algorithm.
zh_hans: 缺失值将使用 dijkstra 算法计算。

source: Using points of interest to generate an asymetric matrix.
zh_hans: 使用兴趣点生成不对称矩阵。

source: **Line 6** Generating an asymetric matrix with ``directed => true``
zh_hans: **Line 6** 使用``directed => true``生成一个非对称矩阵

source: :math:`min(agg\_cost(u, v), agg\_cost(v, u))` is going to be considered as the ``agg_cost``
zh_hans: :math:`min(agg\_cost(u, v), agg\_cost(v, u))` 将被视为 ``agg_cost``

source: ``pgr_TSPeuclidean`` - Aproximation using *metric* algorithm.
zh_hans: ``pgr_TSPeuclidean`` -使用*metric*算法进行近似。

source: Version 3.0.0
zh_hans: 版本3.0.0

source: New **Official** function
zh_hans: **官方**新函数

source: Any duplicated identifier will be ignored. The coordinates that will be kept
zh_hans: 任何重复的标识符都将被忽略。 将保留的坐标

source: is arbitrarly.
zh_hans: 是任意的。

source: Visualy, The first image is the `optimal solution <https://www.math.uwaterloo.ca/tsp/world/witour.html>`__ and the second image is the solution obtained with ``pgr_TSPeuclidean``.
zh_hans: 从视觉上看，第一幅图像是 `最优解 <https://www.math.uwaterloo.ca/tsp/world/witour.html>`__ ，第二幅图像是使用 ``pgr_TSPeuclidean``获得的解。

source: :doc:`sampledata` network.
zh_hans: :doc:`sampledata` 网络。

source: Standarizing output columns to |short-generic-result|
zh_hans: 标准输出列|short-generic-result|

source: ``pgr_aStar`` (`One to One`_) added ``start_vid`` and ``end_vid`` columns.
zh_hans: ``pgr_aStar`` (`一对一`_) 增加 ``start_vid`` 和 ``end_vid`` 列.

source: ``pgr_aStar`` (`One to Many`_) added ``end_vid`` column.
zh_hans: ``pgr_aStar`` (`一对多`_) 增加 ``end_vid`` 列.

source: ``pgr_aStar`` (`Many to One`_) added ``start_vid`` column.
zh_hans: ``pgr_aStar`` (`多对一`_) 增加 ``start_vid``列.

source: Version 3.2.0
zh_hans: 版本3.2.0

source: New **proposed** signature:
zh_hans: 新 **拟议**的签名：

source: ``pgr_aStar`` (`Combinations`_)
zh_hans: ``pgr_aStar`` (`组合`_)

source: Version 2.4.0
zh_hans: 版本2.4.0

source: New **Proposed** signatures:
zh_hans: 新**拟议**签名：

source: ``pgr_aStar`` (`One to Many`_)
zh_hans: ``pgr_aStar`` (`一对多`_)

source: ``pgr_aStar`` (`Many to One`_)
zh_hans: ``pgr_aStar`` (`多对一`_)

source: ``pgr_aStar`` (`Many to Many`_)
zh_hans: ``pgr_aStar`` (`多对多`_)

source: Signature change on ``pgr_astar`` (`One to One`_)
zh_hans: 签名更改``pgr_astar`` (`一对一`_)

source: **Official** ``pgr_aStar`` (`One to One`_)
zh_hans: **官方**``pgr_aStar`` (`一对一`_)

source: `pgr_aStar(` `One to Many`_ `)`
zh_hans: `pgr_aStar(` `一对多`_ `)`

source: `pgr_aStar(` `Many to One`_ `)`
zh_hans: `pgr_aStar(` `多对一`_ `)`

source: `pgr_aStar(` `Many to Many`_ `)`
zh_hans: `pgr_aStar(` `多对多`_ `)`

source: `pgr_aStar(` `Combinations`_ `)`
zh_hans: `pgr_aStar(` `组合`_ `)`

source: ``pgr_aStarCost`` - Total cost of the shortest path(s) using the A* algorithm.
zh_hans: ``pgr_aStarCost`` -使用 A* 算法的最短路径的总成本。

source: ``pgr_aStarCost`` (`Combinations`_)
zh_hans: ``pgr_aStarCost`` (`组合`_)

source: New **proposed** function
zh_hans: 新**拟议**函数

source: The ``pgr_aStarCost`` function sumarizes of the cost of the shortest path(s) using the A* algorithm.
zh_hans: ``pgr_aStarCost`` 函数使用 A* 算法汇总最短路径的成本。

source: Using internaly the :doc:`pgr_aStar` algorithm
zh_hans: 内部使用 :doc:`pgr_aStar`算法

source: ``pgr_alphaShape`` — Polygon part of an alpha shape.
zh_hans: ``pgr_alphaShape`` — Alpha 形状的多边形部分。

source: Breaking change on signature
zh_hans: 签名的重大更改

source: **Boost 1.54** & **Boost 1.55** are supported
zh_hans: **Boost 1.54** & **Boost 1.55**被支持

source: **Boost 1.56+** is preferable
zh_hans: **Boost 1.56+**更好

source: Boost Geometry is stable on Boost 1.56
zh_hans: Boost Geometry 在 Boost 1.56 上保持稳定

source: Added alpha argument with default 0 (use optimal value)
zh_hans: 添加了默认值为 0 的 alpha 参数（使用最佳值）

source: Support to return multiple outer/inner ring
zh_hans: 支持返回多个外/内圈

source: Renamed from version 1.x
zh_hans: 从版本1.X重命名

source: Support
zh_hans: 支持

source: Returns the polygon part of an alpha shape.
zh_hans: 返回 alpha 形状的多边形部分。

source: Input is a *geometry* and returns a *geometry*
zh_hans: 输入是*几何图形*并返回*几何图形*

source: Uses PostGis ST_DelaunyTriangles
zh_hans: 使用 PostGis ST_DelaunyTriangles

source: Instead of using CGAL's definition of `alpha` it use the ``spoon_radius``
zh_hans: 它没有使用 CGAL 的`alpha`定义，而是使用 ``spoon_radius``

source: A Triangle area is considered part of the alpha shape when :math:`circumcenter\ radius < spoon\_radius`
zh_hans: 三角形的面积被认为是 alpha shape 的一部分，当且仅当 :math:`circumcenter\ radius < spoon\_radius`

source: The ``alpha`` parameter is the **spoon radius**
zh_hans: ``alpha``参数是 **spoon radius**

source: When the total number of points is less than 3, returns an EMPTY geometry
zh_hans: 当总点数小于 3 时，返回 EMPTY 几何图形

source: passing a geometry collection with spoon radius :math:`1.5` using the return variable ``geom``
zh_hans: 传递一个带有 spoon 半径 :math:`1.5` 的几何集合，使用返回变量 "geom"

source: Geometry with at least :math:`3` points
zh_hans: 至少包含 :math:`3` 个点的几何形状

source: The radius of the spoon.
zh_hans: spoon的半径。

source: Return Value
zh_hans: 返回值

source: Kind of geometry
zh_hans: 几何类型

source: A Geometry collection of Polygons
zh_hans: 多边形的几何集合

source: ``pgr_analyzeGraph`` — Analyzes the network topology.
zh_hans: ``pgr_analyzeGraph`` —分析网络拓扑。

source: The function returns:
zh_hans: 函数返回：

source: ``OK`` after the analysis has finished.
zh_hans: ``OK``分析完成后。

source: ``FAIL`` when the analysis was not completed due to an error.
zh_hans: ``FAIL``当分析因错误而未完成时。

source: Prerequisites
zh_hans: 先决条件

source: The edge table to be analyzed must contain a source column and a target column filled with id's of the vertices of the segments and the corresponding vertices table <edge_table>_vertices_pgr that stores the vertices information.
zh_hans: 待分析的边表必须包含源列和目标列，其中填充了线段顶点的id以及对应的存储顶点信息的顶点表<edge_table>_vertices_pgr。

source: Use :doc:`pgr_createVerticesTable` to create the vertices table.
zh_hans: 使用:doc:`pgr_createVerticesTable`建立顶点表。

source: Use :doc:`pgr_createTopology` to create the topology and the vertices table.
zh_hans: 使用:doc:`pgr_createTopology`建立拓扑和顶点表。

source: The analyze graph function accepts the following parameters:
zh_hans: 分析图函数接受以下参数：

source: ``text`` Network table name. (may contain the schema name as well)
zh_hans: ``text`` 网络表的名称（可能包含模式名称）

source: ``float8`` Snapping tolerance of disconnected edges. (in projection unit)
zh_hans: ``float8``断开边的捕捉容差。 （以投影单位表示）

source: ``text`` Source column name of the network table. Default value is ``source``.
zh_hans: ``text``网络表的Source列名称。 默认值为``source``。

source: ``text`` Target column name of the network table. Default value is ``target``.
zh_hans: ``text``网络表的Target列名称。 默认值为 ``target``。

source: ``text`` Condition to select a subset or rows. Default value is ``true`` to indicate all rows.
zh_hans: ``text``选择子集或行的条件。 默认值为``true`` t表示所有行。

source: Uses the vertices table: <edge_table>_vertices_pgr.
zh_hans: 使用这个顶点表：<edge_table>_vertices_pgr。

source: Fills completely the ``cnt`` and ``chk`` columns of the vertices table.
zh_hans: 完全填充顶点表的``cnt`` 和``chk`` 列。

source: Returns the analysis of the section of the network defined by ``rows_where``
zh_hans: 返回由``rows_where`` 定义的网络部分的分析结果

source: The vertices table is not found.
zh_hans: 未找到顶点表。

source: A required column of the Network table is not found or is not of the appropriate type.
zh_hans: 未找到网络表所需的列或该列的类型不正确。

source: The condition is not well formed.
zh_hans: 条件尚未形成。

source: The names of source , target or id are the same.
zh_hans: source 、 target 或 id 的名称相同。

source: The SRID of the geometry could not be determined.
zh_hans: 无法确定几何图形的 SRID。

source: The Vertices Table
zh_hans: 顶点表

source: The vertices table can be created with :doc:`pgr_createVerticesTable <pgr_createVerticesTable>` or :doc:`pgr_createTopology <pgr_createTopology>`
zh_hans: 顶点表可以使用 :doc:`pgr_createVerticesTable <pgr_createVerticesTable>` 或 :doc:`pgr_createTopology <pgr_createTopology>`创建

source: The structure of the vertices table is:
zh_hans: 顶点表的结构为：
