Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/pgrouting_doc_strings.po
Languages: sv, zh_hans

source: Use :doc:`pgr_withPoints` (One to One) instead.
sv: Använd :doc:`pgr_withPoints` (One to One) istället.

source: Use ``pgr_trsp_withPoints`` when there are restrictions.
sv: Använd ``pgr_trsp_withPoints`` när det finns begränsningar.

source: Use :doc:`pgr_trsp_withPoints` instead.
sv: Använd :doc:`pgr_trsp_withPoints` istället.
zh_hans: 请使用 :doc:`pgr_trsp_withPoints`。

source: Migration of ``pgr_maxCardinalityMatch``
sv: Migrering av ``pgr_maxCardinalityMatch``
zh_hans: 迁移 ``pgr_maxCardinalityMatch``

source: Starting from `v3.4.0 <https://docs.pgrouting.org/3.4/en/migration.html>`__
sv: Startar från `v3.4.0 <https://docs.pgrouting.org/3.4/en/migration.html>`__
zh_hans: 从`v3.4.0 <https://docs.pgrouting.org/3.4/en/migration.html>`__开始

source: Signature to be migrated:
sv: Signatur som ska migreras:
zh_hans: 待迁移签名：

source: Migration is needed, because:
sv: Migration behövs, eftersom:
zh_hans: 需要迁移，因为：

source: Use ``cost`` and ``reverse_cost`` on the inner query
sv: Använd ``cost`` och ``reverse_cost`` på den inre frågan
zh_hans: 在内部查询上使用``cost``和 ``reverse_cost``

source: Results are ordered
sv: Resultaten är ordnade
zh_hans: 结果已排序

source: Works for undirected graphs.
sv: Fungerar för oledade grafer.
zh_hans: 适用于无向图。

source: New signature
sv: Ny signatur
zh_hans: 新签名

source: ``pgr_maxCardinalityMatch(text)`` returns only ``edge`` column.
sv: ``pgr_maxCardinalityMatch(text)`` returnerar endast ``kant`` kolumnen.
zh_hans: ``pgr_maxCardinalityMatch(text)`` 仅仅返回``边``列.

source: The optional flag ``directed`` is removed.
sv: Den valfria flaggan ``directed`` tas bort.
zh_hans: 可选的 ``directed``标志被删除。

source: Before migration
sv: Före migration
zh_hans: 迁移前

source: Columns used are ``going`` and ``coming`` to represent the existence of an edge.
sv: Kolumner som används är "utgående" och "kommande" för att representera existensen av en kant.
zh_hans: 所使用的列是 ``going`` 和 ``coming``，用于表示边的存在。

source: Flag ``directed`` was used to indicate if it was for a **directed** or **undirected** graph.
sv: Flaggan ``directed`` användes för att ange om det var för en **directed** eller **undirected** graf.
zh_hans: ``directed``标志用于指示是**有向**图还是 **无向**图。

source: The flag ``directed`` is ignored.
sv: Flaggan ``directed`` ignoreras.
zh_hans: ``directed``标志被忽略。

source: Regardless of it's value it gives the result considering the graph as **undirected**.
sv: Oavsett dess värde ger det resultatet med tanke på grafen som **undirected**.
zh_hans: 无论它的值如何，它都会给出将图视为**无向**的结果。

source: Use the columns ``cost`` and ``reverse_cost`` to represent the existence of an edge.
sv: Använd kolumnerna ``cost`` och ``reverse_cost`` för att representera existensen av en kant.
zh_hans: 使用 ``cost``和 ``reverse_cost``列来表示边的存在。

source: Do not use the flag ``directed``.
sv: Använd inte flaggan ``directed``.
zh_hans: 不要使用``directed``标志。

source: In the query returns only ``edge`` column.
sv: I frågan returneras endast kolumnen ``edge``.
zh_hans: 查询中仅返回``边``列。

source: Migration of restrictions
sv: Överföring av restriktioner
zh_hans: 限制迁移

source: The structure of the restrictions have changed:
sv: Strukturen på restriktionerna har förändrats:
zh_hans: 限制的结构发生了变化：

source: Old restrictions structure
sv: Gammal begränsningsstruktur
zh_hans: 旧的限制结构

source: On the deprecated signatures:
sv: På de föråldrade signaturerna:
zh_hans: 关于已弃用的签名：

source: Column ``rid`` is ignored
sv: Kolumnen ``rid`` ignoreras
zh_hans: 列 ``rid``被忽略

source: ``via_path``
sv: ``via_väg``

source: Must be in reverse order.
sv: Måste vara i omvänd ordning.
zh_hans: 必须是相反的顺序。

source: Is of type ``TEXT``.
sv: Är av typen ``TEXT``.
zh_hans: 属于 ``TEXT``类型。

source: When more than one via edge must be separated with ``,``.
sv: När mer än en via edge måste separeras med ``,``.
zh_hans: 当多个过孔边必须用``,``分隔时。

source: ``target_id``
sv: ``mål_id``

source: Is the last edge of the forbidden path.
sv: Är den sista kanten av den förbjudna vägen.
zh_hans: 是禁止路径的最后一条边。

source: Is of type ``INTEGER``.
sv: Är av typen ``INTEGER``.
zh_hans: 类型为 ``INTEGER``。

source: ``to_cost``
sv: ``till_kostnad``

source: Is of type ``FLOAT``.
sv: Är av typen ``FLOAT``.
zh_hans: 类型为``FLOAT``。

source: Creation of the old restrictions table
sv: Skapande av den gamla restriktionstabellen
zh_hans: 创建旧限制表

source: Old restrictions fill up
sv: Gamla restriktioner fylls på
zh_hans: 旧限制已满

source: Old restrictions contents
sv: Gamla restriktioner innehåll
zh_hans: 旧限制内容

source: The restriction with ``rid = 2`` is representing :math:`3 \rightarrow 5 \rightarrow9`
sv: Begränsningen med ``rid = 2`` representerar :math:`3 \rightarrow 5 \rightarrow9``
zh_hans: ``rid = 2``的限制表示的是路径 :math:`3 \rightarrow 5 \rightarrow9`

source: is on column ``via_path`` in reverse order
sv: är på kolumn ``via_path`` i omvänd ordning
zh_hans: 以相反的顺序位于 ``via_path`` 列上

source: is of type ``TEXT``
sv: är av typen ``TEXT``
zh_hans: 类型为``TEXT``

source: is on column ``target_id``
sv: är på kolumn ``target_id``
zh_hans: 位于``target_id`` 列上

source: is of type ``INTEGER``
sv: är av typen ``INTEGER``
zh_hans: 类型为``INTEGER``

source: New restrictions structure
sv: Ny struktur för restriktioner
zh_hans: 新的限制结构

source: Column ``id`` is ignored
sv: Kolumnen ``id`` ignoreras
zh_hans: 列 ``id``被忽略

source: Column ``path``
sv: Kolumn "sökväg
zh_hans: 列 ``path``

source: Is of type ``ARRAY[ANY-INTEGER]``.
sv: Är av typen ``ARRAY[ANY-INTEGER]``.
zh_hans: 类型为 ``ARRAY[ANY-INTEGER]``。

source: Contains all the edges involved on the restriction.
sv: Innehåller alla kanter som är involverade i begränsningen.
zh_hans: 包含限制所涉及的所有边。

source: The array has the ordered edges of the restriction.
sv: Arrayen har restriktionens ordnade kanter.
zh_hans: 该数组具有限制的有序边。

source: Column ``cost``
sv: Kolumn ``kostnad``
zh_hans: 列 ``cost``

source: Is of type ``ANY-NUMERICAL``
sv: Är av typen ``ANY-NUMERICAL``
zh_hans: 类型为 ``ANY-NUMERICAL``

source: The creation of the restrictions table
sv: Skapandet av begränsningstabellen
zh_hans: 限制表的创建

source: Adding the restrictions
sv: Lägga till begränsningar
zh_hans: 添加限制

source: Restrictions data
sv: Begränsningar data
zh_hans: 限制数据

source: The restriction with ``rid = 2`` represents the path :math:`3 \rightarrow5 \rightarrow9`.
sv: Restriktionen med ``rid = 2`` representerar sökvägen :math:`3 \rightarrow5 \rightarrow9``.
zh_hans: ``rid = 2`` 的限制表示的是路径 :math:`3 \rightarrow5 \rightarrow9`。

source: By inspection the path is clear.
sv: Vid inspektion är vägen tydlig.
zh_hans: 通过检查，路径是清晰的。

source: To transform the old restrictions table to the new restrictions structure,
sv: Att omvandla den gamla begränsningstabellen till den nya begränsningsstrukturen,
zh_hans: 要将旧的限制表转换为新的限制结构，

source: Create a new table with the new restrictions structure.
sv: Skapa en ny tabell med den nya begränsningsstrukturen.
zh_hans: 使用新的限制结构创建一个新表。

source: In this migration guide ``new_restrictions`` is been used.
sv: I den här migreringsguiden används ``new_restrictions``.
zh_hans: 在此迁移指南中使用了 ``new_restrictions``。

source: For this migration pgRouting supplies an auxiliary function for reversal of an array ``_pgr_array_reverse`` needed for the migration.
sv: För denna migrering tillhandahåller pgRouting en hjälpfunktion för reversering av en array ``_pgr_array_reverse`` som behövs för migreringen.
zh_hans: 为了进行这次迁移，pgRouting 提供了一个用于反转数组的辅助函数 ``_pgr_array_reverse``，这在迁移过程中是必需的。

source: Was created temporally for this migration
sv: Skapades temporärt för denna migration
zh_hans: 是为此迁移临时创建的

source: Is not documented.
sv: Är inte dokumenterad.
zh_hans: 没有记录。

source: Will be removed on the next mayor version 4.0.0
sv: Kommer att tas bort i nästa borgmästarversion 4.0.0
zh_hans: 将在下一个正式版本 4.0.0 中删除

source: The migrated table contents:
sv: Det migrerade tabellinnehållet:
zh_hans: 迁移后的表内容：

source: Ordering - Family of functions
sv: Beställning - Familj av funktioner
zh_hans: 排序 - 函数族

source: pgRouting Concepts
sv: pgRouting-koncept
zh_hans: pgRouting 基本概念

source: This is a simple guide that go through some of the steps for getting started with pgRouting. This guide covers:
sv: Det här är en enkel guide som går igenom några av stegen för att komma igång med pgRouting. Den här guiden täcker:
zh_hans: 这是一个简单的指南，介绍了 pgRouting 入门的一些步骤。 本指南涵盖：

source: Graphs
sv: Diagram
zh_hans: 图

source: A graph is an ordered pair :math:`G = (V ,E)` where:
sv: En graf är ett ordnat par :math:`G = (V ,E)` där:
zh_hans: 图是一个有序对 :math:`G = (V ,E)` ，其中：

source: There are different kinds of graphs:
sv: Det finns olika typer av grafer:
zh_hans: 有不同类型的图：

source: Undirected simple graph
sv: Ogirigerad enkel graf
zh_hans: 无向简单图

source: Directed simple graph
sv: Riktad enkel graf
zh_hans: 有向简单图

source: Graphs:
sv: Diagram:
zh_hans: 图：

source: Do not have geometries.
sv: Har inte geometrier.
zh_hans: 没有几何图形。

source: Some graph theory problems require graphs to have weights, called **cost** in pgRouting.
sv: Vissa grafteoretiska problem kräver att graferna har vikter, som kallas **kostnad** i pgRouting.
zh_hans: 一些图论问题需要图具有权重，在 pgRouting 中称为**成本**。

source: In pgRouting there are several ways to represent a graph on the database:
sv: I pgRouting finns det flera sätt att representera en graf i databasen:
zh_hans: 在 pgRouting 中，有多种方法来表示数据库上的图：

source: With ``cost``
sv: Med ``kostnad``
zh_hans: 使用``cost``

source: With ``cost`` and ``reverse_cost``
sv: Med ``kostnad`` och ``omvänd_kostnad``
zh_hans: 使用 ``cost`` 和 ``reverse_cost``

source: Identifier of the edge. Requirement to use the database in a consistent. manner.
sv: Identifierare av kanten. Krav på att använda databasen på ett konsekvent sätt.
zh_hans: 边的标识符。要求在数据库中以一致的方式使用。

source: Identifier of a vertex.
sv: Identifierare för en vertex.
zh_hans: 顶点的标识符。

source: Weight of the edge (``source``, ``target``):
sv: Kantvikt (``källa``, ``mål``):
zh_hans: 边 (``source``, ``target``)的权重：

source: When negative the edge (``source``, ``target``) do not exist on the graph.
sv: När den är negativ finns inte kanten (``källa``, ``mål``) i grafen.
zh_hans: 当为负时，图上不存在边(``source``, ``target``)。

source: ``cost`` must exist in the query.
sv: ``cost`` måste finnas i frågan.
zh_hans: 查询中必须存在``cost``。

source: When negative the edge (``target``, ``source``) do not exist on the graph.
sv: När den är negativ finns inte kanten (``mål``, ``källa``) i grafen.
zh_hans: 当为负时，图上不存在边(``target``, ``source``)。

source: The decision of the graph to be **directed** or **undirected** is done when executing a pgRouting algorithm.
sv: Beslutet om grafen ska vara **directed** eller **undirected** fattas när en pgRouting-algoritm körs.
zh_hans: 图是**有向**图还是**无向**图的决定是在执行 pgRouting 算法时完成的。

source: Graph with ``cost``
sv: Graf med ``kostnad``
zh_hans: ``成本``图

source: The weighted directed graph, :math:`G_d(V,E)`:
sv: Den viktade riktade grafen, :math:`G_d(V,E)`:
zh_hans: 加权有向图， :math:`G_d(V,E)`:

source: Graph data is obtained with a query
sv: Grafdata erhålls med en fråga
zh_hans: 通过查询获取图数据

source: ``SELECT id, source, target, cost FROM edges``
sv: ``Välj id, källa, mål, kostnad från kanter``

source: Edges where ``cost`` is non negative are part of the graph.
sv: Kanter där ``kostnad`` inte är negativ är en del av grafen.
zh_hans: 成本非负的边是图的一部分。

source: All vertices in ``source`` and ``target`` are part of the graph.
sv: Alla hörn i ``källa`` och ``mål`` är en del av grafen.
zh_hans: ``source`` 和``target``中的所有顶点都是图的一部分。

source: In a directed graph the edge :math:`(source_{id}, target_{id}, cost_{id})` has directionality: :math:`source_{id} \rightarrow target_{id}`
sv: I en riktad graf har kanten :math:`(source_{id}, target_{id}, cost_{id})` riktning: :math:`source_{id} \rightarrow target_{id}`
zh_hans: 在有向图中，边 :math:`(source_{id}, target_{id}, cost_{id})` 具有方向性：:math:`source_{id} \rightarrow target_{id}`

source: For the following data:
sv: För följande uppgifter:
zh_hans: 对于以下数据：

source: Edge :math:`2` (:math:`1 \rightarrow 3`) is not part of the graph.
sv: Edge :math:`2` (:math:`1 \rightarrow 3`) är inte en del av grafen.
zh_hans: 边 :math:`2` (:math:`1 \rightarrow 3`) 不是图的一部分。

source: The data is representing the following graph:
sv: Uppgifterna representeras av följande graf:
zh_hans: 数据代表下图：

source: In an undirected graph the edge :math:`(source_{id}, target_{id}, cost_{id})` does not have directionality: :math:`source_{id} \frac{\;\;\;\;\;}{} target_{id}`
sv: I en ostyrd graf har kanten :math:`(källa_{id}, mål_{id}, kostnad_{id})` inte riktning: :math:`källa_{id} \frac{\;\;\;\;\;}{} mål_{id}`
zh_hans: 在无向图中，边 :math:`(source_{id}, target_{id}, cost_{id})` 没有方向性：:math:`source_{id} \frac{\;\;\;\;\;}{} target_{id}`

source: In terms of a directed graph is like having two edges: :math:`source_{id} \leftrightarrow target_{id}`
sv: I termer av en riktad graf är det som att ha två kanter: :math:`source_{id} \leftrightarrow target_{id}`
zh_hans: 在有向图的术语中，这相当于有两条边：:math:`source_{id} \leftrightarrow target_{id}`

source: Edge :math:`2` (:math:`1 \frac{\;\;\;\;\;}{} 3`) is not part of the graph.
sv: Kanten :math:`2` (:math:`1 \frac{\;\;\;\;\;}{} 3`) är inte en del av grafen.
zh_hans: 边 :math:`2` (:math:`1 \frac{\;\;\;\;\;}{} 3`) 不是图的一部分。

source: Graph with ``cost`` and ``reverse_cost``
sv: Graf med ``kostnad`` och ``omvända_kostnader``
zh_hans: 带有 ``cost``和``reverse_cost``的图

source: ``SELECT id, source, target, cost, reverse_cost FROM edges``
sv: ``SELECT id, källa, mål, kostnad, omvänd_kostnad FROM kanter``

source: The set of edges :math:`E`:
sv: Mängden kanter :math:`E`:
zh_hans: 边的集合 :math:`E`：

source: Edges :math:`(source \rightarrow target)` where ``cost`` is non negative are part of the graph.
sv: Edges :math:`(source \rightarrow target)` där ``cost`` är icke-negativ är en del av grafen.
zh_hans: 边 :math:`(source \rightarrow target)` 中的 ``cost`` 是非负数的都属于图的一部分。

source: Edges :math:`(target \rightarrow source)` where ``reverse_cost`` is non negative are part of the graph.
sv: Edges :math:`(target \rightarrow source)` där ``reverse_cost`` är icke-negativ är en del av grafen.
zh_hans: 边 :math:`(target \rightarrow source)` 中的 ``reverse_cost`` 是非负数的都属于图的一部分。

source: The set of vertices :math:`V`:
sv: Mängden hörn :math:`V`:
zh_hans: 顶点集 :math:`V`：

source: In a directed graph both edges have directionality
sv: I en riktad graf har båda kanterna riktning
zh_hans: 在有向图中，两条边都有方向性

source: edge :math:`(source_{id}, target_{id}, cost_{id})` has directionality: :math:`source_{id} \rightarrow target_{id}`
sv: kanten :math:`(källa_{id}, mål_{id}, kostnad_{id})` har riktning: :math:`källa_{id} \rightarrow mål_{id}`
zh_hans: 边 :math:`(source_{id}, target_{id}, cost_{id})` 具有方向性：:math:`source_{id} \rightarrow target_{id}`

source: edge :math:`(target_{id}, source_{id}, reverse\_cost_{id})` has directionality: :math:`target_{id} \rightarrow source_{id}`
sv: kanten :math:`(target_{id}, source_{id}, reverse\_cost_{id})` har riktning: :math:`target_{id} \rightarrow source_{id}`
zh_hans: 边 :math:`(target_{id}, source_{id}, reverse\_cost_{id})` 具有方向性：:math:`target_{id} \rightarrow source_{id}`

source: Edges not part of the graph:
sv: Kanter som inte är en del av grafen:
zh_hans: 边不是图的一部分：

source: In a directed graph both edges do not have directionality
sv: I en riktad graf har inte båda kanterna riktning
zh_hans: 在有向图中，两条边都没有方向性

source: Edge :math:`(source_{id}, target_{id}, cost_{id})` is :math:`source_{id} \frac{\;\;\;\;\;}{} target_{id}`
sv: Kant :math:`(källa_{id}, mål_{id}, kostnad_{id})` är :math:`källa_{id} \frac{\;\;\;\;\;}{} mål_{id}`
zh_hans: 边 :math:`(source_{id}, target_{id}, cost_{id})` 是 :math:`source_{id} \frac{\;\;\;\;\;}{} target_{id}`

source: Edge :math:`(target_{id}, source_{id}, reverse\_cost_{id})` is :math:`target_{id} \frac{\;\;\;\;\;}{} source_{id}`
sv: Kant :math:`(target_{id}, source_{id}, reverse\_cost_{id})` är :math:`target_{id} \frac{\;\;\;\;\;}{} source_{id}`
zh_hans: 边:math:`(target_{id}, source_{id}, reverse\_cost_{id})`是 :math:`target_{id} \frac{\;\;\;\;\;}{} source_{id}`

source: In terms of a directed graph is like having four edges:
sv: I termer av en riktad graf är det som att ha fyra kanter:
zh_hans: 就有向图而言，就像有四个边：

source: Graphs without geometries
sv: Grafer utan geometrier
zh_hans: 没有几何信息的图

source: Personal relationships, genealogy, file dependency problems can be solved using pgRouting. Those problems, normally, do not come with geometries associated with the graph.
sv: Problem med personliga relationer, släktforskning och filberoende kan lösas med hjälp av pgRouting. Dessa problem har normalt inte geometrier som är kopplade till grafen.
zh_hans: 使用 pgRouting 可以解决个人关系、家谱和文件依赖性问题。这些问题通常不会与图形相关的几何图形一起出现。

source: Wiki example
sv: Wiki-exempel
zh_hans: 维基示例

source: Solve the example problem taken from `wikipedia <https://en.wikipedia.org/wiki/Dijkstra%27s_algorithm>`__):
sv: Lös exempelproblemet hämtat från `wikipedia <https://en.wikipedia.org/wiki/Dijkstra%27s_algoritm>`__):
zh_hans: 解决来自 `维基百科<https://en.wikipedia.org/wiki/Dijkstra%27s_algorithm>`__）的示例问题 ：

source: Problem is to find the shortest path from :math:`1` to :math:`5`.
sv: Problemet är att hitta den kortaste vägen från :math:`1` till :math:`5`.
zh_hans: 问题是找到从 :math:`1`到:math:`5` 的最短路径。

source: Is an undirected graph.
sv: Är en odelad graf.
zh_hans: 是一个无向图。

source: Although visually looks like to have geometries, the drawing is not to scale.
sv: Även om det visuellt ser ut att finnas geometrier är ritningen inte skalenlig.
zh_hans: 虽然视觉上看起来有几何形状，但该图并不是按比例绘制的。

source: No geometries associated to the vertices or edges
sv: Inga geometrier associerade till hörn eller kanter
zh_hans: 没有与顶点或边关联的几何图形

source: Has 6 vertices :math:`\{1,2,3,4,5,6\}`
sv: Har 6 hörn :math:`\{1,2,3,4,5,6\}`
zh_hans: 有6个顶点 :math:`\{1,2,3,4,5,6\}`

source: Has 9 edges:
sv: Har 9 kanter:
zh_hans: 有九个边：

source: The graph can be represented in many ways for example:
sv: Grafen kan representeras på många olika sätt, t.ex:
zh_hans: 该图可以用多种方式表示，例如：

source: Prepare the database
sv: Förbereda databasen
zh_hans: 准备数据库

source: Create a database for the example, access the database and install pgRouting: ::
sv: Skapa en databas för exemplet, gå in i databasen och installera pgRouting: ::
zh_hans: 为示例创建一个数据库，访问数据库并安装 pgRouting：::

source: Create a table
sv: Skapa en tabell
zh_hans: 创建表

source: The basic elements needed to perform basic routing on an undirected graph are:
sv: De grundläggande element som behövs för att utföra grundläggande routing på en odelad graf är:
zh_hans: 在无向图上执行基本路由所需的基本元素是：

source: SMALLINT, INTEGER, BIGINT, REAL, FLOAT
sv: SMALLINT, HELTAL, BIGINT, REAL, FLOAT

source: Using this table design for this example:
sv: Använd denna bordsdesign för detta exempel:
zh_hans: 本示例使用此表设计：

source: Insert the data
sv: Infoga data
zh_hans: 插入数据

source: Find the shortest path
sv: Hitta den kortaste vägen
zh_hans: 寻找最短路径

source: To solve this example :doc:`pgr_dijkstra` is used:
sv: För att lösa detta exempel används :doc:`pgr_dijkstra`:
zh_hans: 为了解决这个例子，使用了 :doc:`pgr_dijkstra`：

source: To go from :math:`1` to :math:`5` the path goes thru the following vertices: :math:`1 \rightarrow 3 \rightarrow 6 \rightarrow 5`
sv: För att gå från :math:`1` till :math:`5` går vägen genom följande hörn: :math:`1 \rightarrow 3 \rightarrow 6 \rightarrow 5`
zh_hans: 从 :math:`1` 到 :math:`5`的路径要经过以下顶点： :math:`1 \rightarrow 3 \rightarrow 6 \rightarrow 5`

source: Vertex information
sv: Information om toppunkt
zh_hans: 顶点信息

source: To obtain the vertices information, use :doc:`pgr_extractVertices`
sv: För att få information om topparna, använd :doc:`pgr_extractVertices`
zh_hans: 要获取顶点信息，请使用 :doc:`pgr_extractVertices`

source: Graphs with geometries
sv: Grafer med geometrier
zh_hans: 具有几何图形的图

source: Create a routing Database
sv: Skapa en routningsdatabas
zh_hans: 创建路由数据库

source: The first step is to create a database and load pgRouting in the database.
sv: Det första steget är att skapa en databas och ladda pgRouting i databasen.
zh_hans: 第一步是创建数据库并在数据库中加载 pgRouting。

source: Typically create a database for each project.
sv: Vanligtvis skapas en databas för varje projekt.
zh_hans: 通常为每个项目创建一个数据库。

source: Once having the database to work in, load your data and build the routing application in that database.
sv: När du väl har en databas att arbeta i laddar du dina data och bygger routingapplikationen i den databasen.
zh_hans: 一旦数据库可以工作，加载数据并在该数据库中构建路由应用程序。

source: Load Data
sv: Ladda data
zh_hans: 加载数据

source: There are several ways to load your data into pgRouting.
sv: Det finns flera sätt att ladda dina data i pgRouting.
zh_hans: 有多种方法可以将数据加载到 pgRouting 中。

source: Manually creating a database.
sv: Skapa en databas manuellt.
zh_hans: 手动创建数据库。

source: `Graphs without geometries`_
sv: "Grafer utan geometrier
zh_hans: `没有几何形状的图`_

source: Using `osm2pgrouting <https://workshop.pgrouting.org/latest/en/basic/data.html>`__
sv: Använda `osm2pgrouting <https://workshop.pgrouting.org/latest/en/basic/data.html>`__
zh_hans: 使用 `osm2pgrouting <https://workshop.pgrouting.org/latest/en/basic/data.html>`__

source: There are various open source tools that can help, like:
sv: Det finns olika verktyg med öppen källkod som kan hjälpa till, t.ex:
zh_hans: 有多种开源工具可以提供帮助，例如：

source: postgresql shapefile loader
sv: postgresql shapefile-laddare
zh_hans: postgresql shapefile 加载器

source: vector data conversion utility
sv: verktyg för konvertering av vektordata
zh_hans: 矢量数据转换实用程序

source: load OSM data into postgresql
sv: ladda OSM-data till postgresql
zh_hans: 将OSM数据加载到postgresql中

source: Please note that these tools will **not** import the data in a structure compatible with pgRouting and when this happens the topology needs to be adjusted.
sv: Observera att dessa verktyg **inte** kommer att importera data i en struktur som är kompatibel med pgRouting och när detta händer måste topologin justeras.
zh_hans: 请注意，这些工具**不会**导入与 pgRouting 兼容的结构中的数据，当发生这种情况时，需要调整拓扑。

source: Breakup a segments on each segment-segment intersection
sv: Dela upp ett segment på varje segment-segment intersektion
zh_hans: 在每个线段-线段交叉点上分解线段

source: When missing, add columns and assign values to ``source``, ``target``, ``cost``, ``reverse_cost``.
sv: Om de saknas, lägg till kolumner och tilldela värden för ``källa``, ``mål``, ``kostnad``, ``omvänd kostnad``.
zh_hans: 如果缺少，请添加列并为``source``, ``target``, ``cost``, ``reverse_cost``分配值。

source: Connect a disconnected graph.
sv: Anslut en frånkopplad graf.
zh_hans: 连接断开的图。

source: Create the complete graph topology
sv: Skapa den fullständiga grafens topologi
zh_hans: 创建完整的图拓扑

source: Create one or more graphs based on the application to be developed.
sv: Skapa en eller flera grafer baserat på den applikation som ska utvecklas.
zh_hans: 根据要开发的应用程序创建一个或多个图。

source: Create a contracted graph for the high speed roads
sv: Skapa ett sammandraget diagram för höghastighetsvägarna
zh_hans: 为高速道路创建收缩图

source: Create graphs per state/country
sv: Skapa grafer per stat/land
zh_hans: 创建每个州/国家的图

source: In few words:
sv: Med några få ord:
zh_hans: 简而言之：

source: Prepare the graph
sv: Förbered grafen
zh_hans: 准备图

source: What and how to prepare the graph, will depend on the application and/or on the quality of the data and/or on how close the information is to have a topology usable by pgRouting and/or some other factors not mentioned.
sv: Vad och hur du ska förbereda grafen beror på applikationen och/eller på datakvaliteten och/eller på hur nära informationen är en topologi som kan användas av pgRouting och/eller på andra faktorer som inte nämns.
zh_hans: 准备什么以及如何准备图将取决于应用程序和/或数据质量和/或信息与 pgRouting 可用的拓扑的接近程度和/或未提及的一些其他因素。
