Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/sampledata.po
Languages: es

source: **Supported versions:** `Latest <https://docs.pgrouting.org/latest/en/sampledata.html>`__ (`3.3 <https://docs.pgrouting.org/3.3/en/sampledata.html>`__) `3.2 <https://docs.pgrouting.org/3.2/en/sampledata.html>`__ `3.1 <https://docs.pgrouting.org/3.1/en/sampledata.html>`__ `3.0 <https://docs.pgrouting.org/3.0/en/sampledata.html>`__
es: **Versiones soportadas:** `Última <https://docs.pgrouting.org/latest/es/sampledata.html>`__ (`3.3 <https://docs.pgrouting.org/3.3/es/sampledata.html>`__) `3.2 <https://docs.pgrouting.org/3.2/es/sampledata.html>`__ `3.1 <https://docs.pgrouting.org/3.1/es/sampledata.html>`__ `3.0 <https://docs.pgrouting.org/3.0/es/sampledata.html>`__

source: **Unsupported versions:** `2.6 <https://docs.pgrouting.org/2.6/en/sampledata.html>`__ `2.5 <https://docs.pgrouting.org/2.5/en/sampledata.html>`__ `2.4 <https://docs.pgrouting.org/2.4/en/sampledata.html>`__ `2.3 <https://docs.pgrouting.org/2.3/en/doc/src/developer/sampledata.html>`__ `2.2 <https://docs.pgrouting.org/2.2/en/doc/src/developer/sampledata.html>`__ `2.1 <https://docs.pgrouting.org/2.1/en/doc/src/developer/sampledata.html>`__ `2.0 <https://docs.pgrouting.org/2.0/en/doc/src/developer/sampledata.html>`__
es: **Versiones no soportadas:** `2.6 <https://docs.pgrouting.org/2.6/en/sampledata.html>`__ `2.5 <https://docs.pgrouting.org/2.5/en/sampledata.html>`__ `2.4 <https://docs.pgrouting.org/2.4/en/sampledata.html>`__ `2.3 <https://docs.pgrouting.org/2.3/en/doc/src/developer/sampledata.html>`__ `2.2 <https://docs.pgrouting.org/2.2/en/doc/src/developer/sampledata.html>`__ `2.1 <https://docs.pgrouting.org/2.1/en/doc/src/developer/sampledata.html>`__ `2.0 <https://docs.pgrouting.org/2.0/en/doc/src/developer/sampledata.html>`__

source: Sample Data
es: Datos Muestra

source: The documentation provides very simple example queries based on a small sample network. To be able to execute the sample queries, run the following SQL commands to create a table with a small network data set.
es: La documentación proporciona consultas de ejemplo muy simples basadas en una red muestra pequeña. Para ser capaz de ejecutar las consultas de la muestra, ejecute los siguientes comandos SQL para crear una tabla con el conjunto de datos de la red.

source: Create table
es: Crear tabla

source: Insert data
es: Insertar datos

source: Updating geometry
es: Actualización de la geometría

source: Topology
es: Topología

source: Before you test a routing function use this query to create a topology (fills the ``source`` and ``target`` columns).
es: Antes de probar una función de ruteo, utiliza esta consulta para crear una topología (rellena las columnas ``source`` y ``target``).

source: Combinations of start and end vertices
es: Combinaciones de vértices de inicio y fin

source: Used to test the combinations_sql signature in dijkstra-like functions.
es: Se utiliza para probar la firma combinations_sql en funciones similares a dijkstra.

source: Points of interest
es: Puntos de interés

source: When points outside of the graph.
es: Cuando hay puntos fuera del grafo.

source: Used with the :doc:`withPoints-family` functions.
es: Se utiliza con las funciones de :doc:`withPoints-family`

source: Restrictions
es: Restricciones

source: Used with the :doc:`pgr_trsp` functions.
es: Se utiliza con las funciones :doc:`pgr_trsp`

source: Images
es: Imágenes

source: Red arrows correspond when ``cost`` > 0 in the edge table.
es: Las flechas rojas corresponden cuando ``cost`` > 0 en la tabla de aristas.

source: Blue arrows correspond when ``reverse_cost`` > 0 in the edge table.
es: Las flechas azules corresponden cuando ``reverse_cost`` > 0 en la tabla de aristas.

source: Points are outside the graph.
es: Los puntos están fuera del grafo.

source: Click on the graph to enlarge.
es: Haga clic en el grafo para ampliarlo.

source: Network for queries marked as ``directed`` and ``cost`` and ``reverse_cost`` columns are used
es: Se utilizan redes para consultas marcadas como ``directed`` , ``cost`` y ``reverse_cost``

source: When working with city networks, this is recommended for point of view of vehicles.
es: Cuando se trabaja con redes de ciudades, esto se recomienda para el punto de vista de los vehículos.

source: **Graph 1: Directed, with cost and reverse cost**
es: **Grafo 1: Dirigido, con costo y costo inverso**

source: Network for queries marked as ``undirected`` and ``cost`` and ``reverse_cost`` columns are used
es: Se utiliza la red para consultas marcadas como ``undirected`` , ``cost`` y ``reverse_cost``

source: When working with city networks, this is recommended for point of view of pedestrians.
es: Cuando se trabaja con redes de ciudades, esto se recomienda para el punto de vista de los peatones.

source: **Graph 2: Undirected, with cost and reverse cost**
es: **Grafo 2: No dirigido, con costo y costo inverso**

source: Network for queries marked as ``directed`` and only ``cost`` column is used
es: Red para consultas marcadas como ``directed`` y sólo se utiliza la columna ``cost``

source: **Graph 3: Directed, with cost**
es: **Grafo 3: Dirigido, con costo**

source: Network for queries marked as ``undirected`` and only ``cost`` column is used
es: Red para consultas marcadas como ``undirected`` y solo se utiliza la columna ``cost``

source: **Graph 4: Undirected, with cost**
es: **Grafo 4: No dirigido, con costo**

source: Pick & Deliver Data
es: Datos de Recogida y Entrega
