Repository: pgRouting/pgrouting
Catalog: locale/*/LC_MESSAGES/TSP-family.po
Languages: es

source: Traveling Sales Person - Family of functions
es: Vendedor Viajante - Familia de funciones

source: :doc:`pgr_TSP` - When input is given as matrix cell information.
es: :doc:`pgr_TSP` -Cuando la entrada se da como información de una celda de matriz.

source: :doc:`pgr_TSPeuclidean` - When input are coordinates.
es: :doc:`pgr_TSPeuclidean` - Cuando lo que entra son coordenadas.

source: Previous versions of this page
es: Versiones anteriores de esta página

source: **Supported versions:** current(`3.1 <https://docs.pgrouting.org/3.1/en/TSP-family.html>`__) `3.0 <https://docs.pgrouting.org/3.0/en/TSP-family.html>`__ `2.6 <https://docs.pgrouting.org/2.6/en/TSP-family.html>`__
es: **Versiones soportadas:** actua​l(`3.1 <https://docs.pgrouting.org/3.1/es/TSP-family.html>`__) `3.0 <https://docs.pgrouting.org/3.0/es/TSP-family.html>`__ `2.6 <https://docs.pgrouting.org/2.6/en/TSP-family.html>`__

source: **Unsupported versions:** `2.5 <https://docs.pgrouting.org/2.5/en/TSP-family.html>`__ `2.4 <https://docs.pgrouting.org/2.4/en/TSP-family.html>`__ `2.3 <https://docs.pgrouting.org/2.3/en/src/tsp/doc/tsp.html>`__
es: **Versiones no soportadas:** `2.5 <https://docs.pgrouting.org/2.5/en/TSP-family.html>`__ `2.4 <https://docs.pgrouting.org/2.4/en/TSP-family.html>`__ `2.3 <https://docs.pgrouting.org/2.3/en/src/tsp/doc/tsp.html>`__

source: Table of Contents
es: Contenido

source: General Information
es: Información general

source: Problem Definition
es: Definición del Problema

source: The travelling salesman problem (TSP) or travelling salesperson problem asks the following question:
es: En el problema del vendedor viajante (TSP) se hace la siguiente pregunta:

source: *Given a list of cities and the distances between each pair of cities, which is the shortest possible route that visits each city exactly once and returns to the origin city?*
es: *Dada una lista de ciudades y las distancias entre cada par de ciudades, que corresponde con la ruta más corta posible que para visite cada ciudad exactamente una vez y regrese a la ciudad de origen?*

source: Origin
es: Origen

source: The traveling sales person problem was studied in the 18th century by mathematicians
es: El problema de los vendedores ambulantes fue estudiado en el siglo XVIII por matemáticos

source: **Sir William Rowam Hamilton** and **Thomas Penyngton Kirkman**.
es: **Sir William Rowam Hamilton** y **Thomas Penyngton Kirkman**.

source: A discussion about the work of Hamilton & Kirkman can be found in the book **Graph Theory (Biggs et al. 1976)**.
es: Una discusión sobre el trabajo de Hamilton & Kirkman se puede encontrar en el libro **Graph Theory (Biggs et al. 1976)**.

source: It is believed that the general form of the TSP have been first studied by Kalr Menger in Vienna and Harvard. The problem was later promoted by Hassler, Whitney & Merrill at Princeton. A detailed description about the connection between Menger & Whitney, and the development of the TSP can be found in `On the history of combinatorial optimization (till 1960) <https://homepages.cwi.nl/~lex/files/histco.ps>`__
es: Se cree que la forma general del TSP ha sido estudiada por primera vez por Kalr Menger en Viena y Harvard. El problema fue promovido más tarde por Hassler, Whitney & Merrill en Princeton. Una descripción detallada sobre la conexión entre Menger & Whitney, y el desarrollo del TSP se puede encontrar en `On the history of combinatorial optimization (till 1960) <https://homepages.cwi.nl/~lex/files/histco.ps>`_

source: Characteristics
es: Características

source: The travel costs are symmetric:
es: Los costes de viaje son simétricos:

source: traveling costs from city A to city B are just as much as traveling from B to A.
es: los costos de viaje de la ciudad A a la ciudad B son tanto como viajar de B a A.

source: This problem is an NP-hard optimization problem.
es: Este problema es un problema de optimización NP-duro.

source: To calculate the number of different tours through :math:`n` cities:
es: Para calcular el número de recorridos diferentes a través de :math:`n` ciudades:

source: Given a starting city,
es: Dada una ciudad de partida,

source: There are :math:`n-1` choices for the second city,
es: Hay :math:`n-1` opción para la segunda ciudad,

source: And :math:`n-2` choices for the third city, etc.
es: Y :math:`n-2` opciones para la tercera ciudad, etc.

source: Multiplying these together we get :math:`(n-1)! = (n-1) (n-2) . . 1`.
es: Multiplicando estos juntos obtenemos :math:`(n-1)! = (n-1) (n-2) . . 1`.

source: Now since our travel costs do not depend on the direction we take around the tour:
es: Ahora bien, dado que nuestros costos de viaje no dependen de la dirección que tomemos alrededor del recorrido:

source: this number by 2
es: este número por 2

source: Simulated Annealing Algorithm
es: Algoritmo de Recocido Simulado

source: The simulated annealing algorithm was originally inspired from the process of annealing in metal work.
es: El algoritmo de recocido simulado se inspiró originalmente en el proceso de recocido en el trabajo de metal.

source: Annealing involves heating and cooling a material to alter its physical properties due to the changes in its internal structure. As the metal cools its new structure becomes fixed, consequently causing the metal to retain its newly obtained properties.
es: El recocido implica calentar y enfriar un material para alterar sus propiedades físicas debido a los cambios en su estructura interna. A medida que el metal se enfría, su nueva estructura se fija, haciendo que el metal conserve sus propiedades recién obtenidas.

source: Pseudocode
es: Pseudocódigo

source: Given an initial solution, the simulated annealing process, will start with a high temperature and gradually cool down until the desired temperature is reached.
es: Dada una solución inicial, el proceso de recocido simulado, comenzará con una alta temperatura y se enfriará gradualmente hasta que se alcance la temperatura deseada.

source: For each temperature, a neighbouring new solution **newSolution** is calculated. The higher the temperature the higher the probability of accepting the new solution as a possible bester solution.
es: Para cada temperatura, se calcula una nueva solución vecina **newSolution**. Cuanto mayor sea la temperatura, mayor será la probabilidad de aceptar la nueva solución como posible mejor solución.

source: Once the desired temperature is reached, the best solution found is returned
es: Una vez alcanzada la temperatura deseada, se devuelve la mejor solución encontrada

source: pgRouting Implementation
es: Implementación de pgRouting

source: pgRouting's implementation adds some extra parameters to allow some exit controls within the simulated annealing process.
es: La implementación de pgRouting agrega algunos parámetros adicionales para permitir algunos controles de salida dentro del proceso de recocido simulado.

source: Limits the number of changes in the solution per temperature
es: Limita el número de cambios en la solución por temperatura

source: Count is reset to :math:`0` when **temperature** changes
es: El recuento se restablece a :math:`0` cuando la **temperatura** cambia

source: Count is increased by :math: `1` when **solution** changes
es: El recuento aumenta en :math: `1` cuando la **solución** cambia

source: Limits the number of consecutive non changes per temperature
es: Limita el número de no cambios consecutivos por temperatura

source: Count is reset to :math:`0` when **solution** changes
es: El recuento se restablece a :math:`0` cuando la **solución** cambia

source: Limits the time the simulated annealing is performed.
es: Limita el tiempo en que se realiza el recocido simulado.

source: Choosing parameters
es: Selección de parámetros

source: There is no exact rule on how the parameters have to be chose, it will depend on the special characteristics of the problem.
es: No hay una regla exacta sobre cómo se deben elegir los parámetros, dependerá de las características especiales del problema.

source: If the computational time is crucial, then limit execution time with **max_processing_time**.
es: Si el tiempo de cálculo es crucial, entonces limite el tiempo de ejecución con **max_processing_time**.

source: Make the **tries_per_temperture** depending on the number of cities (:math:`n`), for example:
es: Haga el **tries_per_temperture** dependiendo del número de ciudades (:math:`n`), por ejemplo:

source: Useful to estimate the time it takes to do one cycle: use `1`
es: Es útil para estimar el tiempo que se tarda en hacer un ciclo: use `1`

source: this will help to set a reasonable **max_processing_time**
es: esto ayudará a establecer un **max_processing_time** razonable

source: For a faster decreasing the temperature set **cooling_factor** to a smaller number, and set to a higher number for a slower decrease.
es: Para una disminución más rápida de la temperatura, establezca **cooling_factor** en un número menor y establezca un número mayor para una disminución más lenta.

source: When for the same given data the same results are needed, set **randomize** to `false`.
es: Cuando para los mismos datos dados se necesitan los mismos resultados, establezca **randomize** en `falso`.

source: When estimating how long it takes to do one cycle: use `false`
es: Al estimar cuánto tiempo se tarda en hacer un ciclo: use `false`

source: A recommendation is to play with the values and see what fits to the particular data.
es: Una recomendación es jugar con los valores y ver lo que se ajusta a los datos en particular.

source: Description of the Control Parameters
es: Descripción de los Parámetros de Control

source: The control parameters are optional, and have a default value.
es: Los parámetros de control son opcionales y tienen un valor predeterminado.

source: Parameter
es: Parámetro

source: Type
es: Tipo

source: Default
es: Valores predeterminados

source: Description
es: Descripción

source: The greedy part of the implementation will use this identifier.
es: La parte ambiciosa de la implementación utilizará este identificador.

source: Last visiting vertex before returning to start_vid.
es: El último vértice de visita antes de volver a start_vid.

source: Stop the annealing processing when the value is reached.
es: Detenga el proceso de recocido cuando se alcance el valor.

source: Maximum number of times a neighbor(s) is searched in each temperature.
es: Número máximo de veces que se busca a un(os) vecino(s) en cada temperatura.

source: Maximum number of times the solution is changed in each temperature.
es: Número máximo de veces que se cambia la solución en cada temperatura.

source: Maximum number of consecutive times the solution is not changed in each temperature.
es: Número máximo de veces consecutivas que la solución no cambia en cada temperatura.

source: Starting temperature.
es: Temperatura de inicio.

source: **final_temperature**
es: **temperatura_final**

source: Ending temperature.
es: Temperatura final.

source: **cooling_factor**
es: **factor_de_enfriamiento**

source: Value between between 0 and 1 (not including) used to calculate the next temperature.
es: Valor entre 0 y 1 (sin incluir) utilizado para calcular la siguiente temperatura.

source: **randomize**
es: **aleatorizar**

source: Choose the random seed
es: Elija la semilla aleatoria

source: true: Use current time as seed
es: true: Utilice el tiempo actual como semilla

source: false: Use `1` as seed. Using this value will get the same results with the same data in each execution.
es: falso: Use `1` como semilla. Usando este valor obtendrá los mismos resultados con los mismos datos en cada ejecución.

source: Description of the return columns
es: Descripción de las columnas de devolución

source: Returns SET OF ``(seq, node, cost, agg_cost)``
es: Devuelve el CONJUNTO DE ``(seq, node, cost, agg_cost)``

source: Column
es: Columna

source: Row sequence.
es: Secuencia de filas.

source: Identifier of the node/coordinate/point.
es: Identificador del nodo/coordenada/punto.

source: Cost to traverse from the current ``node`` to the next ``node`` in the path sequence.
es: Coste que se debe recorrer desde el ``nodo`` al siguiente ``nodo`` en la secuencia de ruta.

source: ``0`` for the last row in the path sequence.
es: ``0`` para la última fila de la secuencia de ruta.

source: Aggregate cost from the ``node`` at ``seq = 1`` to the current node.
es: Costo agregado del ``nodo`` en ``seq = 1`` hacia el nodo actual.

source: ``0`` for the first row in the path sequence.
es: ``0`` para la primera fila de la secuencia de ruta.

source: See Also
es: Ver también

source: References
es: Referencias

source: `Simulated annaeling algorithm for beginners <https://www.theprojectspot.com/tutorial-post/simulated-annealing-algorithm-for-beginners/6>`__
es: `Algoritmo de Recocido Simulado para principiantes <https://www.theprojectspot.com/tutorial-post/simulated-annealing-algorithm-for-beginners/6>`__

source: Indices and tables
es: Índices y tablas
