Repository: pgRouting/pgrouting
Catalog: doc/i18n/*/LC_MESSAGES/src/apsp_johnson/doc/index.po
Languages: fr

source: pgr_apspJohnson - All Pairs Shortest Path, Johnson's Algorithm
fr: pgr_apspJohnson - Plus court chemin toutes paires, algorithme de Johnson

source: Name
fr: Nom

source: ``pgr_apspJohnson`` - Returns all costs for each pair of nodes in the graph.
fr: ``pgr_apspJohnson`` - Retourne tous les coûts pour chaque paire de noeuds dans le graphe.

source: Johnson's algorithm is a way to find the shortest paths between all pairs of vertices in a sparse, edge weighted, directed graph. Returns a set of :ref:`pgr_costResult <type_cost_result>` (seq, id1, id2, cost) rows for every pair of nodes in the graph.
fr: L'algorithme de Johnson est un moyen de trouver les plus courts chemins entre toutes les paires de sommets dans un graphe épars, pondéré arête, dirigé. Retourne un ensemble de lignes :ref:`pgr_costResult <type_cost_result>` (seq, id1, id2, cost) pour chaque paire de nœuds dans le graphe.

source: a SQL query that should return the edges for the graph that will be analyzed:
fr: une requête SQL qui maintient les arêtes pour le graphe qui sera analysé :

source: ``int4`` identifier of the source vertex for this edge
fr: ``int4`` identifiant du sommet source pour cette arête

source: ``int4`` identifier of the target vertex for this edge
fr: ``int4`` identifiant du sommet cible pour cette arête

source: ``float8`` a positive value for the cost to traverse this edge
fr: ``float8`` une valeur positive pour le coût pour traverser cette arête

source: Returns set of :ref:`type_cost_result`:
fr: Retourne un ensemble de :ref:`type_cost_result`:

source: row sequence
fr: séquence de ligne

source: source node ID
fr: ID noeud source

source: target node ID
fr: ID nœud cible

source: cost to traverse from ``id1`` to ``id2``
fr: coût pour traverser de ``id1`` en utilisant ``id2``

source: History
fr: Histoire

source: New in version 2.0.0
fr: Nouveau depuis la version 2.0.0

source: Examples
fr: Exemples

source: The query uses the :ref:`sampledata` network.
fr: La requête utilise le réseau :ref:`sampledata`.

source: See Also
fr: Voir aussi
