Repository: pgRouting/pgrouting
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/tutorial/topology.po
Languages: fr

source: Routing Topology
fr: Topologie de routage

source: Stephen Woodbridge. The source code is released under the MIT-X license.
fr: Stephen Woodbridge. The code source est distribué sous la licence MIT-X.

source: Overview
fr: Présentation

source: Typically when GIS files are loaded into the data database for use with pgRouting they do not have topology information assocated with them. To create a useful topology the data needs to be "noded". This means that where two or more roads form an intersection there it needs to be a node at the intersection and all the road segments need to be broken at the intersection, assuming that you can navigate from any of these segments to any other segment via that intersection.
fr: Typiquement quand les fichiers SIG sont chargés dans la base de données pour l'utilisation de pgRouting ils n'ont pas d'information de typologie qui leur sont associés. Pour créer une topologie utile, les données ont besoin d'être "noded". Cela signifie que là où deux ou plus de routes forment une intersection, il y a besoin d'avoir un nœud à l'intersection et tous les segments de routes doivent être rompus à l'intersection, supposant que vous pouvez naviguer à partir de n'importe lequel de ces segments vers n'importe quel autre segment via l'intersection.

source: You can use the :ref:`graph analysis functions <analytics>` to help you see where you might have topology problems in your data. If you need to node your data, we also have a function :ref:`pgr_nodeNetwork() <pgr_node_network>` that might work for you. This function splits ALL crossing segments and nodes them. There are some cases where this might NOT be the right thing to do.
fr: Vous pouvez utiliser les :ref:`graph analysis functions <analytics>` pour vous aider à voir où vous pourrie avoir des problèmes de topologie dans vos données. Si vous avez besoin de nouer vos données, nous avons aussi une fonction :ref:`pgr_nodeNetwork() <pgr_node_network>` qui pourrait fonctionner pour vous. La fonction sépare TOUS les segments et les noue. Il y a certaines cas où cela pourrait ne pas être la bonne chose à faire.

source: For example, when you have an overpass and underpass intersection, you do not want these noded, but pgr_nodeNetwork does not know that is the case and will node them which is not good because then the router will be able to turn off the overpass onto the underpass like it was a flat 2D intersection. To deal with this problem some data sets use z-levels at these types of intersections and other data might not node these intersection which would be ok.
fr: Par exemple, quand vous avez une intersection entre une route supérieure et inférieure, vous ne voulez pas qu'elle soit nouée, mais pgr_nodeNetwork ne sait pas que c'est le cas et va les nouer avec eux ce qui n'est pas bien parce qu'ensuite le conducteur sera capable d'éteindre la route supérieure sur la route inférieure comme cela était une intersection plate 2D. Pour faire face à ce problème certains jeux de données à ces types utilisent les z-levels à ces types d'intersections et autres données pourraient ne pas nouer cette intersection ce qui serait ok.

source: For those cases where topology needs to be added the following functions may be useful. One way to prep the data for pgRouting is to add the following columns to your table and then populate them as appropriate. This example makes a lot of assumption like that you original data tables already has certain columns in it like ``one_way``, ``fcc``, and possibly others and that they contain specific data values. This is only to give you an idea of what you can do with your data.
fr: Pour ces cas où la topologie a besoin d'être ajoutée les fonctions suivantes peuvent être utiles. Une façon de préparer les données pour pgRouting est d'ajouter les colonnes suivantes à votre table et ensuite les remplir comme approprié. Cet exemple fait un tas d'hypothèses comme que vos tables de données originales ont certaines colonnes comme ``one_way``, ``fcc``, et possiblement autres et qu'ils contiennent des valeurs de données spécifiques. Ceci est seulement pour vous donner une idée de ce que vous pouvez faire avec vos données.

source: The function :ref:`pgr_createTopology() <pgr_create_topology>` will create the ``vertices_tmp`` table and populate the ``source`` and ``target`` columns. The following example populated the remaining columns. In this example, the ``fcc`` column contains feature class code and the ``CASE`` statements converts it to an average speed.
fr: La fonction :ref:`pgr_createTopology() <pgr_create_topology>` va créer la table ``vertices_tmp`` et remplir la ``source`` et les colonnes ``target``. L'exemple suivant remplit les colonnes suivantes. Dans cet exemple, la colonne ``fcc`` contient le code de la classe fonctionnalité et les instructions ``CASE`` le convertissent en une vitesse moyenne.

source: Now your database should be ready to use any (most?) of the pgRouting algorithms.
fr: Maintenant votre base de données devrait être prête pour utiliser n'importe (la plupart ?) des algorithmes de pgRouting.

source: See Also
fr: Voir aussi
